<template>
  <div class="agree-container">
    <div class="a-wrapper">
      <div class="agreement-content" @scroll="scrollEvent" ref="content">
        <h2>《平台注册协议》</h2>
        <p>
          有解债转信息平台平台系由奇宜加（北京）信息技术有限公司负责运营。在您注册成为有解债转信息平台用户前请务必仔细阅读以下条款。若您一旦注册，则表示您同意接受有解债转信息平台的服务并受以下条款的约束。若您不接受以下条款，请您立即停止注册或主动停止使用有解债转信息平台的服务。
        </p>
        <p class="title">一、协议的签署和修订</p>
        <div>
          <p>
            1、有解债转信息平台接受持有中国有效身份证明、年满18
            周岁且具有完全民事行为能力的自然人或者在中国合法成立并有效存续的法人组织成为平台用户。如您不符合资格，请勿注册，否则有解债转信息平台平台有权随时中止或终止您的用户资格。
          </p>
          <p>
            2、本协议内容包括以下条款及平台已经发布或将来可能发布的各类规则。所有规则为本协议不可分割的一部分，与协议正文具有同等法律效力。本协议是您与有解债转信息平台共同签订的，适用于您在有解债转信息平台的全部活动。在您注册成为用户时，您已经阅读、理解并接受本协议的全部条款及各类规则，并承诺遵守中国的各类法律规定。如有违反而导致任何法律后果的发生，您将以自己/法人的名义独立承担所有相应的法律责任。
          </p>
          <p>
            3、有解债转信息平台有权根据需要不时地修改本协议或根据本协议制定、修改各类具体规则并在有解债转信息平台相关系统板块发布，无需另行单独通知您。
          </p>
          <p>
            4、您应不时地注意本协议及具体规则的变更，若您在本协议及具体规则内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议和具体规则内容，也将遵循修改后的协议和具体规则使用有解债转信息平台的服务；同时就您在协议和具体规则修订前通过有解债转信息平台进行的交易及其效力，视为您已同意并已按照本协议及有关规则进行了相应的授权和追认。若您不同意修改后的协议内容，您应停止使用有解债转信息平台平台的服务。
          </p>
          <p>
            5、您通过自行或授权有关方根据本协议及有解债转信息平台平台有关规则、说明操作确认本协议后，本协议即在您和有解债转信息平台平台之间产生法律效力。本协议不涉及您与有解债转信息平台平台的其他用户之间产生的法律关系或法律纠纷。但您在此同意将全面接受和履行与有解债转信息平台平台其他用户在有解债转信息平台平台签订的任何电子法律文本，并承诺按该等法律文本享有和/或放弃相应的权利、承担和/或豁免相应的义务。
          </p>
        </div>
        <p class="title">二、 服务的提供</p>
        <div>
          <p>
            1、有解债转信息平台提供的服务包括但不限于：用户债权确权、债权信息技术管理、用户信息保密、债权转消费服务、债权转让服务、信息发布、信息撮合、数据保全、电子合同签订和保全、资源匹配服务等，具体服务详情以有解债转信息平台平台当时提供的服务内容为准。
          </p>
          <p>
            2、基于运行和交易安全的需要，有解债转信息平台可以暂时停止提供、限制或改变有解债转信息平台服务的部分功能，或提供新的功能。在任何功能减少、增加或者变化时，只要您仍然继续使用有解债转信息平台的服务，表示您认可并同意有解债转信息平台平台上述服务内容的改变。
          </p>
          <p>
            3、您确认，您在有解债转信息平台上按服务业务流程所确认的操作将成为有解债转信息平台为您进行相关服务操作（包括但不限于债权信息发布、用户信息发布、债权交易、订立电子合同、代为支付或收取款项、用户债权账户管理等）的明确指令。您同意有解债转信息平台有权按相关指令依据本协议和/或有关文件和规则对相关事项进行处理。
          </p>
        </div>
        <p class="title">三、服务需知</p>
        <div>
          <p>
            1、基于本平台提供网络服务的重要性，您确认并同意：
          </p>
          <div class="info">
            <p>
              （1）您提供的注册资料真实、准确、完整、合法有效，注册资料如有变动的，应及时更新。
            </p>
            <p>
              （2）如果您提供的注册资料不合法、不真实、不准确、不详尽，您须承担因此引起的相应责任及后果，且有解债转信息平台保留终止您使用本平台各项服务的权利。
            </p>
          </div>
        </div>
        <p class="title">四、债权及交易管理</p>
        <div>
          <p>
            1、有解债转信息平台将为您的提供债权交易服务，并在服务过程中根据有关文件、协议或债权交易市场平台页面的相关规则、说明等收取必要的服务或管理费用，其具体内容、比例、金额等事项请参见有关文件及债权交易市场平台相关页面的规则和说明。
          </p>
          <p>
            2、您同意，有解债转信息平台有权不时调整前述服务或管理费用的类型或金额等具体事项，并根据本协议和相关规则进行公告、修改。
          </p>
          <p>
            3、根据我国法律及税收政策，有解债转信息平台所有用户有义务按时、足额的缴纳税费。本平台暂时采取用户自行申报并缴纳税款的形式执行。有解债转信息平台将随时根据税务部门的最新政策或指导意见，即时调整用户税款缴纳问题的执行方式。
          </p>
          <p>
            4、若相关税务部门要求有解债转信息平台提供用户账户信息以核实用户自行申报的在平台收入的具体数额，平台有权不经用户同意而进行披露，并根据国家法律配合相关税务部门的其他合法要求。
          </p>
          <p>
            5、用户使用第三方支付方式所产生的手续费等由用户自行承担。
          </p>
          <p>
            6、您保证并承诺您通过有解债转信息平台进行交易的资金来源合法。您同意，有解债转信息平台有权根据包括但不限于公安机关、检察机关、法院等司法机关、行政机关、军事机关的要求协助对您的账户及资金等进行查询、冻结或扣划等操作。
          </p>
          <p>
            7、有解债转信息平台有权基于交易安全等方面的考虑不时设定涉及交易的相关事项，包括但不限于交易限额、交易次数等。您已充分了解：有解债转信息平台的前述设定可能会对您的交易造成一定不便，您对此没有异议。
          </p>
          <p>
            8、如果有解债转信息平台发现了因系统故障或其他原因导致的处理错误，无论有利于本平台还是有利于您，有解债转信息平台都有权根据本协议规定通知您后纠正该错误。
          </p>
          <p>
            9、在任何情况下，对于您使用有解债转信息平台服务过程中涉及由第三方提供相关服务的责任由该第三方承担，有解债转信息平台平台对此不承担任何法律责任。因您自身的原因导致本平台服务无法提供或提供时发生任何错误而产生的任何损失或责任，由您自行负责，有解债转信息平台平台不承担责任。
          </p>
        </div>
        <p class="title">五、 电子合同</p>
        <p>
          1、在有解债转信息平台交易需订立的协议采用电子合同方式，可以有一份或者多份并且每一份具有同等法律效力。有解债转信息平台将为您的协议提供数据保全，已备您后续查用或用作证据使用。您根据有解债转信息平台的相关规则在本平台使用您本人签章确认签署的电子合同即视为您本人的真实意思表达和接受其产生的法律后果，具有完全法律效力。
        </p>
        <p>
          2、您应妥善保管自己的账户密码等账户信息，您通过前述方式订立的电子合同对合同各方具有法律约束力，您不得以账户密码等账户信息被盗用或其他理由否认已订立的合同的效力或不按照该等合同履行相关义务，否则您将承担相应法律责任。
        </p>
        <p>
          3、您根据有解债转信息平台的相关规则签署电子合同后，不得擅自修改该合同。有解债转信息平台向您提供电子合同的保管、查询、核对、数据保全等服务，如对电子合同真伪或电子合同的内容有任何疑问，您可联系有解债转信息平台相关员工查阅有关合同并进行核对。
        </p>
        <p class="title">六、 用户信息及隐私权保护</p>
        <p>
          1、您知悉并同意，为方便您使用本平台相关服务，本平台将存储您的必要信息，包括但不限于您的真实姓名、身份证号码、债权信息、债权数额、银行卡号、交易信息等。除法律法规规定的情形外，未经您的许可有解债转信息平台不会向第三方公开、透露您的个人信息。有解债转信息平台对相关信息采取专业加密存储与传输方式，利用合理措施保障用户个人信息的安全。
        </p>
        <p>
          2、您在使用本平台某一特定业务板块服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“服务协议”），您在使用该项服务前请阅读并同意相关的服务协议；您使用前述特定服务，即视为您已阅读并同意接受相关单独协议。
        </p>
        <p>
          3、您充分理解并同意：
        </p>
        <div class="info">
          <p>
            （1）您将通过邮件、短信、电话等形式，接受本平台向您发送的有关平台服务活动、债权管理、债权交易、债权转消费、消费订单等内容。
          </p>
          <p>
            （2）为配合行政监管机关、司法机关执行工作，在法律规定范围内有解债转信息平台有权向上述行政、司法机关提供您在使用本平台时所储存的相关信息，包括但不限于您的债权信息等。
          </p>
          <p>
            （3）有解债转信息平台有权根据实际情况，在法律规定范围内自行决定单个用户在本平台及服务中数据的最长储存期限以及用户日志的储存期限，并在服务器上为其分配数据最大存储空间等。
          </p>
          <p>
            （4）为了更好的向用户提供服务，有解债转信息平台将依据用户的注册信息以及授权书自指定渠道收集您的个人信息数据（包括但不限于：身份信息、认证信息、债权信息、财务信息等），以便更好地了解用户情况，为其量身订造有解债转信息平台平台服务，实现用户需求和确保平台服务的安全性。有解债转信息平台仅收集用户授权范围内且与平台服务目的达成所必须的个人资料。
          </p>
          <p>
            （5）有解债转信息平台按照您在平台上的行为自动追踪关于您的某些资料。有解债转信息平台平台将利用这些资料进行有关用户的行为画像及行为的内部研究，以更好地了解您以便向您和其他用户提供更好的服务。
          </p>
        </div>
        <p>
          5、用户信息的使用和披露
        </p>
        <div class="info">
          <p>
            （1）您同意有解债转信息平台可使用关于您的个人信息数据以协助解决争议、对纠纷进行调停、确保在有解债转信息平台进行安全交易，并执行有解债转信息平台的服务协议及相关规则。为限制平台上的欺诈、非法或其他刑事犯罪活动，使有解债转信息平台免受其害，您同意平台可通过人工或自动程序对您的个人资料进行评价。
          </p>
          <p>
            （2）您使用有解债转信息平台服务进行债权交易时，您即授权本公司将您必要的个人信息、身份认证信息、债权信息、财务信息和交易信息披露给与您交易的另一方或有解债转信息平台平台的合作机构（仅限于本平台向您提供服务的合作机构）。
          </p>
        </div>
        <p>
          6、您对其他用户信息的使用
        </p>
        <div class="info">
          <p>
            （1）在有解债转信息平台提供的交易活动中，您无权要求平台提供其他用户的个人详细信息数据，除非您已向法院起诉其他用户的在有解债转信息平台活动中的违法或违约行为；
          </p>
          <p>
            （2）如您通过签署有关协议等方式获得其他用户的个人信息，您同意不将该等个人信息用于除履行相关协议以外的其他任何用途，除非该等信息根据适用的法律规定、被有管辖权的法院或政府部门要求披露。
          </p>
        </div>
        <p class="title">七、用户行为规范</p>
        <p>
          1、本协议依据国家相关法律法规规章制定，您同意严格遵守以下义务：
        </p>
        <div class="info">
          <p>
            （1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论
          </p>
          <p>
            （2）从中国大陆向境外传输资料信息时必须符合中国有关法律法规；
          </p>
          <p>
            （3）不得利用本平台从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；
          </p>
          <p>
            （4）不得干扰本平台的正常运转，不得侵入本平台及国家计算机信息系统；
          </p>
          <p>
            （5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料；
          </p>
          <p>
            （6） 不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；
          </p>
          <p>
            （7）不得教唆他人从事本条所禁止的行为；
          </p>
          <p>
            （8）不得利用在本平台注册的账户进行牟利性经营活动；
          </p>
          <p>
            （9）不得发布任何侵犯他人隐私、个人信息、著作权、商标权等知识产权或合法权利的内容；
          </p>
        </div>
        <p>
          2、您须对自己在网上的言论和行为承担法律责任，您若在本平台上散布和传播反动、色情或其它违反国家法律的信息，本平台的系统记录有可能作为您违反法律的证据。
        </p>
        <p class="title">八、本平台使用规范</p>
        <p>
          1、除非法律允许或平台书面许可，您使用本平台过程中不得从事下列行为：
        </p>
        <div class="info">
          <p>
            （1）删除本平台及其副本上关于著作权的信息；
          </p>
          <p>
            （2）对本平台进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本平台的源代码；
          </p>
          <p>
            （3）对有解债转信息平台拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等；
          </p>
          <p>
            （4）对本平台或者本平台运行过程中释放到任何终端内存中的数据、平台运行过程中客户端与服务器端的交互数据，以及本平台运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，包括但不限于使用插件、外挂或非经有解债转信息平台授权的第三方工具/服务接入本平台和相关系统；
          </p>
          <p>
            （5）通过修改或伪造平台运行中的指令、数据，增加、删减、变动平台的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；
          </p>
          <p>
            （6）自行或授权他人、第三方对本平台及其组件、模块、数据进行干扰。
          </p>
        </div>
        <p class="title">九、 不保证及使用限制</p>
        <p>
          1、不保证
        </p>
        <div class="info">
          <p>
            （1）在任何情况下，有解债转信息平台均不以任何明示或默示的方式对您使用有解债转信息平台平台服务而产生的任何形式的直接或间接损失承担法律责任，包括但不限于债权损失、资金损失、信息中断损失等，
          </p>
          <p>
            （2）因为有解债转信息平台平台或者涉及的第三方平台的设备、系统存在缺陷、黑客攻击、网络故障、电力中断、计算机病毒或其他不可抗力因素造成的损失，有解债转信息平台平台均不负责赔偿。
          </p>
        </div>
        <p>
          2、使用限制
        </p>
        <div class="info">
          <p>
            （1）您承诺合法使用有解债转信息平台提供的服务及平台内容。您不得利用本服务从事侵害他人合法权益之行为，不得在有解债转信息平台平台从事任何可能违反中国的法律、法规、规章和政府规范性文件的行为或者任何未经授权的行为。
          </p>
          <p>
            （2）有解债转信息平台没有义务监测平台内容，但是您确认并同意有解债转信息平台有权不时地根据法律、法规、政府要求透露、修改或者删除必要的信息，以便更好地运营有解债转信息平台平台并保护自身及平台的其他合法用户。
          </p>
          <p>
            （3）由于您违反本协议或任何法律、法规或侵害第三方的权利，而引起第三方对有解债转信息平台提出的任何形式的索赔、要求、诉讼，有解债转信息平台有权向您追偿相关损失，包括但不限于：平台的诉讼费用、律师费、调查费、差旅费、名誉损失、及向第三方支付的赔偿金、补偿金等。
          </p>
        </div>
        <p class="title">十、 协议终止及账户的暂停、注销或终止</p>
        <p>
          1、除非有解债转信息平台终止本协议或者您申请终止本协议且经有解债转信息平台同意，否则本协议始终有效。在您违反了本协议或相关规则，或在相关法律法规、政府部门的要求下，有解债转信息平台有权通过站内信、电子邮件通知等方式终止本协议、关闭您的账户或者限制您使用本平台。但有解债转信息平台的终止行为不能免除您根据本协议或在本平台生成的其他协议项下的还未履行完毕的义务。
        </p>
        <p>
          2、您若发现有第三人冒用或盗用您的用户账户及密码，或其他任何未经合法授权的情形，应立即以有效方式通知有解债转信息平台，要求平台暂停相关服务，否则由此产生的一切责任由您本人承担。同时，您理解本平台对您的请求采取行动需要合理期限，在此之前，有解债转信息平台对第三人使用该服务所导致的损失不承担任何责任。
        </p>
        <p>
          3、您决定不再使用用户账户时，应首先将用户账户中的可用权益（如有）全部实现或者向有解债转信息平台发出其它合法的指令，并向有解债转信息平台申请注销该用户账户，经平台审核同意后可正式注销用户账户。
        </p>
        <p>
          4、已注册会员死亡或被宣告死亡的，其在本协议项下的各项权利义务由其继承人承担。若会员丧失全部或部分民事权利能力或民事行为能力，有解债转信息平台有权根据有效法律文书（包括但不限于生效的法院判决等）或其法定监护人的指示处置与用户账户相关的权益。
        </p>
        <p>
          5、有解债转信息平台有权基于单方独立判断，在认为可能发生危害交易安全等情形时，不经通知而先行暂停、中断或终止向您提供本协议项下的全部或部分服务，且无需对您或任何第三方承担任何责任。前述情形包括但不限于：
        </p>
        <div class="info">
          <p>
            （1）平台发现异常交易或有疑义或有违法之余时；
          </p>
          <p>
            （2）平台认为您的账户涉嫌洗钱、套现、传销、被冒用或其他有解债转信息平台平台认为有风险之情形；
          </p>
          <p>
            （3）平台认为您已经违反本协议中规定的各类规则及精神；
          </p>
          <p>
            （4）平台基于交易安全等原因，根据其单独判断需先行暂停、中断或终止向您提供本协议项下的全部或部分会员服务的其他情形。
          </p>
        </div>
        <p class="title">十一、所有权及知识产权</p>
        <p>
          1、除法律另有强制性规定外，未经有解债转信息平台明确的特别书面许可,任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本平台的信息内容，否则，有解债转信息平台有权追究其法律责任。
        </p>
        <p>
          2、本平台所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是有解债转信息平台或其内容提供者的财产、本平台上所有内容的汇编是有解债转信息平台的排他财产、本平台上所有软件都是有解债转信息平台或其关联公司或其软件供应商的财产，均受法律保护。
        </p>
        <p class="title">十二、 通知</p>
        <p>
          1、本协议项下的通知如以公示方式作出，一经在有解债转信息平台公示即视为已经送达。除此之外，其他向您个人发布的具有专属性的通知将由有解债转信息平台向您在注册时提供的电子邮箱，或本平台在您的个人账户中为您设置的站内消息系统栏，或您在注册后在本平台绑定的手机发送，一经发送即视为已经送达。请您密切关注您的电子邮箱
          、站内消息系统栏中的邮件、信息及手机中的短信信息。
        </p>
        <p>
          2、您同意有解债转信息平台出于向您提供服务之目的，可以向您的电子邮箱、站内消息系统栏和手机发送有关通知或提醒；若您不愿意接收，请在有解债转信息平台平台相应系统板块进行设置。若您设置了不接收有关通知或提醒，则您有可能收不到该等通知信息，您不得以您未收到或未阅读该等通知信息为由，单方面理解为相关通知未送达于您。
        </p>
        <p class="title">十三、法律管辖适用及其他</p>
        <p>
          1、本协议的订立、执行和解释及争议的解决均应适用中国法律。如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，应向协议签订地有管辖权的人民法院提起诉讼。本协议签订地为中华人民共和国北京市海淀区。
        </p>
        <p>
          2、如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。
        </p>
        <p>
          3、本协议未明示授权的其他权利仍由有解债转信息平台保留，您在行使这些权利时须另外取得有解债转信息平台的许可。有解债转信息平台若未行使前述任何权利，并不构成对该权利的放弃。
        </p>
        <p>
          4、有解债转信息平台对本协议拥有最终的解释权。本协议及本平台有关页面的相关名词可互相引用参照，如有不同理解，则以本协议条款为准。
        </p>
      </div>
    </div>
    <!-- <div class="mark" v-if="!isBottom"></div> -->
    <!-- <div class="btn-container">
      <div class="check-container" @click="change">
        <div class="check" :class="{ active: isCheck }"></div>
        <span>我已阅读并同意该协议内容</span>
      </div>
      <button :class="{ disabled: !isCheck }" @click="goAuth">同意并继续</button>
    </div> -->
  </div>
</template>

<script>
export default {
  data() {
    return {
      isCheck: false,
      isBottom: false
    }
  },
  methods: {
    change() {
      this.isCheck = !this.isCheck
    },
    scrollEvent(e) {
      let target = e.target
      if (target.scrollHeight - target.scrollTop - target.clientHeight <= 10) {
        this.isBottom = true
      } else {
        this.isBottom = false
      }
    },
    goAuth() {
      this.$router.push({ name: 'AuthChooseOgnztion' })
    }
  }
}
</script>

<style lang="less" scoped>
.agree-container {
  height: 100%;
  display: flex;
  flex-direction: column;
  align-items: center;
  background-color: #fff;
  overflow: auto;
  position: relative;
}
.a-wrapper {
  flex: 1;
  overflow: auto;
  position: relative;
  // &:after {
  //   content: '';
  //   position: absolute;
  //   z-index: 2;
  //   left: 0;
  //   bottom: 0;
  //   width: 100%;
  //   height: 150px;
  //   background: linear-gradient(181deg, rgba(255, 255, 255, 0) 0%, rgba(255, 255, 255, 1) 100%);
  // }
}
.agreement-content {
  box-sizing: border-box;
  width: 100%;
  height: 100%;
  padding: 15px 24px 30px;
  color: #888;
  overflow: auto;
  h2 {
    text-align: center;
    font-size: 16px;
    line-height: 22px;
  }
  // p {
  //   font-size: 13px;
  //   line-height: 20px;
  //   text-indent: -22px;
  //   margin-left: 22px;
  // }
  // .title {
  //   color: #000;
  //   line-height: 30px;
  //   margin-top: 10px;
  // }
  // .info {
  //   margin-top: 3px;
  //   margin-left: 12px;
  // }
  p {
    padding-top: 15px;
    font-size: 14px;
    line-height: 24px;
  }
}
.mark {
  position: fixed;
  bottom: 121px;
  width: 100%;
  height: 50px;
  background: linear-gradient(181deg, rgba(255, 255, 255, 0) 0%, rgba(255, 255, 255, 1) 100%);
}
.btn-container {
  flex-basis: 121px;
  display: flex;
  align-items: center;
  flex-direction: column;
  .check-container {
    margin-top: 13px;
    display: flex;
    justify-content: center;
    align-items: center;
    font-size: 0;
    .check {
      width: 13px;
      height: 13px;
      border-radius: 2px;
      border: 1px solid @themeColor;
      margin-right: 6px;
      &.active {
        width: 14px;
        height: 14px;
        border: none;
        background: url('../../assets/image/confirmation/icon-checked-on2.png') no-repeat;
        background-size: 14px;
      }
    }
    span {
      font-size: 12px;
      color: #999;
      line-height: 17px;
      & + span {
        color: #404040;
      }
    }
  }
  button {
    margin-top: 15px;
    width: 327px;
    height: 46px;
    background-color: @themeColor;
    border-radius: 2px;

    font-size: 18px;
    color: #fff;
    &.disabled {
      opacity: 0.5;
      pointer-events: none;
    }
  }
}
</style>
