<html>
<head>
    <meta charset="UTF-8">
    <title>协议</title>
</head>
<body>
<div>顾问协议</div>
<div><br />
</div>
<div>协议编号：<{$number}></div>
<div><br />
</div>
<div>甲方（出借/受让方）:<{$loan_real_name}></div>
<div>会员编号：<{$loan_user_number}></div>
<div>身份证件号/统一社会信用代码/营业执照号：<{$loan_user_idno}></div>
<div><br />
</div>
<div>乙方（顾问方）：北京网信云服信息科技有限公司</div>
<div>会员编号：0038XUJC</div>
<div>统一社会信用代码/营业执照号：91110105MA002XUB9G</div>
<div><br />
</div>
<div>丙方（平台方）：北京东方联合投资管理有限公司</div>
<div>会员编号：0032FR7Z</div>
<div>统一社会信用代码/营业执照号：91110105576865680R</div>
<div><br />
</div>
<div><br />
</div>
<div>鉴于：</div>
<div>&nbsp; &nbsp; 1、丙方为一家从事互联网金融综合信息技术服务的专业化公司，其运营的网信普惠平台（网址：www.firstp2p.cn，以下简称“平台”或“丙方平台”）作为网络借贷信息中介，依托互联网技术服务，为客户提供信息发布及交易撮合服务。</div>
<div>&nbsp; &nbsp; 2、甲方愿意在充分了解并清楚知晓相关风险的前提下，委托乙方为其提供顾问服务。</div>
<div>&nbsp; &nbsp; 3、乙方为网信普惠平台合作的顾问方，拥有自动出借(“出借”即直接出借或受让本平台其他出借人债权，下同)和自动转让技术，依托于丙方平台为甲方提供顾问服务。</div>
<div>&nbsp; &nbsp; 根据《中华人民共和国合同法》及其他相关法律、法规的规定，甲、乙、丙三方经协商一致，就乙方通过丙方平台接受甲方委托向甲方提供顾问服务（以下统称为“智多鑫”）等相关事宜，达成如下协议，以资共同信守。</div>
<div>第一条 出借金额及期限</div>
<div>&nbsp; &nbsp; 1.1甲方出借资金为人民币<{$loan_money}>元整，大写人民币<{$uppercase_loan_money}>。</div>
<div>&nbsp; &nbsp; 1.2甲乙双方约定提供顾问期限自甲方加入“智多鑫”之日起至退出“智多鑫”之日止。</div>
<div>第二条 服务内容</div>
<div>&nbsp; &nbsp; 2.1乙方接受甲方委托，将甲方出借资金按照一定比例分散出借于不同的优选项目。甲方的出借资金所返还的本金部分将继续由乙方提供自动出借服务，且同样适用本协议的各项约定。</div>
<div>&nbsp; &nbsp; 2.2在向优选项目出借成功后（具体优选项目的到期日除外），甲方可以依据“智多鑫”规则申请债权转让。</div>
<div>第三条 结算方式</div>
<div>&nbsp; &nbsp; 3.1甲方出借资金获得的应收款项将按照出借所对应具体优选项目约定的方式支付。具体以线上产品详情页公布信息为准。</div>
<div>&nbsp; &nbsp; 3.2甲方出借资金获得的应收款项取决于优选项目对应的借款人是否按期足额偿还借款本息，乙方不对甲方加入“智多鑫”的出借资金获得的应收款项做任何的保证和承诺，甲方应自行承担加入“智多鑫”后的出借风险。</div>
<div>第四条 相应费用</div>
<div>&nbsp; &nbsp; 4.1乙方根据甲方加入（“加入”是指从出借人加入智多鑫起至申请债权转让/退出止，下同）时间收取管理服务费。</div>
<div>&nbsp; &nbsp; 4.1.1甲方在加入<{$fee_days}>日（含本日）后申请债权转让/退出的，乙方免收管理服务费。</div>
<div>&nbsp; &nbsp; 4.1.2甲方在加入<{$fee_days}>日内申请债权转让/退出的，应按照本金的<{$fee_rate}>%（年化）向乙方支付管理服务费。</div>
<div>&nbsp; &nbsp; 管理服务费=加入资金×管理服务费率×加入天数÷360</div>
<div>&nbsp; &nbsp; 4.1.3管理服务费在甲方申请债权转让/退出后从甲方应收款项中直接扣除。</div>
<div>&nbsp; &nbsp; 4.2乙方就其为甲方提供的顾问服务向甲方收取顾问服务费。</div>
<div>&nbsp; &nbsp; 4.2.1顾问服务费根据甲方出借的优选项目决定，参考顾问服务费率（年化）如下：3.03%/优选项目期限为12个月、3.51%/优选项目期限为24个月、4.09%/优选项目期限为36个月。</div>
<div>&nbsp; &nbsp; 顾问服务费=出借本金×顾问服务费率×出借天数÷360</div>
<div>&nbsp; &nbsp; 4.2.2顾问服务费随优选项目每期回款向甲方支付的应付款项中直接扣除。</div>
<div>第五条 特别授权条款</div>
<div>&nbsp; &nbsp; <b><u>5.1甲方授权乙方在丙方平台上选择优质项目，利用乙方的自动出借和自动转让技术，将甲方拟出借资金分散出借于不同的优选项目，在甲方申请转让时协助其进行转让，同时授权乙方以甲方名义签署相关协议（包括但不限于借款合同、债权转让协议等），甲方对于上述授权已充分知悉并理解，对于乙方代为签署的相关协议视为甲方真实意思表示，甲方对该等法律文件的效力均予以认可并无任何异议。</u></b></div>
<div>&nbsp; &nbsp; <b><u>5.2甲方授权丙方在乙方代为签署的相关协议生效后可根据上述协议及本协议的相关约定直接向存管银行发送资金划转申请或指令（包括不限于冻结、划扣等），甲方对此均予以接受和认可。</u></b></div>
<div>&nbsp; &nbsp; <b><u>5.3 甲方不可撤销的授权乙方在因国家法律法规、监管政策和顾问方战略方向等发生变化导致本协议目的不能实现时，代甲方转让甲方所持有的优选项目下所有债权。</u></b></div>
<div>&nbsp; &nbsp; <b><u>5.4甲方同意加入“智多鑫”，并自愿遵守其在平台已经签署的相关协议、“智多鑫”规则和平台不定时更新的各类产品及活动规则（包括但不限于礼券规则、红包规则及优惠劵规则等）。</u></b></div>
<div>&nbsp; &nbsp; <b><u>5.5如甲方加入“智多鑫”的出借资金连续超过30日没有可供出借的项目时，甲方授权乙方协助安排甲方出借资金自动退出“智多鑫”。</u></b></div>
<div>&nbsp; &nbsp; <b><u>5.6如因司法机关或行政机关对甲方采取强制措施导致其“智多鑫”出借金额对应的资金被全部或部分扣划，本协议自动终止，乙方可协助甲方完成协议终止后的相关事项（如有）。</u></b></div>
<div>第六条 税费</div>
<div>&nbsp; &nbsp; 6.1各方在履行本协议权利义务过程中产生的相关税费，由各方自行向主管税务机关申报、缴纳，若因此而导致他方损失，由损害方补偿。</div>
<div>第七条 各方声明和保证</div>
<div>&nbsp; &nbsp; 7.1在签署本协议书以前，甲方已认真阅读本协议有关条款，对有关条款不存在任何疑问或异议，并对己方的权利、义务、责任与风险有清楚和准确的理解。</div>
<div>&nbsp; &nbsp; 7.2甲方保证所使用的资金为合法取得，且具有排他性的支配权。</div>
<div>&nbsp; &nbsp; 7.3甲方保证为履行本协议而向乙方提供的全部资料、信息均真实、有效。</div>
<div>&nbsp; &nbsp; 7.4甲方确认已充分了解出借风险，具备相应的出借风险意识、风险认知、识别、承受能力，了解非保本类金融产品并熟悉互联网。</div>
<div>&nbsp; &nbsp; 7.5乙方将严格按照本协议的约定恪尽职守，以诚实、信用、谨慎、有效管理为原则，依托于其拥有的自动出借和自动转让技术向甲方提供顾问服务。</div>
<div>&nbsp; &nbsp; 7.6乙方应根据甲方的授权精选优质项目，协助甲方完成资金出借、债权转让。</div>
<div>&nbsp; &nbsp; 7.7乙方应对本协议履行过程中获悉的甲方信息、资产情况等依法保密。</div>
<div>&nbsp; &nbsp; 7.8丙方将妥善保存线上签署的与本次交易相关的合同及与合同相关的全部资料以备查阅。对合同各方的信息、资产情况及其他相关情况和资料严格保密，非因交易所需或相关权力部门要求（包括但不限于法院、仲裁机构、金融监管机构等），不得对外披露。</div>
<div>第八条 违约责任</div>
<div>&nbsp; &nbsp; 8.1协议各方均应严格履行本协议义务，除本协议另有约定外，非经各方协商一致，任何一方不得解除本协议。</div>
<div>&nbsp; &nbsp; 8.2任何一方违反本协议的约定，使得本协议全部或部分不能履行的，均应承担违约责任，并赔偿各方因此遭受的损失（包括由此产生的诉讼费和律师费等费用）。</div>
<div>第九条 其他</div>
<div>&nbsp; &nbsp; 9.1由于地震、火灾、战争、国家政策调整等不可抗力导致的交易中断、延误、终止的，各方互不追究责任。但应在条件允许的情况下，应采取一切必要的补救措施以减小不可抗力造成的损失。</div>
<div>&nbsp; &nbsp; 9.2为甲方利益最大化原则，乙方可根据需要将本协议项下的权利义务概括转移给第三方；转移后，第三方作为新的顾问方会通过丙方平台/“智多鑫”页面公示其基本信息，甲方对此不持异议。</div>
<div>&nbsp; &nbsp; 9.3本协议项下产生的纠纷，各方先行协商解决，协商不成的，任何一方可向丙方所在地有管辖权的人民法院提起诉讼。</div>
<div>&nbsp; &nbsp; 9.4本协议采用电子文本形式制成，经各方通过电子合同签署系统在线点击确认后生效，并永久保存在平台为此设立的专用服务器上备查，各方均确认本协议的真实性，并认可该形式协议的法律效力。</div>
<div><br />
</div>
<div><br />
</div>
<div>甲方：<{$loan_real_name}></div>
<div>日期：<{$sign_time}></div>
<div><br />
</div>
<div>乙方：北京网信云服信息科技有限公司</div>
<div>日期：<{$sign_time}></div>
<div><br />
</div>
<div>丙方：北京东方联合投资管理有限公司</div>
<div>日期：<{$sign_time}></div>

</body>
</html>