<template>
  <div class="container">
    <div class="h-container">
      <mt-header class="header" title="协议">
        <header-item slot="left" v-bind:isBack="true" v-on:onclick="goBack"></header-item>
      </mt-header>
    </div>
    <div class="content">
      <h1>用户享受债权之互联网技术服务协议</h1>
      <h4>出借人/投资人（以下简称“甲方”）</h4>
      <h4>有解信息服务平台（以下简称“乙方”）</h4>
      <p>
        用户债权之互联网信息技术管理服务条款是债权持有方（以下简称
        “甲方”）接受乙方信息服务平台（以下简称“乙方”）提供的债权之互联网信息技术管理服务（包括但不限于：<span>
          用户债权的确权服务、用户债权的管理服务、用户债权的交易服务、用户债权的转消费服务等</span
        >）签订的个人数据授权使用协议。
      </p>
      <p>
        在本协议中甲方授权乙方获取其在网信普惠的个人相关数据信息以及授权乙方协助甲方在本平台后续业务实操中签订其它协议或文书。
      </p>
      <p>
        根据《中华人民共和国电商法》及相关法律法规规定，现就乙方向甲方提供债权之互联网信息技术管理服务事宜，在平等自愿、诚实信用的基础下达成如下条款：
      </p>
      <p>
        1、甲方在乙方平台通过网络页面点击确认的方式接受本协议，并同意接受本协议的全部约定内容及有关的各项规则、操作流程、信息获取等内容。
      </p>
      <p>
        2、甲方接受本协议后，表示乙方可与网信普惠就甲方的数据信息进行技术对接。乙方可获取的信息数据应依托于甲方登记提交的个人信息。乙方不得私自获取其它未授权甲方的信息，否则将承担相应的法律责任。
      </p>
      <p>3、甲方授权乙方获取的信息数据包含但不限于：</p>
      <p>（1）甲方个人信息（如：姓名、联系方式、电子邮箱等）；</p>
      <p>（2）甲方身份识别信息（如：身份证号码、护照号码、驾驶证号码等）；</p>
      <p>（3）甲方债权信息（如：网信普惠账号、银行卡号、债权项目名称、债权总额、债权协议编号、债权还本付息方式等）。</p>
      <p>（4）其它与乙方业务有关的必要信息数据（数据范围不得超过乙方向甲方提供的业务范围）。</p>
      <p>
        4、乙方依据甲方授权获取的信息数据的使用范围仅限于提供服务的范围内。禁止乙方私自泄露、利用、倒卖甲方信息数据或实施与服务范围无关的经营行为。
      </p>
      <p>
        5、甲方承诺并保证：上述授权行为是基于甲方已充分了解协议内容及产生的法律后果后，由甲方本人所进行的自愿、合法的行为，不存在非本人所为、遭第三人仿冒、盗用之情形。甲方将承担因授权行为产生的法律责任及后果。
      </p>
      <p>
        6、乙方承诺并保证：在为甲方提供债权确权、管理、消费、转让等服务之前，均已通过合法有效方式或手段与各服务业务板块经营主体达成有效合法的合作基础或取得充分授权（该授权范围能够满足乙方为甲方提供服务的合理使用范围）。
      </p>
      <p>
        7、乙方和甲方均承诺其提供的信息及相关资料符合中华人民共和国相关法律法规之规定，具备真实性与合法性且不侵犯任何第三方权益。
      </p>
      <p>
        8、乙方依据甲方提交的信息，在网信普惠获取甲方相应的信息数据后，将交由甲方对自己的相关债权金额信息进行确权（确认）。甲方应当依据诚实信用的原则实事求是的对个人债权信息数据进行确权（确认）。
        对债权的确权并不会直接导致债权变化，仅是对债权信息确认而已。
      </p>
      <p>
        9、甲方的确权行为系单方民事行为。甲方债权信息一经确权不可撤销、更改。因客观原因（例如：乙方系统原因、不可抗力等情况）导致甲方确权结果存在错误的，甲方应在24小时内与乙方工作人员取得联系，并对此问题提供相关证据进行协商解决。因甲方原因延迟解决产生的损害由甲方独立承担。
      </p>
      <p>
        10、甲方确权成功后，乙方将依据确权后的债权信息数据提供服务。因您自身原因导致确认的债权存在错误致使乙方提供的服务存在错误的，乙方对此不承担任何责任，由甲方承担。
      </p>
      <p>
        11、为了债转工作的进行，甲方需在乙方的电商服务平台开设账户，此电商服务平台需同意甲方使用其在网信普惠注册的手机号码进行注册及后续验证流程。甲方应当审慎保管、使用前述手机号码，通过前述手机号码及验证号码登录电商服务平台的，视为甲方本人的登录行为。
      </p>
      <p>
        12、甲方需将其通过网信普惠平台拥有的各咨询方推荐的在途本金低于500元以下的债权转让给受让方，受让方以与转让债权相应的对价物--在有解商城展示的商品的积分受让甲方的债权；乙方基于协助甲方和受让方双方实现“商品换债权”的电商服务平台，接受甲方和受让方双方的授权委托，协助双方在债权转让过程中的兑换积分及后续交易等事宜。
      </p>
      <p>
        13、受让方以相应的有解商城的商品积分作为受让甲方债权的支付对价。受让方此前已与乙方签订合作协议，并委托乙方寻找合适的欲转让债权的出借人。
      </p>
      <p>
        14、甲方使用电子签章签署债权转让协议后，受让方应当依据约定，委托乙方电商服务平台将和甲方转让债权金额相应的商品积分发送到甲方在乙方电商服务平台开设的账户内，供甲方在乙方电商服务平台上自由使用。
      </p>
      <p>
        15、甲方自在乙方电商服务平台开设的账户收到转让债权相应的积分时，视为受让方的支付义务已经充分、完整、及时地履行，同时意味着债权转让完成；甲方与受让方的债转完成与否不以用户是否用积分兑换商品为准。
      </p>
      <p>
        16、甲方可在乙方电商服务平台用积分进行支付，以此获得商品或者服务（统称：商品）；受让方委托乙方电商服务平台对代售的商品标注可消费的积分，以便甲方进行后续交易。
      </p>
      <p>
        17、因甲方未能消费或者没有消费积分，或者因在乙方电商服务平台进行买卖、商品物流运输、商品质量等交易过程中所产生的纠纷，为新的法律关系纠纷。
      </p>
      <p>
        18、就本协议涉及的债权兑换积分及后续流程，乙方会根据实际运营情况在其平台配注相应流程细节图解，作为对本协议内容的解释和附注，甲方可自行前往了解。相关内容以本协议约定为准。
      </p>
      <p>
        19、为了更好地为债权转让主体提供服务，甲方有义务按照乙方的平台软件要求操作及查收乙方发出的指示信息，因甲方个人操作不当致使平台指令错误，由此产生的法律责任由甲方自行承担，有解商城对此不承担法律责任。
      </p>
      <p>
        20、乙方为了更好的向甲方提供服务，甲方有义务按照乙方的要求操作平台软件以及查收乙方发出的指示信息，因甲方个人原因操作不当致使平台指令错误，由此产生的纠纷及法律责任由甲方承担，乙方对此免责。
      </p>
      <p>
        21、甲方应认真阅读、充分理解本协议各条款及对乙方具有或可能具有免责或限制责任的内容。如您不同意接受本协议的任意内容，或者无法准确理解相关条款含义的，请您不要进行后续操作。
      </p>
      <p>22、本文件解释权归属于乙方。若发生争议，协商解决，解决不成可诉至北京市朝阳区人民法院。</p>
    </div>
  </div>
</template>

<script>
export default {
  name: 'protocol',
  methods: {
    goBack() {
      this.$router.go(-1)
    }
  }
}
</script>

<style lang="scss" scoped>
.container {
  .h-container {
    height: 44px;
    width: 100%;
    border-bottom: 1px solid #f4f4f4;
  }
  .header {
    @include header;
    @include thin-border(#f4f4f4, 15px);
    width: 100%;
  }
  .content {
    background-color: #fff;
    padding: 20px 10px 40px;
    h1 {
      text-align: center;
      font-size: 20px;
      font-weight: 800;
      padding-bottom: 20px;
    }
    h4 {
      font-size: 14px;
      font-weight: 800;
      padding-bottom: 10px;
    }
    p {
      line-height: 22px;
      font-size: 14px;
      padding-bottom: 10px;
      text-indent: 26px;
      span {
        font-weight: 800;
      }
    }
  }
}
</style>
