<?php
namespace NCFGroup\Protos\Stock\Enum;
use NCFGroup\Common\Extensions\Base\AbstractEnum;

class AbossEnum extends AbstractEnum
{
    public static $entrustDictionary = array(/*{{{*/
        self::CANCEL_BUY => '撤买',
        self::CANCEL_SALE => '撤卖',
        '1' =>   '买入',
        '2' =>   '卖出',
        '3' =>   '缴款',
        '4' =>   '融资',
        '5' =>   '融券',
        '6' =>   '红利',
        '7' =>   '转托转出',
        '8' =>   '配号',
        '9' =>   '指定',
        '10' =>  '撤指',
        '11' =>  '转债转股',
        '12' =>  '转债回售',
        '13' =>  '转债赎回',
        '14' =>  '配售申购',
        '15' =>  '转托转入',
        '16' =>  '送股',
        '17' =>  '兑付',
        '18' =>  '托管转入',
        '19' =>  '托管转出',
        '20' =>  '调帐转入',
        '21' =>  '调帐转出',
        '22' =>  '国债派息',
        '23' =>  '投票',
        '24' =>  '配售放弃',
        '25' =>  '质押冻结',
        '26' =>  '解押解冻',
        '27' =>  '无冻质押',
        '28' =>  '无解解押',
        '29' =>  'ETF申购',
        '30' =>  'ETF赎回',
        '31' =>  '协议转让',
        '32' =>  '现金认购',
        '33' =>  '股票认购',
        '34' =>  '融资购回',
        '35' =>  '融券购回',
        '37' =>  '质押入库',
        '38' =>  '质押出库',
        '41' =>  '基金认购',
        '42' =>  '基金申购',
        '43' =>  '基金赎回',
        '44' =>  '分红设置',
        '45' =>  '基金分红',
        '46' =>  '基金转换',
        '47' =>  '基金分拆',
        '48' =>  '基金合并',
        '49' =>  'ETF冲账',
        '50' =>  '权证行权',
        '51' =>  '权证创设',
        '52' =>  '权证注销',
        '55' =>  '意向买入',
        '56' =>  '意向卖出',
        '57' =>  '定价买入',
        '58' =>  '定价卖出',
        '59' =>  '买入确认',
        '60' =>  '卖出确认',
        '76' =>  '预受要约',
        '77' =>  '解除预受',
        '78' =>  '盘后买入',
        '79' =>  '盘后卖出',
        '80' =>  '缴申购款',
        '81' =>  '还申购款',
        '82' =>  '中签通知',
        '83' =>  '缴中签款',
        '89' =>  '做市确买',
        '90' =>  '做市确卖',
        '91' =>  '做市买入',
        '92' =>  '做市卖出',
        '93' =>  '股息税',
        '94' =>  '限售纳税',
        '95' =>  '清算冻结',
        '96' =>  '调整可卖',
        '97' =>  '手工冻结',
        '98' =>  '成本调整',
        '99' =>  '费用返还',
        '100' =>  '股份冻结',
        '101' =>  '冻结解冻',
        '102' =>  '冻结续冻',
        '103' =>  '轮候冻结',
        '104' =>  '轮候解除',
        '105' =>  '可售解除',
        '106' =>  '转托调整',
        '107' =>  '组合费用',
        '108' => '行为查询',
        '113' => '撤销缴款',
    );/*}}}*/

    public static $entrustTypeToTitleArr = array(/*{{{*/
        self::BUY => '买入',
        self::SALE => '卖出',
        self::CANCEL_BUY => '撤买',
        self::CANCEL_SALE => '撤卖',
    );/*}}}*/

    public static $entrustResultToTitleArr = array(/*{{{*/
        '0' =>   '未申报',
        '1' =>   '申报中',
        '2' =>   '已申报',
        '3' =>   '非法委托',
        '4' =>   '撤单失败',
        '5' =>   '部分成交',
        '6' =>   '全部成交',
        '7' =>   '部成部撤',
        '8' =>   '全部撤单',
        '9' =>   '撤单未成',
        '10' =>   '等待申报',//等待人工申报
    );/*}}}*/

    public static $exceptionMap = array(
        self::TRADE_FUND_PWD_WRONG => '资金密码错误',
    );

    /**
     *  简单密码
     */
    const SIMPLE_PWD = 0;
    /**
     *  买入
     */
    const BUY = 1;
    /**
     *  撤买
     */
    const CANCEL_BUY = 1001;
    /**
     *  卖出
     */
    const SALE = 2;
    /**
     *  撤卖
     */
    const CANCEL_SALE = 1002;
    //配号
    const DISTRIBUTION = 8;
    //中签通知
    const WINNING_NOTICE = 82;
    //缴中签款
    const PAYMENT = 83;
    /**
     *  未知
     */
    const ENTRUST_UNKNOWN_TYPE = 1000;
    //限价委托
    const XIAN_JIA = 0;
    //市价委托（为避免客户端区分沪、深两市订单类型的不同，服务端统一约定传1，并由服务端统一进行类型转换）
    const SHI_JIA = 1;
    //沪市最优五档即时成交剩余撤销（即：沪市市价委托）
    const BEST_SH = 1;
    //深市最优五档即时成交剩余撤销（即：深市市价委托）
    const BEST_SZ = 104;
    /**
     * 盈
     */
    const FDYK_YING = 0;
    /**
     * 亏
     */
    const FDYK_KUI = 1;
    /**
     * 平
     */
    const FDYK_PING = 2;
    /**
     * 查询扩展信息
     */
    const EX_FLAG = 1;
    /**
     *  所有委托
     */
    const ALL_ENTRUST = 0;
    /**
     *  可以撤单的委托
     */
    const CAN_CANCEL_ENTRUST = 1;
    /**
     *  从新到旧排序
     */
    const NEW_TO_OLD = 1;
    /**
     *  从旧到新排序
     */
    const OLD_TO_NEW = 0;
    /**
     *  币种 人发币
     */
    const RMB = 'RMB';
    /**
     *  交易密码错误
     */
    const TRADE_PWD_WRONG = -190101009;
    /**
     *  登录时的参数错误
     */
    const TRADE_LOGIN_PARAM_WRONG = -190101996;
    /**
     *  客户号不存在
     */
    const TRADE_CLIENTNO_WRONG = -302001003;

    /**
     *  交易资金密码错误
     */
    const TRADE_FUND_PWD_WRONG = -2303007;
    /**
     *  过滤撤单记录
     */
    const FILTER_CANCEL = 1;
}
