<?php
return [
    'loantype' => [
        1 => '按季等额还款',
        2 => '按月等额还款',
        3 => '一次性还本付息',
        4 => '按月付息一次还本',
        5 => '按天一次性还款',
        6 => '按季付息到期还本',
        9 => '半年付息到期还本',
    ],
    'contact_name' => ['未拨打人数','可联人数','空号','停机','关机','无法接通','占线','挂断','无人接听','暂停服务'],
    'sex_name' => ['女性','男性'],
    'age_group' => [
        '20岁以下' => ['min'=>0, 'max'=>20],
        '21-25' => ['min'=>21, 'max'=>25],
        '26-30' => ['min'=>26, 'max'=>30],
        '31-35' => ['min'=>31, 'max'=>35],
        '36-40' => ['min'=>36, 'max'=>40],
        '41-45' => ['min'=>41, 'max'=>45],
        '46-50' => ['min'=>46, 'max'=>50],
        '51-55' => ['min'=>51, 'max'=>55],
        '56-60' => ['min'=>56, 'max'=>60],
        '60岁以上' => ['min'=>61, 'max'=>200]
    ],
    'question_type' => [
        1 => '结清类',
        2 => '还款纠纷类',
        3 => '借核实类',
        4 => '还款渠道身份类',
        5 => '负面影响类',
        6 => '拒绝还款类',
        7 => '减免类',
        8 => '死亡类',
        9 => '其他',
        0 => '未归类',
    ],
    'wait_capital_group' => [
        '1万以下' => ['min'=>0, 'max'=>10000],
        '1-2万' => ['min'=>10000, 'max'=>20000],
        '2-3万' => ['min'=>20000, 'max'=>30000],
        '3-4万' => ['min'=>30000, 'max'=>40000],
        '4-5万' => ['min'=>40000, 'max'=>50000],
        '5-6万' => ['min'=>50000, 'max'=>60000],
        '6-7万' => ['min'=>60000, 'max'=>70000],
        '7-8万' => ['min'=>70000, 'max'=>80000],
        '8-9万' => ['min'=>80000, 'max'=>90000],
        '10万以上' => ['min'=>90000, 'max'=>10000000]
    ],
    'area_list' => [
        [
            'id'=>1,
            'name'=>'汇源专区',
        ],
       
    ],
	
         'status_cn' => [
                0=>'待审核',
                1=>'审核通过',
                2=>'已拒绝',
                3=>'已撤回',
            ],

      'deal_type_cn' => [
        0=>'',
        1=>'尊享',
        2=>'普惠',
        3=>'工厂微金',
        4=>'智多新',
        5=>'交易所',
    ],
    'assignee_tel' => [
        12143682=>4008607960,//巴恩琦
        12143680=>4008955780,//莲裴茹
        12143679=>4000320686,//中创
    ],
    'province_name' => [
        11 => "北京",
        12 => "天津",
        13 => "河北",
        14 => "山西",
        15 => "内蒙古",
        21 => "辽宁",
        22 => "吉林",
        23 => "黑龙江",
        31 => "上海",
        32 => "江苏",
        33 => "浙江",
        34 => "安徽",
        35 => "福建",
        36 => "江西",
        37 => "山东",
        41 => "河南",
        42 => "湖北",
        43 => "湖南",
        44 => "广东",
        45 => "广西",
        46 => "海南",
        50 => "重庆",
        51 => "四川",
        52 => "贵州",
        53 => "云南",
        54 => "西藏",
        61 => "陕西",
        62 => "甘肃",
        63 => "青海",
        64 => "宁夏",
        65 => "新疆",
        71 => "台湾",
        81 => "香港",
        82 => "澳门",
        91 => "国外"
    ],
    'displace_status' => [
        0=>'去签约待回调(或签约中断)',
        1=>'用户已签约待万峻签约',
        2=>'万峻已签约待债转',
        3=>'用户已债转待迁移',
        4=>'数据已迁移待置换',
        6=>'用户已可见',
        5=>'置换成功'
    ],
    'displace_type' => [
        0=>'系统批量操作',
        1=>'用户法大大签约',
        2=>'用户确认签约',
        3=>'用户其他签约',
    ],
    'user_type' => ['个人','企业'],
    'displace_uid' => '12143676',//万峻 正式环境：12143676  测试环境：12143685
    'deal_src'=>[
        1=>'先锋基础数据导入'
    ],
    'login_data_src' =>[
        '前端获取','短信导入'
    ]
];
