<?php
class ErrorCode extends ItzApi{ 
    public static function errcode($code, $data=array()){
        if(empty($data)) {
            $data[1] = '';
            $data[2] = '';
        }
        $errcode = array(
            '0' => '成功',
            '1000' => '异常错误，请联系管理员',
            '1001' => '系统错误',
            '1002' => '服务端资源不可用',
            '1003' => '缺少必要参数或必要参数为空,或必要参数类型不正确',
            '1004' => '身份验证出错',
            
            //用户类
            '2000' => '手机号码格式不正确',
            '2001' => '此用户已注册',
            '2002' => '注册失败',
            '2003' => '用户ID为空',
            '2004' => '此用户不存在',
            '2005' => '数据保存失败',
            '2006' => '尚未通过实名认证或手机认证',
            '2007' => '账号已经被锁定',
            '2008' => '此用户账户异常',
            '2009' => '爱亲您好，您的账户余额不足，请充值后重试',
            '2010' => '支付密码不正确',


            //投标类
            '3000' => '投标资金异常（必须为100的整倍数，且大于0，小于1亿）',
            '3001' => '爱亲您好，您本次投资失败，请稍后重试',
            '3002' => '爱亲您好，很抱歉该项目当前不可投资，请更换项目重试',
            '3003' => '该平台信息不存在，请查证',
            '3004' => '流水号重复提交，请联系管理员',
            '3005' => '投资额度必须为整数',
            '3006' => '很抱歉，您没有本次优先投资资格。我们将针对各类用户开展优先投资活动，下一个就是你。',
            '3007' => '此项目尚未通过审核',
            '3008' => '您账号已经被锁定，不能进行投资，请跟管理员联系',
            '3009' => '爱亲您好，您投资的项目已投满，请更换项目重试',
            '3010' => '爱亲您好，您的投资金额超过项目剩余可投金额，请更换金额重试',
            '3011' => '爱亲您好，您投资的项目还未开始发售，请更换项目重试',
            '3012' => '爱亲您好，您投资的项目已还本付息，请更换项目重试',
            '3013' => '项目状态异常，请联系管理员',
            '3014' => '您的投资递增金额需要是100的整倍数',
            '3015' => '最低投标金额不能低于100元',
            '3016' => '项目状态异常，暂时无法投标，请与客服联系。', 
            '3017' => '您的最高投标金额异常，请与客户联系',  
            '3018' => '查询异常，请联系客服',  
            '3019' => '记录日志失败，请联系管理员',    
            '3020' => '插入队列失败，请联系管理员',
            '3022' => '计入代销平台订单表失败，请联系管理员',  
            '3022' => '计入代销平台明细表失败，请联系管理员', 
            '3030' => '此用户没有投标过，请查证',
            '3031' => '爱亲您好，您本次投资失败，请稍后重试',
            '3032' => '爱亲您好，您选择的优惠券不正确',
           
            //对账类
            '4001' => '投标对账',
            '4002' => '该项目不存在',
            '4003' => '查询失败，请查证',

            //资金类
            '5001' => '充值失败，请联系管理员',
            '5002' => '投资失败，请联系客服，电话400-0088-100',
            '5003' => '请输入正确的金额',
            '5006' => '充值交易号为空，请查证',
            '5007' => '根据充值交易号查询充值记录为空，请查证',
            '5008' => '充值金额不对等，请查证',
            '5009' => '充值回调，更新用户账号信息不成功，请查证',
            '5010' => '充值回调，更新AccountRecharge信息不成功，请查证',
            '5010' => '充值回调，AddLog信息不成功，请查证',
        '5012' => '提现返券失败',
            //债权类
            '6001' => '此债权不存在，爱亲不妨再看看别的',
            '6002' => '不可以自己买自己的债权哟爱亲',
            '6003' => '爱亲，请输入正确的认购金额额',
            '6004' => '爱亲，验证码不能为空',
            '6005' => '爱亲，支付密码不正确',
            '6006' => '您的认购金额不能少于认购起投金额',
            '6007' => '不是最后一笔认购，认购金额需要是整数',
            '6008' => '此债权已经认购满，请勿再认购',
            '6009' => '您的认购额超过债权剩余额度，请重新填写',
            '6010' => '此债权已经取消，请勿再认购',
            '6011' => '此债权已经过期，请勿再认购',
            '6012' => '此债权已经认购满额，请勿再认购',
            '6013' => '此债权已经认购完成，请勿再认购',
            '6014' => '您需要将该债权剩余份额全部认购',
            '6015' => '认购失败，请联系客服，电话400-0088-100',
            '6016' => '',
            '6017' => '',
            '6018' => '转让的债权额度大于投资额度',
            '6019' => '该投资目前不能进行债权转让',
            '6020' => '添加债权转让失败',
            '6021' => '不允许设置折让金使认购方收益率为0',
            '6022' => '异常，添加债权转让失败',
            '6023' => '',

            //预约投标类
            '7001' => '用户未开启预约',
            '7002' => '更新预约失败，请联系管理员',
            '7003' => '新增预约失败，请联系管理员',
            '7004' => '查询为空，请联系管理员',
            '7005' => '添加预约，状态必须为开启状态',
            '7006' => '项目的预约配额为0',
            '7007' => '离项目的正式发售时间小于10分钟',
            '7008' => '用户没有预约资格',
            '7009' => '用户的预约资格已使用',
            
            //活期业务API错误代码7200-7300
            '7200' => '您访问的页面参数有误，请重新输入。',
            '7201' => '爱亲您好，非常抱歉，您本次零活计划赎回失败，请稍后重试',
            '7202' => '爱亲您好，您今日还可赎回零活计划'.$data[1].'元，请输入正确的赎回金额。',
            '7203' => '爱亲您好，您今日还可赎回零活计划'.$data[1].'元，请输入正确的赎回金额。',
            '7204' => '爱亲您好，您今日还可赎回零活计划'.$data[1].'元，请输入正确的赎回金额。',
            '7205' => '爱亲您好，您今日还可赎回零活计划'.$data[1].'元，请输入正确的赎回金额。',
            '7206' => '爱亲您好，您当前不可进行取消操作，请知晓。',
            '7207' => '爱亲您好，您当前账户资金异常，请确认是否为本人操作，详情请致电400-0088-100。',
            '7208' => '获取当日申购额度信息不合法',
            '7209' => '获取当日年化利率不合法',
            '7210' => '获取的当日申购额度信息不合法',
            '7211' => '获取的当日年化利率不合法',
            '7212' => '获取申购信息为空',
            '7213' => '爱亲您好，您当前不可进行取消操作，请知晓',
            '7214' => '爱亲您好，您当前不可进行取消操作，请知晓',
            '7215' => '爱亲您好，您当前不可进行取消操作，请知晓',
            '7216' => '爱亲您好，您当前不可进行取消操作，请知晓',
            '7217' => '出现异常信息，请稍后',
            '7218' => '此项目不存在',
            '7219' => '此项目已满或售罄',
            '7220' => '爱亲您好，您今日还可申购零活计划'.$data[1].'元，请输入正确的申购金额。',
            '7221' => '此账户不存在',
            '7222' => '爱亲您好，零活计划1元起投，1元递增，请输入正确的申购金额。',
            '7223' => '爱亲您好，零活计划1元起投，1元递增，请输入正确的申购金额。',
            '7224' => '爱亲您好，您当前账户余额不足，请先充值再投资。',
            '7225' => '爱亲您好，您当前账户资金异常，请确认是否为本人操作，详情请致电400-0088-100。',
            '7226' => '爱亲您好，您当前账户资金异常，请确认是否为本人操作，详情请致电400-0088-100。',
            '7227' => '爱亲您好，非常抱歉，您本次零活计划申购失败，请稍后重试',
            '7228' => '爱亲您好，非常抱歉，您本次零活计划申购失败，请稍后重试',
            '7229' => '爱亲您好，非常抱歉，您本次零活计划申购失败，请稍后重试',
            '7230' => '爱亲您好，非常抱歉，您本次零活计划申购失败，请稍后重试',
            '7231' => '系统异常',
            '7232' => '爱亲您好，非常抱歉，您本次零活计划赎回失败，请稍后重试',
            '7233' => '爱亲您好，非常抱歉，您本次零活计划赎回失败，请稍后重试',
            '7234' => '爱亲您好，非常抱歉，您本次零活计划赎回失败，请稍后重试',
            '7235' => '充值详情解析失败',
            '7236' => '当期累计额度不能减少到负数',
            '7237' => '当前请求参数不为时间戳',

            //提前还款类
            '8001' => '项目ID为空',
            '8002' => '项目状态是投资已满存续期才能提前还款',
            '8003' => '到期当天不可以进行提前还款操作',
            '8004' => '还本时间不一致', 
            '8005' => '项目付息日或此项目有应还但未还的数据，执行完还本付息脚本后，才能启动提前还款',
            '8006' => '查询为空，请联系管理员',
            '8007' => '等额本息的项目不支持提前还款',
            '8008' => '项目提前还款的时间或期数不符合条件',
            '8009' => '该项目正在进行提前还款,请稍等',
            '8010' => '该项目代收利息期数为0',
            '8011' => '本金或利息金额有误',
            '8012' => '项目未融满不能进行提前还款操作',
            '8013' => '项目不存在',
            '8014' => '今日智选计划还未完成还款',

            //逾期还款
            '9001' => '项目状态为存续期的项目才可以逾期还款',
            '9002' => '等额本息的项目不支持逾期还款',
            '9003' => '只有项目的到期日才能进行公布逾期',
            '9004' => '该项目正在进行逾期还款,请稍等',
            '9005' => '还款记录中存在错误状态的记录',
            '9006' => '暂停数据数量异常',
            '9007' => '暂停数据缺少本金记录',
            '9008' => '暂停数据类型有误',
            '9009' => '暂停数据本金状态有误',
            '9010' => '暂停数据利息状态有误',
            '9011' => '最后一期利息存在错误状态数据',
            '9012' => '最后一期本金存在错误状态数据',
            '9013' => '暂停的本金总数与项目实际借款金额不符'
        );

        return $errcode[$code];
    }
    public static function errInfo($code, $data=array()){
        $return = self::errcode($code, $data);
        if(!empty($return)){
           return $return;
        }else{
           return '爱亲，操作未成功，请稍后重试。';
        }
    }
}
?>