export const templates = {
  1: `
    <p class="sea-notice">
      海鲜商品购买须知
    </p>
    <p>
      1.
      由于生鲜食品的特殊性，不支持7天无理由退换货，不支持任何形式的拒签。签收后请立即验货，如果有损坏请务必在6小时内，将损坏产品与快递单放在一起拍照，联系在线客服赔付。超过签收时间6小时的售后反馈将不予受理；以快递慢、不想要等理由单方面拒收，或因个人原因保存不当放置时间过长造成的产品变质等问题，商家不承担责任；
    </p>
    <p>
      2.
      下单前请仔细确认好收件地址、电话等信息是否正确，若地址或电话错误请在货品发出前联系客服修改，产品发出途中无法修改收件信息，由于信息留错导致时间延误而造成产品变质及其他问题，商家不承担责任；
    </p>
    <p>
      3. 下单后请务必保持收货电话畅通，如因快递无法及时联系到您而造成的产品变质及其他问题，商家不承担责任；
    </p>
    <p>
      4.
      海鲜产品在速冻的时候表面会有冰衣，故您收到产品后发现袋子里面有积水是正常的，冰衣化了之后产品呈现软化的状态，并不影响其品质，可放心食用；
    </p>
    <p>
      5. 由于原料的生产批次不同，收到的实物可能与图片不符，请以实物为准；
    </p>
    <p>
      6.
      收货：请勿代收，或寄存。验收前请核对数量，发现数量不符请及时拍照交由售后处理。如内泡沫箱破损，请务必连同外纸箱、产品一同拍照交由售后处理；
    </p>
    <p>
      7.
      由于产品的特殊易腐性，顺丰承诺发货后72小时内送达，但对个别地区超出时效拒绝揽收件的订单，届时商家会向您留存在订单信息中的手机发送短信通知，予以取消订单；请您务必留存准确的手机号码并保持手机通畅，以便及时查收短信！商家发送短信后48小时内如未接到您的反馈，视为您同意取消订单，您的订单会即时予以取消，退回款项会在1个工作日内退回到您的账户。如您不同意对超时效订单进行退单，海鲜到货后出现质量问题不予售后，敬请谅解！；
    </p>
    <p>
      8. 当日拍下订单后，第二日8点之前可以联系客服取消订单，逾时将不能取消订单；
    </p>
    <p>
      9. 如有特殊情况（延迟发货、修改地址等），请于拍下订单第二日10点之前联系客服。
    </p>
    <p class="icecream-notice">
      冰淇淋商品购买须知
    </p>
    <p>
      切勿拨打顺丰物流客服电话投诉冰淇淋发货时效，投诉率过大，顺丰可能会拒绝该区配送业务，从而会影响该地区的冰淇淋销售，介意发货时效的消费者，请慎拍！！！
    </p>
    <p class="warm-notice">包装方式：</p>
    <p>
      顺丰配送冰淇淋会使用EPP箱子（需回收）或是泡沫箱（加干冰），因产品包装为统一尺寸，一个箱子只能放入一件雪糕，若您拍下多件商品，将会生成多个物流单号和包裹，您可以联系客服进行查询跟单。
    </p>
    <p class="warm-notice">发货时间：</p>
    <p>
      由于冰淇淋产品需要全程冷链运输，只能陆运发送，商家将会在72小时内发货（周末和节假日发货时间顺延），发货后4-6天陆续到货。（部分地区不能发货，下单前请确认平台提示的配送区域）。
    </p>
    <p class="warm-notice">温馨提示：</p>
    <p>
      1.
      冰淇淋属于特殊产品，购买前请一定填写准确地址和联系电话，并保持电话畅通，最好购买时能填写一个紧急联系电话。订单生成后不支持修改任何信息；
    </p>
    <p>
      2.
      冰淇淋属于特殊产品，配送期间尽量不要更改派送地址和派送时间，根据以往的经验，派送时间过长会导致产品缓化，因收件人非首次派送、亲自签收或无法联系、拒收、拒签等，不予赔付；
    </p>
    <p>
      3.
      签收时，请务必当场签收，及时放入冰箱冷冻，如有融化问题，请立即拍照并在签收包裹后30分钟内联系客服处理，逾期我们无法正常判断您的问题，恕不赔付。因天气炎热，冰淇淋产品可能会有发软的现象，直接放入冰箱冷冻，不影响食用，介意者勿拍，因此原因拒收，商家不予赔付，请您理解和包涵；
    </p>
    <p>4. 第三方原因导致冰淇淋融化的，请您立即拍照并联系客服，我们将为您进行快速赔付。</p>
  `,
  2: `
    <p class="sea-notice">
      购买须知
    </p>
    <p>
      1. 汽车维修保养服务地在北京 ，使用期限为1年（有效期至2020年6月20日）；
    </p>
    <p>
      2. 用户购买后需到店办理开卡手续，签订服务合同，建立服务档案；
    </p>
    <p>
      3. 系统默认收货人为到店开卡人，如需更改，请提前致电商家。
    </p>
  `,
  3: `
    <p class="sea-notice">
      购买须知
    </p>
    <p>
      1. 酒类商品不支持7天无理由退货，非质量问题不支持拒收及退货，如因非质量原因拒收或退货不予处理；
    </p>
    <p>
      2. 请务必在签收时当面拆开验货，如发现破损可直接拒收，一旦签收，则视为认可产品完好，不予退换！
    </p>
    <p>
      3. 签收后发现漏酒，寄回商家邮费自付，收到退回件后经查实情况属实予以补发。
    </p>
  `,
  4: `
    <p class="sea-notice">
      购买须知
    </p>
    <p>
      1. 本产品为特殊商品专拍，请确认您已经阅读详情内容并完成相关协议签署，按照协议足额购买，购买后不退换、不修改。
    </p>
  `,
  5: `
    <p class="sea-notice">
      购买须知
    </p>
    <p>
      1. 此租购服务由第三方“湖北哆啦汽车服务有限公司”提供；
    </p>
    <p>
      2. 汽车收到的货款暂时由平台管理，客户提车并确认无误后，货款则结算给第三方商家；
    </p>
    <p>
      3. <span style="color: red;">租购期间若发生纠纷，用户需直接向第三方商家主张积分；</span>
    </p>
    <p>
      4. 在与第三方卖家线下商定提车具体事宜的24小时后，因用户原因取消订单，则会扣除该笔订单缴纳现金的<span style="color: red;">5%</span>，作为<span style="color: red;">缔约损失费</span>；如需要更换其他车型，则需要扣除该笔订单缴纳现金的<span style="color: red;">5%</span>，作为<span style="color: red;">手续费</span>；
    </p>
  `
  // 6: `
  //   <p>分期协议。。。。。。。。。</p>
  // `
}
