<?php
return array(

    /*用户来源*/
    'user_src' => array(
        'unknown' => '未知 ',
        'weibo' => '微博',
        'weixin' => '微信',
        'yinxun' => '银讯网',
        'cunzhe' => '存折网',
        '36kr' => '36氪',
        'yima' => '亿玛',
        'caipiao' => '彩票',
        'fengchao' => '凤巢首页',
        'qihu' => '奇虎推广',
        '360nav' => '360导航',
        'qqsns' => '腾讯sns',
        'dsd' => '大时代',
        '365cal' => '365日历',
        'yimacps' => '亿玛cps',
        'cunzhe1' => '存折通栏广告',
        'cunzhe2' => '存折首页列表',
        'cunzhe3' => '存折p2p列表',
        'ltcpa' => '领克特cpa',
        'chanet' => '成果网',
        'geo1' => 'GEO首页',
        'geo2' => 'GEO推广注册页',
        'geo3' => 'GEOCFCA专题',
        'geo4' => 'GEO担保公司',
        'jinfuzicps' => '金斧子CPS',
        'youjian' => '友荐CPC',
        '0' => '邀请',
    ),

    /*还款方式*/
    "borrow_style" => array(
        "0" => "按月付息，到期还本",
        "3" => "按季付息，到期还本",
        "1" => "到期一次性还本付息", //一次性还本付息
//		        "2" => "按日计息，月底付息 ，到期还本息",
		"4" => "按月付款，等额本金",
        "5" => "按月付款，等额本息", //阳光智选信息披露二期
    ),
    //阳光智选信息披露二期 阳光智选专用
/*    "sun_wisdom_borrow_style" => array(
        "0" => "按月付息，到期还本",
        "3" => "按季付息，到期还本",
        "1" => "到期一次性还本付息", //一次性还本付息
//		        "2" => "按日计息，月底付息 ，到期还本息",
//		        "4" => "等额本金，按月付款",
        "5" => "按月付款，等额本息", //阳光智选信息披露二期
    ),
*/
    /*还款方式*/
    "repay_type" => array(
        "0" => "PAY_INTREST_MONTHLY",     # 按月付息
        "1" => "ONE_TIME_PAYMENT",        # 到期还本付息
        "3" => "PAY_INTREST_QUARTERLY",   # 按季付息
    ),

    /*提现银行类别*/
    'bank' => array(
        '300' => '工商银行',
        '301' => '中国银行',
        '302' => '建设银行',
        '303' => '农业银行',
        '463' => '交通银行',
        '465' => '广发银行',
        '466' => '招商银行',
        '467' => '平安银行',

        '468' => '兴业银行',
        '469' => '民生银行',
        '470' => '华夏银行',
        '471' => '上海浦东发展银行',
        '472' => '中信银行',
        '473' => '光大银行',
        '515' => '北京银行',
        '516' => '北京农村商业银行',
        '517' => '中国邮政储蓄银行'
    ),
    /*提现银行类别仅对宝付批量转账使用*/
    'bank_baofu' => array(
        '300' => '中国工商银行',
        '301' => '中国银行',
        '302' => '中国建设银行',
        '303' => '中国农业银行',
        '463' => '中国交通银行',
        '465' => '广发银行',
        '466' => '招商银行',
        '467' => '平安银行',
        '468' => '兴业银行',
        '469' => '中国民生银行',
        '470' => '华夏银行',
        '471' => '上海浦东发展银行',
        '472' => '中信银行',
        '473' => '中国光大银行',
        '515' => '北京银行',
        '516' => '北京农村商业银行',
        '517' => '中国邮政储蓄银行'
    ),
	/*新网支持银行*/
    'bank_xw' => array(
		'303' => '中国农业银行',
		'301' => '中国银行',
		'472' => '中信银行',
		'473' => '中国光大银行',
		'468' => '兴业银行',
		'465' => '广发银行',
		'470' => '华夏银行',
        '300' => '中国工商银行',
		'469' => '中国民生银行',
		'302' => '中国建设银行',
		'517' => '中国邮政储蓄银行',
		'467' => '平安银行',
		'471' => '浦发银行',
        '515' => '北京银行',
        '466' => '招商银行',
        '463' => '中国交通银行'
    ),
    //银行id ,新网code
    'bank_code' => array(
        1 => 'ICBK',
        2 => 'PCBC',
        3 => 'ABOC',
        4 => 'CMBC',
        5 => 'PSBC',
        6 => 'MSBC',
        7 => 'CIBK',
        8 => 'SZDB',
        9 => 'BKCH',
        10 => 'COMM',
        11 => 'FJIB',
        12 => 'BJCN',
        13 => 'EVER',
        14 => 'GDBK',
        19 => 'SPDB',
        20 => 'HXBK',
        23 => 'BOSH',

    ),
    /*提现银行卡图片 暂时写死 以后都切换到新的银行卡表*/
    'bank_img' => array(
        '300' => '/static/img/bank/ICBC.jpg',
        '301' => '/static/img/bank/BOC.jpg',
        '302' => '/static/img/bank/CCB.jpg',
        '303' => '/static/img/bank/ABC.jpg',
        '463' => '/static/img/bank/COMM.jpg',
        '465' => '/static/img/bank/CGB.jpg',
        '466' => '/static/img/bank/CMB.jpg',
        '467' => '/static/img/bank/PAB.jpg',

        '468' => '/static/img/bank/CIB.jpg',
        '469' => '/static/img/bank/CMBC.jpg',
        '470' => '/static/img/bank/HXB.jpg',
        '471' => '/static/img/bank/SPDB.jpg',
        '472' => '/static/img/bank/CITIC.jpg',
        '473' => '/static/img/bank/CEB.jpg',
        '515' => '/static/img/bank/BOB.jpg',
        '516' => '/static/img/bank/BJNS.jpg',
        '517' => '/static/img/bank/PSBC.jpg'
    ),

    /*充值列表银行类别*/
    'bank_remark' => array(
        'CCB' => '中国建设银行',
        'CMB' => '招商银行',
        'ICBC' => '中国工商银行',
        'BOC' => '中国银行',
        'BOC' => '中国银行',
        'ABC' => '中国农业银行',
        'BOCOM' => '交通银行',
        'CMBC' => '中国民生银行',
        'HXBC' => '华夏银行',
        'CIB' => '兴业银行',
        'SPDB' => '浦发银行',
        'GDB' => '广发银行',
        'CITIC' => '中信银行',
        'CEB' => '光大银行',
        'PSBC' => '邮政储蓄',
        'BOBJ' => '北京银行',
        'SRCB' => '上海农商银行',
        'BOS' => '上海银行',
        'TCCB' => '天津银行',
        'PAB' => '平安银行',
        'SDB' => '深圳发展银行',
        'COMM' => '交通银行',
        'POST' => '中国邮政储蓄银行',
        'ECITIC' => '中信银行',
        'CBHB' => '渤海银行',
        'BCCB' => '北京银行',
        'NB' => '宁波银行',
        'HXB' => '华夏银行',
        'PINGAN' => '平安银行',
        'BEA' => '东亚银行',
        'UNIONPAY' => '中国银联',
        'BRCB' => '北京银行',
        '01020000' => '连连-工商银行',
        '0308000' => '连连-招商银行',
        '03100000' => '连连-上海浦发银行',
        '03090000' => '连连-兴业银行',
        '03030000' => '连连-光大银行',
        '03050000' => '连连-民生银行',
        '03020000' => '连连-中信银行',
        '03070000' => '连连-平安银行',
        '03010000' => '连连-交通银行',
        '04243010' => '连连-南京银行',
        '04083320' => '连连-宁波银行',
        '01050000' => '连连-建设银行',
        '305' => '网银在线 -民生银行',
        '1025' => '网银在线 -工商银行'
    ),
	//account_log_type
	'account_log_type' => array(
		'interest_company_ontime' => '项目付息',
		'interest_company_advance_extra' => '项目提前还款补偿利息',
		'interest_guarantor_advance_extra' => '项目提前还款补偿利息',
		'interest_company_advance' => '项目提前付息',
		'interest_guarantor_advance' => '项目提前付息',
		'interest_security_ontime' => '项目风险保障金代偿利息',
		'interest_guarantor_ontime' => '项目保障机构代偿利息',
		'interest_buyback' => '项目债权回购支付利息',
		'interest_buyback_frost' => '债权回购利息冻结',
		'interest_buyback_cancel' => '债权回购利息解冻',
		'interest_guarantor_overtime_extra' => '项目逾期罚息',
		'interest_guarantor_overtime' => '项目逾期利息',
		'interest_company_overtime_extra' => '项目逾期罚息',
		'capital_company_ontime' => '项目还本',
		'capital_company_advance' => '项目提前还本',
		'capital_guarantor_advance' => '项目保障机构提前代偿',
		'capital_company_overtime' => '项目企业逾期还本',
		'capital_guarantor_overtime' => '项目保障机构代偿本金',
		'capital_security_ontime' => '项目风险保障金代偿本金',
		'capital_buyback' => '项目债权回购支付本金',
		'capital_buyback_frost' => '债权回购本金冻结',
		'capital_buyback_cancel' => '债权回购本金解冻',
		'interest_returnback'=>'补偿利息',
		'capital_returnback'=>'退还本金',
        'zxplan_reserve_frost' => '智选计划预约资金冻结',
        'reserve_cancel' => '智选计划取消预约解冻',
        'be_continue_frost' => '智选计划待续投资金冻结',
        'zxplan' => '智选计划投资/续投'
	),
    //资金流水资金类型
    'account_type' => array(
        'recharge' => '充值',
        'cash_false' => '提现失败/提现取消',
        'cash_frost' => '提现冻结',
        'cash_refund' => '银行退票',
        'cash_success' => '提现成功',
        'invest' => '投资爱担保项目',
        'invest_frost' => '爱担保投资冻结',
        'invest_cancel' => '爱担保投资溢出解冻',
        'lease' => '投资爱融租项目',
        'lease_frost' => '爱融租投资冻结',
        'lease_cancle' => '爱融租投资溢出解冻',
        'factoring' => '投资爱保理项目',
        'factoring_frost' => '爱保理投资冻结',
        'factoring_cancel' => '爱保理投资溢出解冻',
        'art' => '投资爱收藏项目',
        'art_cancel' => '爱收藏投资溢出解冻',
        'art_frost' => '爱收藏投资冻结',
        'shengxin' => '投资省心计划项目',
        'shengxin_frost' => '省心计划投资冻结',
        'shengxin_cancel' => '省心计划投资溢出解冻',
        'iAsset' => '投资爱资产项目',
        'iAsset_frost' => '爱资产投资冻结',
        'iAsset_cancel' => '爱资产投资溢出解冻',
        'repayment' => '爱担保还息',
        'leasei_repayment' => '爱融租还息',
        'factoringi_repayment' => '爱保理还息',
        'arti_repayment' => '爱收藏还息',
        'shengxini_repayment' => '省心计划还息',
        'iAsseti_repayment' => '爱资产收益',
        'invest_ai_repayment' => '爱担保项目提前还款补偿利息',
        'invest_ri_repayment' => '爱担保项目风险保障金代偿还息',
        'investi_bb_frost' => '爱担保项目债权回购利息冻结',
        'investi_bb_repayment' => '爱担保项目债权回购利息支付',
        'art_ci_over_repay' => '爱收藏项目逾期罚息',
        'factoring_ci_over_repay' => '爱保理项目逾期罚息',
        'lease_ci_over_repay' => '爱融租项目逾期罚息',
        'invest_ci_over_repay' => '爱担保项目逾期罚息',
        'invest_ci_repayment' => '爱担保项目逾期利息',
        'lease_ci_repayment' => '爱融租项目逾期利息',
        'factoring_ci_repayment' => '爱保理项目逾期利息',
        'art_ci_repayment' => '爱收藏项目逾期利息',
        'invest_repayment' => '爱担保回本',
        'lease_repayment' => '爱融租回本',
        'factoring_repayment' => '爱保理回本',
        'art_repayment' => '爱收藏回本',
        'shengxin_repayment' => '省心计划回本',
        'iAsset_repayment' => '爱资产回本',
        'invest_ac_repayment' => '爱担保项目提前还款回本',
        'invest_cc_repayment' => '爱担保项目担保公司代偿回本',
        'invest_rc_repayment' => '爱担保项目风险保障金代偿回本',
        'invest_bb_frost' => '爱担保项目债权回购本金冻结',
        'invest_bb_repayment' => '爱担保项目债权回购本金支付',
        'invest_aac_repayment' => '爱担保项目担保公司提前代偿回本',
        'debt_finish' => '爱担保项目债权转让回本',
        'lease_debt_finish' => '爱融租项目债权转让回本',
        'factoring_debt_finish' => '爱保理项目债权转让回本',
        'art_debt_finish' => '爱收藏项目债权转让回本',
        'shengxin_debt_finish' => '省心计划项目债权转让回本',
        'debt' => '认购爱担保项目债权冻结',
        'invest_debt' => '认购爱担保项目债权冻结',
        'lease_debt' => '认购爱融租项目债权冻结',
        'leasedebt' => '认购爱融租项目债权冻结',
        'factoring_debt' => '认购爱保理项目债权冻结',
        'art_debt' => '认购爱收藏项目债权冻结',
        'shengxin_debt' => '认购省心计划项目债权冻结',
        'debt_success' => '认购债权成功',
        'debt_cancel' => '取消债权转让',
        'award_invest' => '投资券投资',
        'hongbao_frost' => '红包活动发起冻结',
        'hongbao_cancel' => '红包取消/过期退回',
        'hongbao_success' => '红包被领取支出',
        'hongbao_recharge' => '红包领取充值',
        'award_invite' => '邀请好友奖励兑付',
        'realname' => '实名认证付费',
        'reversal_success' => '异常资金处理',
        'reversal_frost' => '异常资金冻结',
        'reversal_cancel' => '异常资金解冻',
        'interest_reward' => '加息收益',
        'expergold_recharge'=>'体验金充值',
    	'zhixuan' => '投资智选集合项目',
    	'zhixuan_frost' => '智选集合投资冻结',
    	'ygzhixuan' => '投资阳光智选项目',
    	'ygzhixuan_frost' => '阳光智选投资冻结',
        'zxplan_reserve_frost' => '智选计划预约资金冻结',
        'wiseplan_invest_frost' => '智选计划投资冻结',
        'continue_frost' => '智选计划续投资金冻结',
        'reserve_reward' => '智选计划预约补偿利息',
        'zhixuanjihua_cancel' => '智选计划取消预约解冻',
        'be_continue_frost' => '智选计划待续投资金冻结',
        'zxplan' => '智选计划投资/续投',
        'exit_invest_finish' => '智选计划退出回本',
        'exit_invest_interest' => '智选计划退出还息'
    ),

    //手机日志类型
    'type' => array(
        'award_invite' => '推广奖励兑付',
        'award_invest' => '投资奖励兑付',
        'alarm' => '警告',
        'phone' => '手机认证',
        'realname' => '实名认证',
        'mob_auth' => '后台手机验证码',
        'tender' => '投资',
        'repay' => '还款',
        'cash_yes' => '提现成功',
        'cash_no' => '提现失败',
        'recharge_yes' => '充值成功',
        'recharge_no' => '充值失败',
        'reg' => '注册成功',
        'manmade' => '人工发送',
        'birthday' => '生日提醒',
        'debt' => '债权转让',
        'system' => '系统提醒',
        'direct' => '手机验证码',
        'couponexpires' => '优惠券过期',
        'hongbao' => '红包',
        'double_factor' => '后台双因子确认短信',
        'activity' => '通用活动短信',
        'admin_user_add' => '添加内部用户',
        'admin_user_resetpwd' => '内部用户重置密码',
        'paypwd_find' => '找回支付密码',
        'call_user' => '用户召回批量短信',
        'safe_remind' => '安全提醒短信',
        'bankcard_add' => '添加银行卡',
        'emergency_contact' => '紧急联系人发送短信',
        'admin_user_add' => '后台添加用户',
        'admin_user_resetpwd' => '后台用户重置密码',
        'recall_reg' => '电话召回注册奖励通知',
        'real_auth' => '实名认证通道监控',
        'bankcard_add_vcode' => '添加银行卡发送的验证码',
        'recall_invest' => '电话召回投资奖励通知',
        'tiantian_reg_suc' => 'tiantian渠道wap端注册成功后短信通知',
        'borrow_notice' => '发短信提醒预告新项目',
        'auto_repay' => '自动还款',
    ),

    /*密码保护问题*/
    "pwd_protection" => array(
        "8" => "你孩子的名字叫什么",
        "9" => "你孩子的生日是哪天",
        "1" => "你爸爸的名字叫什么",
        "2" => "你爸爸的生日是哪天",
        "3" => "你妈妈的名字叫什么",
        "4" => "你妈妈的生日是哪天",
        "5" => "最难忘的日子",
        "6" => "你的学号是多少",
        "7" => "你的老家在哪里"
    ),

    //主站使用的优惠券类型
    'borrow_type' => array(
        '2' => '爱担保',
        '5' => '爱融租',
        '6' => '爱保理',
        '7' => '爱收藏',
        '100' => '省心计划',
		'3000' => '智选集合',
    	'3100' => '智选计划',
    	'3200' => '阳光智选',
    ),

    //后台使用的优惠券类型 
    'borrow_type_admin' => array(
        '3000' => '智选集合',
        '3100' => '智选计划',
		'3200' => '阳光智选',
    ),

    // 管理后台借款模式online
    'borrow_type_online' => array(
        '0' => '请选择',
        '2' => '爱担保',
        '5' => '爱融租',
        '6' => '爱保理',
        '7' => '爱收藏',
        '100' => '省心计划（典当类）A套餐',
        '101' => '省心计划（典当类）B套餐',
        '102' => '省心计划（典当类）C套餐',
        '200' => '省心计划（小贷类）A套餐',
        '201' => '省心计划（小贷类）B套餐',
        '202' => '省心计划（小贷类）C套餐',
        '302' => '省心计划（影视类）C套餐',
        '402' => '省心优选',
        '2000' => '零钱计划',//2000-2999
    	'3000' => '智选集合',
    	'3100' => '智选计划',
    ),
    // 主站用到的产品类型配置文件_基础产品
    'borrow_type_online_front' => array(
        '2' => '爱担保',
        '5' => '爱融租',
        '6' => '爱保理',
        '7' => '爱收藏',
        '3000' => '智选集合',
    	'3100' => '智选计划',
    	'3200' => '阳光智选',
        // '2000' => '零钱计划',
    ),

    'borrow_type_online_usertrade' => array(
        '2' => '爱担保',
        '5' => '爱融租',
        '6' => '爱保理',
        '7' => '爱收藏',
        '100' => '省心计划',
        '101' => '省心计划',
        '102' => '省心计划',
        '200' => '省心计划',
        '201' => '省心计划',
        '202' => '省心计划',
        '302' => '省心计划',
        '402' => '省心计划',
        '2000' => '零钱计划',
        '3000' => '智选集合',
    	'3100' => '智选计划',
    	'3200' => '阳光智选',
    ),

    //主站用到的产品类型配置文件_省心计划产品
    'shengxin_type_online_front' => array(

    ),

    //borrow_tender中，全部直投的debt_type
    'borrow_tender_debt_type_invest' => array(
        '1' => array('name' => '爱担保', 'code' => 'invest'),
        '5' => array('name' => '爱融租', 'code' => 'lease'),
        '7' => array('name' => '爱保理', 'code' => 'factoring'),
        '9' => array('name' => '爱收藏', 'code' => 'art'),
        '11' => array('name' => '省心计划', 'code' => 'shengxin'),//对应302
        '13' => array('name' => '省心计划', 'code' => 'shengxin'),//对应201
        '15' => array('name' => '省心计划', 'code' => 'shengxin'),
        '17' => array('name' => '省心计划', 'code' => 'shengxin'),
        '19' => array('name' => '省心计划', 'code' => 'shengxin'),
        '21' => array('name' => '省心计划', 'code' => 'shengxin'),
        '23' => array('name' => '省心计划', 'code' => 'shengxin'),
        '25' => array('name' => '省心计划', 'code' => 'shengxin'),
        '27' => array('name' => '省心计划', 'code' => 'shengxin'),
        '29' => array('name' => '零钱计划', 'code' => 'lingqian'),
        '31' => array('name' => '省心计划', 'code' => 'shengxin'), //对应402
    	'33' => array('name' => '智选集合', 'code' => 'zhixuan'), //对应3000
    	'35' => array('name' => '智选计划', 'code' => 'zxplan'), //对应3100
    	'37' => array('name' => '阳光智选', 'code' => 'ygzhixuan'), //对应3200
    ),

    // borrow表中的type和borrow_tender表中的debt_type转换
    'switch_debt_type' => array(
        '2'   => 'invest',    // 爱担保
        '5'   => 'lease',     // 爱融租
        '6'   => 'factoring', // 爱保理
        '7'   => 'art',       // 爱收藏
        '302' => 'shengxin',  // 省心计划影视类C套餐
        '201' => 'shengxin',  // 省心计划小贷类B套餐
        '200' => 'shengxin',  // 省心计划小贷类A套餐
        '202' => 'shengxin',  // 省心计划小贷类C套餐
        '300' => 'shengxin',  // 省心计划影视类A套餐
        '301' => 'shengxin',  // 省心计划影视类B套餐
        '100' => 'shengxin',  // 省心计划典当类A套餐
        '101' => 'shengxin',  // 省心计划典当类B套餐
        '102' => 'shengxin',  // 省心计划典当类C套餐
        '402' => 'shengxin',
    ),

    //borrow_tender中,全部债权的debt_type
    'borrow_tender_debt_type_debt' => array(
        '2' => array('name' => '爱担保', 'code' => 'invest'),
        '6' => array('name' => '爱融租', 'code' => 'lease'),
        '8' => array('name' => '爱保理', 'code' => 'factoring'),
        '10' => array('name' => '爱收藏', 'code' => 'art'),
        '12' => array('name' => '省心计划', 'code' => 'shengxin'),//对应302
        '14' => array('name' => '省心计划', 'code' => 'shengxin'),//对应201
        '16' => array('name' => '省心计划', 'code' => 'shengxin'),
        '18' => array('name' => '省心计划', 'code' => 'shengxin'),
        '20' => array('name' => '省心计划', 'code' => 'shengxin'),
        '22' => array('name' => '省心计划', 'code' => 'shengxin'),
        '24' => array('name' => '省心计划', 'code' => 'shengxin'),
        '26' => array('name' => '省心计划', 'code' => 'shengxin'),
        '28' => array('name' => '省心计划', 'code' => 'shengxin'),
        '32' => array('name' => '省心计划', 'code' => 'shengxin'), //对应402
        '34' => array('name' => '智选集合', 'code' => 'zhixuan'), // 3000
    	'38' => array('name' => '阳光智选', 'code' => 'ygzhixuan'), // 3200
    ),

    //还款方式
    'repament_style' => array(
        '0' => '按月付息，到期还本',
        '3' => '按季付息，到期还本',
        '1' => '到期还本付息', //一次性还本付息
        '5' => '等额本息,按月付款',
    ),

    //计息方式
    'interest_style' => array(
        '0' => '投资当日起息，按日计息',
        '1' => '投资次日起息，按日计息',
        '6' => '每日计息，按日结转',
    ),

    // 合同模板
    'agreement_template' => array(
        '524' => array(
            'name' => '企业直投（旧）',
            'value' => 'xxx_guarantee_loan_contract'
        ),
        '525' => array(
            'name' => '债权转让（旧）',
            'value' => 'xxx_credit_assignment_agreement'
        ),
        '528' => array(
            'name' => '企业直投（新）',
            'value' => 'xxx_guarantee_loan_contract_new'
        ),
        '529' => array(
            'name' => '借贷及担保服务协议模板',
            'value' => 'xxx_guarantee_quartet_loan_contract'
        ),
        '548' => array(
            'name' => '借贷及担保服务协议模板—中鸿基',
            'value' => 'xxx_guarantee_quartet_loan_contract_by_zhj'
        ),
        '591' => array(
            'name' => '资产证券化-中金投模板01',
            'value' => 'xxx_guarantee_abs_zjt_01'
        ),
        '596' => array(  //pre是592
            'name' => '融租-合同',
            'value' => 'xxx_lease'
        ),
        '605' => array(
            'name' => '借贷及担保服务协议模板—20140606版',
            'value' => 'xxx_guarantee_20140606'
        ),
        'ABL' => array(
            'name' => '保理合同默认模板',
            'value' => 'ABL'
        ),
        '610' => array(
            'name' => '保理-合同',
            'value' => 'xxx_factoring'
        ),
        '611' => array(
            'name' => '保理-合同20140805',
            'value' => 'xxx_factoring_20140805'
        ),
    ),

    //奖励充值类型
    'reward_account_type' => array(
        'award_invest' => '注册奖励生效',
        'award_invite' => '推广奖励生效',
        'invest' => '投资付款',
        'award_other' => '其他奖励生效',
        'voucher' => '积分兑换',
        'luckydrawbonus' => '抽奖奖金',
        'coupon' => '奖励金转换为投资券',
    ),

    //投资券来源
    //2016.7.14目前已经改为直接读库，不在使用此配置，如需删除请自行确认
    'couponsrc' => array(
        'REG' => '注册奖励',
    ),

    //着陆页类型
    'landing_class' => array(
        '0' => '请选择',
        'reg' => '注册页',
        'index' => '首页',
        'activity' => '活动页',
        'project' => '项目页',
        'topic' => '专题页',
        'products' => '产品列表页',
        'phone_reg' => '移动注册页',
        'phone_index' => '移动首页',
        'phone_activity' => '移动活动页',
        'phone_project' => '移动项目页',
        'phone_topic' => '移动专题页',
        'phone_products' => '移动产品列表页',
        'sem_reg' => 'SEM专用着陆页',
    ),

    //站内注册来源类型
    'reg_log_type' => array(
        'userguide' => 'userguide',
        'header' => 'header',
        'worldCup' => 'worldCup',
        'sem' => 'sem',
        'weixin' => 'weixin',
        'mobile' => 'mobile',
    ),

    //渠道入口统计入口名称
    'login_total' => array(
        'header' => '网站通用注册',
        'sem' => 'landingpage',
        'userguide' => '新手引导',
        'weixin' => '微信邀请',
        'worldcup' => '世界杯活动页',
        'mobile' => '移动手机端注册',
        'm_invite' => '移动端邀请注册',
    ),
    'special_company' => array(
        '0' => '无',
        '1' => '汉能',
    ),

    //终审人员
    'final_staff' => array(
        'zhaochunxia' => 'review_1',
        'wangbo' => 'review_2',
        'guyun' => 'review_3',
        'liubo' => 'review_4',
        'chenghan' => 'review_5',
        'wuwenbo' => 'review_6',
        'caizhongzhong' => 'review_7',
        'suhong' => 'review_8',
    ),

    //企业类型
    'company_type' => array(
        '2' => '借款企业',
        '5' => '承租企业',
        '6' => '原债务企业',
        '7' => '爱收藏借款企业',
        '8' => '省心计划（影视类）借款企业',
        '9' => '省心计划（小贷类）借款企业',
        '10' => '零钱计划借款企业',
    ),

    //线上募资天数
    'valid_time' => 60,

    //最低投资金额
    'lowest_account' => 100,

    //投资递增金
    'most_account' => 0,

    //最高投资金额
    'invest_step' => 100,

    //起息时间
    'delay_value_days' => 0,

    //借款企业行业大类
    'company_industry' => array(
        '' => '请选择',
        1 => '农业',
        2 => '林业',
        3 => '畜牧业',
        4 => '渔业',
        5 => '农、林、牧、渔服务业',
        6 => '煤炭开采和洗选业',
        7 => '石油和天然气开采业',
        8 => '黑色金属矿采选业',
        9 => '有色金属矿采选业',
        10 => '非金属矿采选业',
        11 => '开采辅助活动',
        12 => '其他采矿业',
        13 => '农副食品加工业',
        14 => '食品制造业',
        15 => '酒、饮料和精制茶制造业',
        16 => '烟草制品业',
        17 => '纺织业',
        18 => '纺织服装、服饰业',
        19 => '皮革、毛皮、羽毛及其制品和制鞋业',
        20 => '木材加工和木、竹、藤、棕、草制品业',
        21 => '家具制造业',
        22 => '造纸和纸制品业',
        23 => '印刷和记录媒介复制业',
        24 => '文教、工美、体育和娱乐用品制造业',
        25 => '石油加工、炼焦和核燃料加工业',
        26 => '化学原料和化学制品制造业',
        27 => '医药制造业',
        28 => '化学纤维制造业',
        29 => '橡胶和塑料制品业',
        30 => '非金属矿物制品业',
        31 => '黑色金属冶炼和压延加工业',
        32 => '有色金属冶炼和压延加工业',
        33 => '金属制品业',
        34 => '通用设备制造业',
        35 => '专用设备制造业',
        36 => '汽车制造业',
        37 => '铁路、船舶、航空航天和其他运输设备制造业',
        38 => '电气机械和器材制造业',
        39 => '计算机、通信和其他电子设备制造业',
        40 => '仪器仪表制造业',
        41 => '其他制造业',
        42 => '废弃资源综合利用业',
        43 => '金属制品、机械和设备修理业',
        44 => '电力、热力生产和供应业',
        45 => '燃气生产和供应业',
        46 => '水的生产和供应业',
        47 => '房屋建筑业',
        48 => '土木工程建筑业',
        49 => '建筑安装业',
        50 => '建筑装饰和其他建筑业',
        51 => '批发业',
        52 => '零售业',
        53 => '铁路运输业',
        54 => '道路运输业',
        55 => '水上运输业',
        56 => '航空运输业',
        57 => '管道运输业',
        58 => '装卸搬运和运输代理业',
        59 => '仓储业',
        60 => '邮政业',
        61 => '住宿业',
        62 => '餐饮业',
        63 => '电信、广播电视和卫星传输服务',
        64 => '互联网和相关服务',
        65 => '软件和信息技术服务业',
        66 => '货币金融服务',
        67 => '资本市场服务',
        68 => '保险业',
        69 => '其他金融业',
        70 => '房地产业',
        71 => '租赁业',
        72 => '商务服务业',
        73 => '研究和试验发展',
        74 => '专业技术服务业',
        75 => '科技推广和应用服务业',
        76 => '水利管理业',
        77 => '生态保护和环境治理业',
        78 => '公共设施管理业',
        79 => '居民服务业',
        80 => '机动车、电子产品和日用产品修理业',
        81 => '其他服务业',
        82 => '教育',
        83 => '卫生',
        84 => '社会工作',
        85 => '新闻和出版业',
        86 => '广播、电视、电影和影视录音制作业',
        87 => '文化艺术业',
        88 => '体育',
        89 => '娱乐业',
        90 => '中国共产党机关',
        91 => '国家机构',
        92 => '人民政协、民主党派',
        93 => '社会保障',
        94 => '群众团体、社会团体和其他成员组织',
        95 => '基层群众自治组织',
        96 => '国际组织'
    ),

    //借款企业行业分类
    'company_industry_subcategory' => array(
        1 => array(
            11 => '谷物种植',
            12 => '豆类、油料和薯类种植',
            13 => '棉、麻、糖、烟草种植',
            14 => '蔬菜、食用菌及园艺作物种植',
            15 => '水果种植',
            16 => '坚果、含油果、香料和饮料作物种植',
            17 => '中药材种植',
            19 => '其他农业'
        ),
        2 => array(
            21 => '林木育种和育苗',
            22 => '造林和更新',
            23 => '森林经营和管护',
            24 => '木材和竹材采运',
            25 => '林产品采集'
        ),
        3 => array(
            31 => '牲畜饲养',
            32 => '家禽饲养',
            33 => '狩猎和捕捉动物',
            39 => '其他畜牧业'
        ),
        4 => array(
            41 => '水产养殖',
            42 => '水产捕捞'
        ),
        5 => array(
            51 => '农业服务业',
            52 => '林业服务业',
            53 => '畜牧服务业',
            54 => '渔业服务业'
        ),
        6 => array(
            61 => '烟煤和无烟煤开采洗选',
            62 => '褐煤开采洗选',
            69 => '其他煤炭采选'
        ),
        7 => array(
            71 => '石油开采',
            72 => '天然气开采'
        ),
        8 => array(
            81 => '铁矿采选',
            82 => '锰矿、铬矿采选',
            89 => '其他黑色金属矿采选'
        ),
        9 => array(
            91 => '常用有色金属矿采选',
            92 => '贵金属矿采选',
            93 => '稀有稀土金属矿采选'
        ),
        10 => array(
            101 => '土砂石开采',
            102 => '化学矿开采',
            102 => '采盐',
            109 => '石棉及其他非金属矿采选'
        ),
        11 => array(
            111 => '煤炭开采和洗选辅助活动',
            112 => '石油和天然气开采辅助活动',
            119 => '其他开采辅助活动'
        ),
        12 => array(
            120 => '其他采矿业'
        ),
        13 => array(
            131 => '谷物磨制',
            132 => '饲料加工',
            133 => '植物油加工',
            134 => '制糖业',
            135 => '屠宰及肉类加工',
            136 => '水产品加工',
            137 => '蔬菜、水果和坚果加工',
            139 => '其他农副食品加工'
        ),
        14 => array(
            141 => '焙烤食品制造',
            142 => '糖果、巧克力及蜜饯制造',
            143 => '方便食品制造',
            144 => '乳制品制造',
            145 => '罐头食品制造',
            146 => '调味品、发酵制品制造',
            149 => '其他食品制造'
        ),
        15 => array(
            151 => '酒的制造',
            152 => '饮料制造',
            153 => '精制茶加工'
        ),
        16 => array(
            161 => '烟叶复烤',
            162 => '卷烟制造',
            169 => '其他烟草制品制造'
        ),
        17 => array(
            171 => '棉纺织及印染精加工',
            172 => '毛纺织及染整精加工',
            173 => '麻纺织及染整精加工',
            174 => '丝绢纺织及印染精加工',
            175 => '化纤织造及印染精加工',
            176 => '针织或钩针编织物及其制品制造',
            177 => '家用纺织制成品制造',
            178 => '非家用纺织制成品制造'
        ),
        18 => array(
            181 => '机织服装制造',
            182 => '针织或钩针编织服装制造',
            183 => '服饰制造'
        ),
        19 => array(
            191 => '皮革鞣制加工',
            192 => '皮革制品制造',
            193 => '毛皮鞣制及制品加工',
            194 => '羽毛(绒)加工及制品制造',
            195 => '制鞋业'
        ),
        20 => array(
            201 => '木材加工',
            202 => '人造板制造',
            203 => '木制品制造',
            204 => '竹、藤、棕、草等制品制造'
        ),
        21 => array(
            211 => '木质家具制造',
            212 => '竹、藤家具制造',
            213 => '金属家具制造',
            214 => '塑料家具制造',
            219 => '其他家具制造'
        ),
        22 => array(
            221 => '纸浆制造',
            222 => '造纸',
            223 => '纸制品制造'
        ),
        23 => array(
            231 => '印刷',
            232 => '装订及印刷相关服务',
            233 => '记录媒介复制'
        ),
        24 => array(
            241 => '文教办公用品制造',
            242 => '乐器制造',
            243 => '工艺美术品制造',
            244 => '体育用品制造',
            245 => '玩具制造',
            246 => '游艺器材及娱乐用品制造',
        ),
        25 => array(
            251 => '精炼石油产品制造',
            252 => '炼焦',
            253 => '核燃料加工',
        ),
        26 => array(
            261 => '基础化学原料制造',
            262 => '肥料制造',
            263 => '农药制造',
            264 => '涂料、油墨、颜料及类似产品制造',
            265 => '合成材料制造',
            266 => '专用化学产品制造',
            267 => '炸药、火工及焰火产品制造',
            268 => '日用化学产品制造'
        ),
        27 => array(
            271 => '化学药品原料药制造',
            272 => '化学药品制剂制造',
            273 => '中药饮片加工',
            274 => '中成药生产',
            275 => '兽用药品制造',
            276 => '生物药品制造',
            277 => '卫生材料及医药用品制造'
        ),
        28 => array(
            281 => '纤维素纤维原料及纤维制造',
            282 => '合成纤维制造',
        ),
        29 => array(
            291 => '橡胶制品业',
            292 => '塑料制品业'
        ),
        30 => array(
            301 => '水泥、石灰和石膏制造',
            302 => '石膏、水泥制品及类似制品制造',
            303 => '砖瓦、石材等建筑材料制造',
            304 => '玻璃制造',
            305 => '玻璃制品制造',
            306 => '玻璃纤维和玻璃纤维增强塑料制品制造',
            307 => '陶瓷制品制造',
            308 => '耐火材料制品制造',
            309 => '石墨及其他非金属矿物制品制造'
        ),
        31 => array(
            311 => '炼铁',
            312 => '炼钢',
            313 => '黑色金属铸造',
            314 => '钢压延加工',
            315 => '铁合金冶炼'
        ),
        32 => array(
            321 => '常用有色金属冶炼',
            322 => '贵金属冶炼',
            323 => '稀有稀土金属冶炼',
            324 => '有色金属合金制造',
            325 => '有色金属铸造',
            326 => '有色金属压延加工'
        ),
        33 => array(
            331 => '结构性金属制品制造',
            332 => '金属工具制造',
            333 => '集装箱及金属包装容器制造',
            334 => '金属丝绳及其制品制造',
            335 => '建筑、安全用金属制品制造',
            336 => '金属表面处理及热处理加工',
            337 => '搪瓷制品制造',
            338 => '金属制日用品制造',
            339 => '其他金属制品制造',
        ),
        34 => array(
            341 => '锅炉及原动设备制造',
            342 => '金属加工机械制造',
            343 => '物料搬运设备制造',
            344 => '泵、阀门、压缩机及类似机械制造',
            345 => '轴承、齿轮和传动部件制造',
            346 => '烘炉、风机、衡器、包装等设备制造',
            347 => '文化、办公用机械制造',
            348 => '通用零部件制造',
            349 => '其他通用设备制造业',
        ),
        35 => array(
            351 => '采矿、冶金、建筑专用设备制造',
            352 => '化工、木材、非金属加工专用设备制造',
            353 => '食品、饮料、烟草及饲料生产专用设备制造　　　',
            354 => '印刷、制药、日化及日用品生产专用设备制造',
            355 => '纺织、服装和皮革加工专用设备制造',
            356 => '电子和电工机械专用设备制造',
            357 => '农、林、牧、渔专用机械制造',
            358 => '医疗仪器设备及器械制造',
            359 => '环保、社会公共服务及其他专用设备制造'
        ),
        36 => array(
            361 => '汽车整车制造',
            362 => '改装汽车制造',
            363 => '低速载货汽车制造',
            364 => '电车制造',
            365 => '汽车车身、挂车制造',
            366 => '汽车零部件及配件制造'
        ),
        37 => array(
            371 => '铁路运输设备制造',
            372 => '城市轨道交通设备制造',
            373 => '船舶及相关装置制造',
            374 => '航空、航天器及设备制造',
            375 => '摩托车制造',
            376 => '自行车制造',
            377 => '非公路休闲车及零配件制造',
            379 => '潜水救捞及其他未列明运输设备制造'
        ),
        38 => array(
            381 => '电机制造',
            382 => '输配电及控制设备制造',
            383 => '电线、电缆、光缆及电工器材制造',
            384 => '电池制造',
            385 => '家用电力器具制造',
            386 => '非电力家用器具制造',
            387 => '照明器具制造',
            389 => '其他电气机械及器材制造'
        ),
        39 => array(
            391 => '计算机制造',
            392 => '通信设备制造',
            393 => '广播电视设备制造',
            394 => '雷达及配套设备制造',
            395 => '视听设备制造',
            396 => '电子器件制造',
            397 => '电子元件制造',
            399 => '其他电子设备制造'
        ),
        40 => array(
            401 => '通用仪器仪表制造',
            402 => '专用仪器仪表制造',
            403 => '钟表与计时仪器制造',
            404 => '光学仪器及眼镜制造',
            409 => '其他仪器仪表制造业'
        ),
        41 => array(
            411 => '日用杂品制造',
            412 => '煤制品制造',
            413 => '核辐射加工',
            419 => '其他未列明制造业'
        ),
        42 => array(
            421 => '金属废料和碎屑加工处理',
            422 => '非金属废料和碎屑加工处理'
        ),
        43 => array(
            431 => '金属制品修理',
            432 => '通用设备修理',
            433 => '专用设备修理',
            434 => '铁路、船舶、航空航天等运输设备修理',
            435 => '电气设备修理',
            436 => '仪器仪表修理',
            439 => '其他机械和设备修理业',
        ),
        44 => array(
            441 => '电力生产',
            442 => '电力供应',
            443 => '热力生产和供应',
        ),
        45 => array(
            450 => '燃气生产和供应业',
        ),
        46 => array(
            461 => '自来水生产和供应',
            462 => '污水处理及其再生利用',
            469 => '其他水的处理、利用与分配',
        ),
        47 => array(
            470 => '房屋建筑业',
        ),
        48 => array(
            481 => '铁路、道路、隧道和桥梁工程建筑',
            482 => '水利和内河港口工程建筑',
            483 => '海洋工程建筑',
            484 => '工矿工程建筑',
            485 => '架线和管道工程建筑',
            489 => '其他土木工程建筑'
        ),
        49 => array(
            491 => '电气安装',
            492 => '管道和设备安装',
            499 => '其他建筑安装业'
        ),
        50 => array(
            501 => '建筑装饰业',
            502 => '工程准备活动',
            503 => '提供施工设备服务',
            509 => '其他未列明建筑业'
        ),
        51 => array(
            511 => '农、林、牧产品批发',
            512 => '食品、饮料及烟草制品批发',
            513 => '纺织、服装及家庭用品批发',
            514 => '文化、体育用品及器材批发',
            515 => '医药及医疗器材批发',
            516 => '矿产品、建材及化工产品批发',
            517 => '机械设备、五金产品及电子产品批发',
            518 => '贸易经纪与代理',
            519 => '其他批发业',
        ),
        52 => array(
            521 => '综合零售',
            522 => '食品、饮料及烟草制品专门零售',
            523 => '纺织、服装及日用品专门零售',
            524 => '文化、体育用品及器材专门零售',
            525 => '医药及医疗器材专门零售',
            526 => '汽车、摩托车、燃料及零配件专门零售',
            527 => '家用电器及电子产品专门零售',
            528 => '五金、家具及室内装饰材料专门零售',
            529 => '货摊、无店铺及其他零售业',
        ),
        53 => array(
            531 => '铁路旅客运输',
            532 => '铁路货物运输',
            533 => '铁路运输辅助活动'
        ),
        54 => array(
            541 => '城市公共交通运输',
            542 => '公路旅客运输',
            543 => '道路货物运输',
            544 => '道路运输辅助活动',
        ),
        55 => array(
            551 => '水上旅客运输',
            552 => '水上货物运输',
            553 => '水上运输辅助活动',
        ),
        56 => array(
            561 => '航空客货运输',
            562 => '通用航空服务',
            563 => '航空运输辅助活动',
        ),
        57 => array(
            570 => '管道运输业',
        ),
        58 => array(
            581 => '装卸搬运',
            582 => '运输代理业',
        ),
        59 => array(
            591 => '谷物、棉花等农产品仓储',
            599 => '其他仓储业'
        ),
        60 => array(
            601 => '邮政基本服务',
            602 => '快递服务'
        ),
        61 => array(
            611 => '旅游饭店',
            612 => '一般旅馆',
            619 => '其他住宿业',
        ),
        62 => array(
            621 => '正餐服务',
            622 => '快餐服务',
            623 => '饮料及冷饮服务',
            629 => '其他餐饮业',
        ),
        63 => array(
            631 => '电信',
            632 => '广播电视传输服务',
            633 => '卫星传输服务',
        ),
        64 => array(
            641 => '互联网接入及相关服务',
            642 => '互联网信息服务',
            649 => '其他互联网服务',
        ),
        65 => array(
            651 => '软件开发',
            652 => '信息系统集成服务',
            653 => '信息技术咨询服务',
            654 => '数据处理和存储服务',
            655 => '集成电路设计',
            659 => '其他信息技术服务业',
        ),
        66 => array(
            661 => '中央银行服务',
            662 => '货币银行服务',
            663 => '非货币银行服务',
            664 => '银行监管服务',
        ),
        67 => array(
            671 => '证券市场服务',
            672 => '期货市场服务',
            673 => '证券期货监管服务',
            674 => '资本投资服务',
            679 => '其他资本市场服务',
        ),
        68 => array(
            681 => '人身保险',
            682 => '财产保险',
            683 => '再保险',
            684 => '养老金',
            685 => '保险经纪与代理服务',
            686 => '保险监管服务',
            689 => '其他保险活动',
        ),
        69 => array(
            691 => '金融信托与管理服务',
            692 => '控股公司服务',
            693 => '非金融机构支付服务',
            694 => '金融信息服务',
            699 => '其他未列明金融业',
        ),
        70 => array(
            701 => '房地产开发经营',
            702 => '物业管理',
            703 => '房地产中介服务',
            704 => '自有房地产经营活动',
            709 => '其他房地产业'
        ),
        71 => array(
            711 => '机械设备租赁',
            712 => '文化及日用品出租',
        ),
        72 => array(
            721 => '企业管理服务',
            722 => '法律服务',
            723 => '咨询与调查',
            724 => '广告业',
            725 => '知识产权服务',
            726 => '人力资源服务',
            727 => '旅行社及相关服务',
            728 => '安全保护服务',
            729 => '其他商务服务业',
        ),
        73 => array(
            731 => '自然科学研究和试验发展',
            732 => '工程和技术研究和试验发展',
            733 => '农业科学研究和试验发展',
            734 => '医学研究和试验发展',
            735 => '社会人文科学研究'
        ),
        74 => array(
            741 => '气象服务',
            742 => '地震服务',
            743 => '海洋服务',
            744 => '测绘服务',
            745 => '质检技术服务',
            746 => '环境与生态监测',
            747 => '地质勘查',
            748 => '工程技术',
            749 => '其他专业技术服务业',
        ),
        75 => array(
            751 => '技术推广服务',
            752 => '科技中介服务',
            759 => '其他科技推广和应用服务业',
        ),
        76 => array(
            761 => '防洪除涝设施管理',
            762 => '水资源管理',
            763 => '天然水收集与分配',
            764 => '水文服务',
            769 => '其他水利管理业'
        ),
        77 => array(
            771 => '生态保护',
            772 => '环境治理业'
        ),
        78 => array(
            781 => '市政设施管理',
            782 => '环境卫生管理',
            783 => '城乡市容管理',
            784 => '绿化管理',
            785 => '公园和游览景区管理'
        ),
        79 => array(
            791 => '家庭服务',
            792 => '托儿所服务',
            793 => '洗染服务',
            794 => '理发及美容服务',
            795 => '洗浴服务',
            796 => '保健服务',
            797 => '婚姻服务',
            798 => '殡葬服务',
            799 => '其他居民服务业',
        ),
        80 => array(
            801 => '汽车、摩托车修理与维护',
            802 => '计算机和办公设备维修',
            803 => '家用电器修理',
            809 => '其他日用产品修理业',
        ),
        81 => array(
            811 => '清洁服务',
            819 => '其他未列明服务业'
        ),
        82 => array(
            821 => '学前教育',
            822 => '初等教育',
            823 => '中等教育',
            824 => '高等教育',
            825 => '特殊教育',
            829 => '技能培训、教育辅助及其他教育'
        ),
        83 => array(
            831 => '医院',
            832 => '社区医疗与卫生院',
            833 => '门诊部（所）',
            834 => '计划生育技术服务活动',
            835 => '妇幼保健院（所、站）',
            836 => '专科疾病防治院（所、站）',
            837 => '疾病预防控制中心',
            839 => '其他卫生活动',
        ),
        84 => array(
            841 => '提供住宿社会工作',
            842 => '不提供住宿社会工作',
        ),
        85 => array(
            851 => '新闻业',
            852 => '出版业'
        ),
        86 => array(
            861 => '广播',
            862 => '电视',
            863 => '电影和影视节目制作',
            864 => '电影和影视节目发行',
            865 => '电影放映',
            866 => '录音制作',
        ),
        87 => array(
            871 => '文艺创作与表演',
            872 => '艺术表演场馆',
            873 => '图书馆与档案馆',
            874 => '文物及非物质文化遗产保护',
            875 => '博物馆',
            876 => '烈士陵园、纪念馆',
            877 => '群众文化活动',
            879 => '其他文化艺术业',
        ),
        88 => array(
            881 => '体育组织',
            882 => '体育场馆',
            883 => '休闲健身活动',
            889 => '其他体育'
        ),
        89 => array(
            891 => '室内娱乐活动',
            892 => '游乐园',
            893 => '彩票活动',
            894 => '文化、娱乐、体育经纪代理',
            899 => '其他娱乐业',
        ),
        90 => array(
            900 => '中国共产党机关',
        ),
        91 => array(
            911 => '国家权力机构',
            912 => '国家行政机构',
            913 => '人民法院和人民检察院',
            919 => '其他国家机构',
        ),
        92 => array(
            921 => '人民政协',
            922 => '民主党派',
        ),
        93 => array(
            930 => '社会保障',
        ),
        94 => array(
            941 => '群众团体',
            942 => '社会团体',
            943 => '基金会',
            944 => '宗教组织',
        ),
        95 => array(
            951 => '社区自治组织',
            952 => '村民自治组织',
        ),
        96 => array(
            960 => '国际组织',
        ),
    ),

    //推广方式
    'waytype' => array(
        '1' => 'SEM',
        '2' => '市场合作',
        '3' => '线下',
        '4' => '邀请',
        '5' => 'SEO',
        '6' => '外链',
        '7' => '直接访问',
        '8' => 'EDM',
        '9' => 'APP',
        '10' => '站内',
        '11' => '其他',
    ),

    //卡片类型
    'user_card_type' => array(
        '-1' => '请选择',
        '0' => '其他',
        '1' => '身份证',
        '2' => '军官证',
        '3' => '台胞证',
        '4' => '护照',
        '5' => '营业执照'
    ),

    // 证件类型
    'card_type_code' => array(
        1 => 'PRC_ID',              #身份证
        3 => 'COMPATRIOTS_CARD',     #港澳台通行证
        4 => 'PASSPORT',            #护照
        6 => 'PERMANENT_RESIDENCE',   #外国人永久居留证
    ),

    //合作企业中用户身份类型
    'enterprise_user_card_type' => array(
        -1 => '请选择',
        1 => '身份证',
        3 => '台胞证',
        4 => '护照',
        5 => '营业执照',

    ),
    'user_urgentcontact' => array(
        1 => '父母',
        2 => '配偶',
        3 => '子女',
        4 => '兄弟姐妹',
        5 => '亲戚',
        6 => '朋友',
        7 => '同事',
        8 => '同学'
    ),

    //保理类型
    'factoring_type' => array(
        -1 => '请选择',
        1 => '明保理',
        2 => '暗保理',
        3 => '反向保理'
    ),

    //管理后台角色所属部门
    'admin_user_sector' => array(
        '请选择', '客服部', '运营部', '市场部', '业务发展部', '项目支持部', '风控部', '财务部', '产品部', '技术部', '公关部', '行政部', '法务部', '资产管理部', '董事会',
    ),

    //项目利率
    'borrow_apr' => array(
        '1' => '请选择',
        '8.00' => '8%',
        '8.50' => '8.5%',
        '9.00' => '9%',
        '9.50' => '9.5%',
        '10.00' => '10%',
        '10.50' => '10.5%',
        '11.00' => '11%',
        '11.50' => '11.5%',
        '12.00' => '12%',
        '12.50' => '12.5%',
        '13.00' => '13%',
        '13.50' => '13.5%',
        '14.00' => '14%',
        '14.50' => '14.5%',
    ),

    //省心计划项目利率
    'sx_increase_apr' => array(
        '0.00' => '0%'
    ),

    //预约投资项目规则
    'book_invest_borrow_type_rule' => array(
        '2' => '爱担保',
        '6' => '爱保理',
        '7' => '爱收藏',
        '5' => '爱融租',
        '100-999' => '省心计划'
    ),

    //预约投标每人最大购买额
    'appointment_max_invest_money' => 50000,

    //不同类型的借款模式,支付方的可选项,1表示企业,2是担保机构
    'borrow_mode_type' => array(
        '2-1' => '1,2',
        '5-0' => '1,2',
        '5-1' => '1,2',
        '6-0' => '1,2',
        '7-1' => '1,2',
        '100-199-1' => '1,2',
        '200-299-0' => '1,2',
        '200-299-1' => '1,2',
        '300-399-2' => '1',
        '300-399-1' => '1,2',
        '402-0' => '1,2',
    ),

    //提前还款项目期数限制, 总期数(利息)=>最多能还的期数(利息)
    'borrow_periods' => array(
        '3-5' => '2',
        '6-11' => '3',
        '12-100' => '4',
    ),

    //担保公司录入使用
    'borrow_type_for_guarantor' => array(
        '2' => '爱担保',
        '5' => '爱融租',
        '6' => '爱保理',
        '7' => '爱收藏',
        '100' => '省心计划典当类',
        '200' => '省心计划小贷类',
        '300' => '省心计划影视类',
		'400' => '省心优选'
    ),

    //逾期还款项目，拆分数据必须要大于的delta值
    'overdue_split_delta' => 10000,

    //逾期罚息日利率
    'overdue_extra_day_apr' => array(0.0005),

    //充值满15天, 提现免收手续费
    'withdraw_free_days' => 15,
	//提现手续费 默认2元
	'withdraw_cash_fee' => 2,
	
    //活期配置
    'linghuo_config' => array(
        'interest_style' => 6,
        'lowest_account' => 1,
        'invest_step' => 1,
    ),

    //加息体验最大天数
    'experience_day_limit'=>365,
	//优惠券类型
	'coupon_type' => array(
		1 => '投资券',
		2 => '抵现券',
		3 => '加息券',
		4 => '加息券',
	),
	//投资颁奖人数配置
    'reward_list_config'=>array(
        "first_reward" => array( //一马当先配置
            array("num"=>1,"coupon_code"=>"FST", "re_money"=>50),  
            /*array("num"=>9,"coupon_code"=>"FST2-10", "re_money"=>50),*/
        ), 
        "rich_reward" => array(//一名惊人配置
            array("num"=>1,"coupon_code"=>"MST_new", "re_money"=>100),//500
            /*array("num"=>4,"coupon_code"=>"MST2-5", "re_money"=>100),*/
        ),
        "last_reward" => array(//一锤定音
            array("num"=>1,"coupon_code"=>"LST", "re_money"=>5),//50
        )
    ),
    //最高可加息本金计算配置
    //0, 取后台配置的最高可加息本金
    //1, 根据用户当天回款总金额计算最高可加息本金
    'interest_max_money_conf'=>1,
    // 项目预发布时间与发布时间-间隔配置，单位：秒
    'project_yufabu_timeLimit'=>300,

    // 智选计划项目配置
    'zxjh_config' => array(
		"low_apr_time"=>'2018-05-23',//降息时间
		"lock_period" => 7,        // 锁定期
		"novice_lock_period" => 30, //新手锁定期
		"novice_borrow_apr" => 6.5, //新手享受固定利率
		"plan_novice_switch" =>1,//智选计划新手优先开关0关闭1打开
        "wise_plan_apr_list" => array(  //  期限利率配置
            7 => 5,
            15 => 5.5,
            30 => 6,
			45 => 6.5,
			60 => 7,
			90 => 7.5,
			120 => 8,
			150 => 8.5,
			180 => 9,
			240 => 9.5,
			300 => 10,
			360 => 11,
			540 => 11.5,
			720 => 12
        ),
        "wise_plan_lowapr_list" => array(  //  2018-05-23降息期后限利率配置
            7 => 5,
            15 => 5.5,
            30 => 6,
            45 => 6.5,
            60 => 7,
            90 => 7.5,
            120 => 8,
            150 => 8.5,
            180 => 9,
            240 => 9.5,
            300 => 10,
            360 => 10.5,
            540 => 11,
            720 => 11.5
        ),
        "novice_reward" => array( //智选计划新手标加息配置
            "apr" => 4,//新手加息利率
            "duration" => 30, // 单位 天
            "account_limit" => 30000, // 元
        ),
        "plat_reward" => array(  // 平台加息
            "apr" => 0,
            "duration" => 0, // 单位 天
        ),
        "reserve_reward_apr" =>5,
        "exit_fee_aprs" => [
            "30" => 0.8, //持有满30天之前退出费率
            "180" => 0.5 //持有满30天不满180天退出费率
        ],
		"start_invest_amount" => 5.00,
    ),

	'super_user_two' => 4316,//超级投资人2固定ID

	'log_info' => array(
		1=>['remark'=>'平台奖励','log_type' =>'plat_reward'],
		2=>['remark'=>'新手奖励','log_type' =>'novice_reward'],
		3=>['remark'=>'加息收益','log_type' =>'interest_reward'],
		4=>['remark'=>'智选计划回息','log_type' =>'exit_invest_interest'],
		5=>['remark'=>'智选计划回本','log_type' =>'exit_invest_finish'],
	),
	//阳光智选新手加息
	'sunShineNoviceAddApr'=>[
		'switch'=>0,//开关
		'addApr'=>4,//4%
		'addDays'=>30,//30天
		'couponCode'=>'sun_novice',//触发优惠券
		'accountLimit'=>30000,//限额
		'accountLimitText'=>'3万元',//限额（万元）
	]

);
?>


