<?php
return [
    'wx_reset_password' => [//忘记交易密码
        'sms' => [
            'content' => '【网信】您的验证码是%vcode%，此验证码用于重置交易密码，5分钟内有效。',
        ],
 
     ],
    'wx_login' => [//登录注册短信
       'sms' => [
           'content' => '【网信】您的验证码是%vcode%，此验证码用于登录先锋用户中心，5分钟内有效。',
       ],

    ],
    'wx_vcode' => [//发验证码
       'sms' => [
           'content' => '【网信】您的验证码是%vcode%，验证码两分钟内有效。',
       ],

    ],
    'wx_vcode_5' => [//发验证码
       'sms' => [
           'content' => '【网信】您的验证码是%vcode%，验证码五分钟内有效。',
       ],

    ],

    
    // 债转
    'wx_buyer_order_create' => [//下单成功——认购方
        'sms' => [
            'content' => '【网信】您认购了一份债权，请于2小时之内进行线下转账并登录【先锋债转市场】上传付款凭证。若未能及时完成操作，系统将取消该笔交易。电子邮箱：xxbg@ucfgroup.com',
        ],
    ],
    'wx_seller_order_create' => [//下单成功——转让方
        'sms' => [
            'content' => '【网信】恭喜，您有一笔债权被认购，登录【先锋债转市场】查看详情。',
        ],
    ],
    
    
    'wx_seller_order_cancel_by_buyer' => [//订单取消(买家手工取消)——转让人
        'sms' => [
            'content' => '【网信】您取消了一笔债转订单（订单号：%order_no%），登录【先锋债转市场】查看详情。',
        ],
    ],
    'wx_seller_order_cancel_expire' => [//订单取消(债转有效期到期)——转让人
        'sms' => [
            'content' => '【网信】您的一笔债转由于有效期内无人认购而被取消，登录【先锋债转市场】查看详情。',
        ],
        
    ],
    'wx_seller_order_cancel_no_pay' => [//认购人超时未付款，系统取消交易——转让人
        'sms' => [
            'content' => '【网信】您的债转订单（订单号：%order_no%）因认购方未能按时付款而被取消，登录【先锋债转市场】查看详情。',
        ],
        
    ],
    
    
    'wx_seller_buyer_pay' => [//认购人付款——转让人
        'sms' => [
            'content' => '【网信】您的债转订单（订单号：%order_no%）认购方已完成付款，请查账。如收到相应款项，请登录【先锋债转市场】操作【确认收款】；否则您可以操作【确认未到账】申请客服介入。',
        ],
    ],
    
    
    'wx_buyer_seller_receive_money_fail' => [//转让人收款确认失败——认购方
        'sms' => [
            'content' => '【网信】转让方未能确认您的债转订单（订单号：%order_no%）并申了请客服介入。客服人员稍后会处理。请关注交易成功或取消的短信，并请密切关注先锋债转市场“查看我的认购”，最终以其中该订单状态为准。',
        ],
    ],
    
    
    'wx_buyer_seller_receive_money_success' => [//转让人确认收款——认购方
        'sms' => [
            'content' => '【网信】恭喜您成功认购一笔债权（订单号：%order_no%），登录【先锋债转市场】查看详情。',
        ],
    ],
    'wx_seller_seller_receive_money_success' => [//转让人确认收款——出让人
        'sms' => [
            'content' => '【网信】恭喜您成功转出一笔债权（订单号：%order_no%），登录【先锋债转市场】查看详情。',
        ],
    ],
    
    
    'wx_buyer_seller_no_confirm_cert' => [//转让人超时未确认凭证——认购方
        'sms' => [
            'content' => '【网信】转让方未能确认您的债转订单（订单号：%order_no%）。客服人员稍后会处理。请关注交易成功或取消的短信，并请密切关注先锋债转市场“查看我的认购”，最终以其中该订单状态为准。',
        ],
    ],
    'wx_seller_seller_no_confirm_cert' => [//转让人超时未确认凭证——转让人
        'sms' => [
            'content' => '【网信】您的债转订单（订单号：%order_no%）未能按时确认收款。客服人员稍后会处理。请关注交易成功或取消的短信，并请密切关注先锋债转市场“查看我的认购”，最终以其中该订单状态为准。',
        ],
    ],
    
    
    'wx_buyer_trade_success' => [//客服判定（操作）交易成功——认购方
        'sms' => [
            'content' => '【网信】您成功认购一笔债权（订单号：%order_no%），登录【先锋债转市场】查看详情。',
        ],
    ],
    'wx_seller_trade_success' => [//客服判定（操作）交易成功——转让人
        'sms' => [
            'content' => '【网信】您成功转出一笔债权（订单号：%order_no%），登录【先锋债转市场】查看详情。',
        ],
    ],
    
    
    'wx_buyer_trade_fail' => [//客服判定（操作）交易失败——认购方
        'sms' => [
            'content' => '【网信】非常遗憾，经客服与交易双方沟通并根据获得的付款凭证，确定订单(订单号：%order_no%)交易取消，取消原因为：%reason%，电子邮箱：xxbg@ucfgroup.com',
        ],
    ],
    'wx_seller_trade_fail' => [//客服判定（操作）交易失败——转让人
        'sms' => [
            'content' => '【网信】非常遗憾，经客服与交易双方沟通并根据获得的付款凭证，确定订单(订单号：%order_no%)交易取消，取消原因为：%reason%，电子邮箱：xxbg@ucfgroup.com',
        ],
    ],

    'wx_bank_card_auth_success' => [//客服判定（操作）审核银行卡通过
        'sms' => [
            'content' => '【网信】您提交的银行卡信息，已通过审核，您可以用该银行卡号使用对应先锋服务了',
        ],
    ],
    'wx_bank_card_auth_fail' => [//客服判定（操作）审核银行卡失败
        'sms' => [
            'content' => '【网信】很抱歉，您提交的银行卡信息审核失败，失败原因：%reason%  请修改之后重新提交审核，如有疑问，可以拨打我们的客服电话：010-89929966',
        ],
    ],
    'wx_warning' => [//报警
        'sms' => [
            'content' => '【网信】债权相关报警 详情：%reason%  ',
        ],
    ],
    'xf_auth_login' => [
        'sms' => [
            'content' => '【网信】验证码是：%vcode% ，该验证码用于授权登录第三方平台，5分钟有效。 ',
        ],
    ],
    'change_phone_vcode' => [//修改绑定手机号验证码
        'sms' => [
            'content' => '【网信】您的验证码是%vcode%，此验证码用于修改绑定手机号，5分钟内有效。 ',
        ],
    ],
    'change_phone_success' => [//修改绑定手机号成功
        'sms' => [
            'content' => '【网信】恭喜，您提交的【修改绑定手机号】申请已通过审核，现在可以通过新手机号进行登录。 ',
        ],
    ],
    'change_phone_fail' => [//修改绑定手机号失败
        'sms' => [
            'content' => '【网信】抱歉，您提交的【修改绑定手机号】申请审核失败，请上传清晰证件照片并填写真实信息再试。 ',
        ],
    ],
    'jys_phone_success' => [//交易所成功
        'sms' => [
            'content' => '【网信】恭喜，您提交的【交易所-绑定手机号】申请已通过审核，现在可以通过新手机号进行登录。 ',
        ],
    ],
    'jys_phone_fail' => [//交易所失败
        'sms' => [
            'content' => '【网信】抱歉，您提交的【交易所绑定手机号】申请审核失败，请上传清晰证件照片并填写真实信息再试。',
        ],
    ],
    'manual_trigger' => [//人工触发的短信模板
        'sms' => [
            'content' => '【网信】%realname%：您好！债权人管理邮箱已收到邮箱地址为：%email%发来的借款企业相关材料需求申请，现需与您再次复核此邮箱信息真实与否：如是您本人意愿或经您授权，请回复：Y；非您本人邮箱发送，请回复：N。（待信息审核通过后，相关资料将发送至以上邮箱）',
        ],
    ],
    'confirm_sale_s' => [//汇源专区确认出售卖方
        'sms' => [
            'content' => '【网信】恭喜您成功出让%num%笔债权，请耐心等待受让人付款。',
        ],
    ],
    'confirm_sale_b' => [//汇源专区确认出售买方
        'sms' => [
            'content' => '【网信】恭喜您成功求购一笔债权，请在48小时内完成付款并登录【先锋管理后台】上传付款凭证。',
        ],
    ],
    'receipt_uploaded_to_seller' => [//受让人付款并上传付款凭证，送至出让人：
        'sms' => [
            'content' => '【网信】您的债转订单（汇源专区）认购方已完成付款，请查账。如收到相应款项，请登录【汇源专区】操作【确认收款】',
        ],
    ],

    'create_exclusive_purchase' => [//专属收购
        'sms' => [
            'content' => '【网信普惠】尊敬的网信普惠用户您好，现已为您成功开启专属收购特权！请登网信官微 - 用户中心 - 债转市场 - 点击专属收购进行操作；专属收购特权有效时间为%hour%小时，请抓紧时间进行操作哦~',
        ],
    ],
    'count_down_exclusive_purchase' => [//专属收购倒计时
        'sms' => [
            'content' => '【网信】尊敬的网信用户您好，为您开启的专属收购特权有效时间仅剩余30分钟，请您在30分钟内完成签约操作！',
        ],
    ],
    'reissue_create_exclusive_purchase_end' => [//专属收购补发短信
        'sms' => [
            'content' => '【网信普惠】尊敬的网信普惠用户您好，现已为您成功开启专属收购特权！请登网信官微 - 用户中心 - 债转市场 - 点击专属收购进行操作。债转市场：https://m.xfuser.com/debt/#/debtMarket，如有疑问可拨打电话：%assignee_tel%进行咨询。',
        ],
    ],
    'wj_login' => [//登录注册短信
        'sms' => [
            'content' => '【万峻】您的验证码是%vcode%，此验证码用于登录万峻用户中心，5分钟内有效。',
        ],

    ]
];
