<?php
/**
 * Created by PhpStorm.
 * User: ju
 * Date: 2017/3/24
 * Time: 下午2:17
 */
return array(
    'switch'  => '0',//私募开关
    'userIds' => array(
        '541844',     // 张峰
        '5559291',    // 陈东蔚
        '2407431',    // 武海宁
        '330',        // 蔡众众
        '178846',     // 吕宁
        '179063',     // 张硕
        '5351759',    // 郭馨泽
        '143827',     // 丁灵杰
        '5360629',    // 蒋兆宇
        '3959041',    // 赵鹏举
        '4465747',    // 陈兴春
        '2868305',    // 任晓丽
        '6693',       // 李强
        '531419',     // 张爱芳
        '6469071',    // 杜志鹏（UE）
    )
);