<?php
return [
    //相关配置
    "itouzi" => array(
        "platform_id" => 1,//平台id
        //平台标的类型
        "type" => array(
            '2'    => '爱担保',
            '202'  => '省心计划',
            '402'  => '省心优选'
        ),
        "ag_type" => array(
            "1" => array('2','202','402'),//大标的
        ),
        //运营发券事故禁止兑换投资记录ID
        "prohibit_tenderIds" => "9275075,9274917,9275121,9275035,9275027,9275097,9275017,9275167,9275021,9275019,9275161,9274989,9275091,9275117,9275063",
        //本金结清，剩余一期利息未还项目禁止兑换项目ID
        "prohibit_borrowIds" => "38775,38783,38821,42121,42129,42159,42183,42207,42383,42421",
        //禁止债转用户ID
        "nodebtTouser" => "7313743,7317181",

        /*还款方式*/
        "borrow_style" => array(
            "0" => "按月付息，到期还本",
            "3" => "按季付息，到期还本",
            "1" => "到期一次性还本付息",
            "4" => "按月付款，等额本金",
            "5" => "按月付款，等额本息",
        ),
    ),
    //风险等级
    "risk_level" => array(
        '1' => 'C1-保守型',
        '2' => 'C2-稳健型',
        '3' => 'C3-平衡型',
        '4' => 'C4-成长型',
        '5' => 'C5-积极型',
    ),
    //有解债转风险等级
    "level_risk_youjie" => array(
        '1' => 'C1-保守型',
        '2' => 'C2-稳健型',
        '3' => 'C3-平衡型',
        '4' => 'C4-成长型',
        '5' => 'C5-积极型',
    ),
    "minimum_amount_debt" => 50000,
    //oss预览地址
    "oss_preview_address" => ConfUtil::get('oss_preview_address'),
    //有解债转市场受让人白名单
    "debt_buyer_white_list" => array(
        12133232,12134084,3123876,40436,12134050,12134264,12130848,12135279,12133498
    ),
    //网信统计债权信息的平台
    "statistics_platform" => array(
        1,2,4
    ),
    //先锋统计债权信息的平台
    "xf_statistics_platform" => array(
        1,2,4,5
    ),

];
