<?php
return [
    //先锋数据中心介接入平台
    "platform_type" => array(
        1,//尊享
        2,//普惠
        3,//金融工场
        4,//智多新
        5,//交易所
    ),
    //线下产品平台
    "offline_products" => array(
        3,//金融工场
        4,//智多新
        5,//交易所
    ),
    //先锋数据中心接入商城
    "xf_shop" => array(
        1,//有解
    ),
    //先锋数据中心接入商城
    "xf_contract_type" => array(
        1,//服务协议
        2,//商城积分兑换服务协议
    ),
    'loantype' => [
        1 => '按季等额还款',
        2 => '按月等额还款',
        3 => '一次性还本付息',
        4 => '按月付息一次还本',
        5 => '按天一次性还款',
        6 => '按季付息到期还本',
        9 => '半年付息到期还本',
    ],
    // 测试用手机号码
    "xf_test_number" => array(
        18910660866,13439807685,15810571697,13716970622,18600273938
    ),
    //债转市场专区列表
    'area_list' => [
        1 => '汇源专区',
    ],
    'purchase_status' => [
        0 =>'待签约',
        1 =>'待付款',
        2 =>'已付款待债转',
        3 =>'已债转待生成合同',
        4 =>'交易完成',
        5 =>'已失效',
    ],
];
