<template>
  <section class="agreement">
    <h1 class="tc">授权委托书</h1>
    <p class="tr spacing">合同编码：</p>
    <div class="header">
      <div class="party-a">
        <p>
          <strong>委托方（甲方）：</strong>
          <label class="underscore">出借人姓名</label>
        </p>
        <p>
          <strong>身份证号码：</strong>
          <label class="underscore" style="width: 132px;">&nbsp;</label>
        </p>
      </div>
      <div class="party-b">
        <p>
          <strong>受托方（乙方）：北京万峻投资咨询有限公司</strong>
        </p>
        <p>
          <strong>统一社会信用代码：9111010530655804XE</strong>
        </p>
        <p>
          <strong>法定代表人：朱迎</strong>
        </p>
        <p>
          <strong>住 所：北京市朝阳区霄云路28号院2号楼11层1102内-01</strong>
        </p>
      </div>
    </div>
    <main>
      <p>
        鉴于，北京万峻投资咨询有限公司（以下简称“万峻”）作为一家依据《中华人民共和国公司法》成立的投资咨询公司，其经营范围包含资产管理、投资管理等。同时，万峻作为在北京经侦等有关监管机构备案的资产管理企业，其在资产处置板块业务手段丰富，能够全面解决不良资产处置和问题债权化解风险过程中遇到的复杂问题。</p>
      <p>为维护甲方的合法权益，加快不良债权处置进程，实现债权的有效清收，甲方授权委托乙方代为处置其合法拥有的到期债权。经甲乙双方友好协商，就委托事宜达成如下授权：</p>

      <h2>一、授权委托债权范围</h2>
      <p>甲方不可撤销的授权委托乙方全权代理甲方管理、清收、处置甲方在【东方联合】经营的【网信普惠平台】所有的全部【在途债权】。</p>

      <h2>二、授权委托内容</h2>
      <h3>（一）债权管理</h3>

      <h4>1、债权自身时效管理</h4>
      <p>乙方应当在本授权过程中保证对甲方享有的主债权其时效、债权附加的担保权时效以及担保期间等进行常规管理。根据授权实施调取、使用、分析甲方债权涉及的相关数据、资产信息、债务信息、担保信息等行为；</p>

      <h4>2、债权清收方案管理</h4>
      <p>乙方应当恪守管理人职责，制定切实有效的债权清收方案，利用管理人资源定期调整、披露、备案（如有）债权清收方案。同时，乙方应根据清收方案代理甲方行使对债务人的监督权、获取财务信息、主张款项支付等权利；</p>

      <h3>（二）债权处置</h3>
      <p>1、债权催收：乙方有权通过向债务人催收、敦促其还款等非诉讼手段，包括但不限于：电话、短信、网络、上门等方式实现债权的回收。</p>
      <p>2、诉讼追偿：乙方有权独自或另行委托有资格的第三方通过诉讼、仲裁、执行、破产等诉讼程序，实现债权的追偿。<strong>乙方有权单方决定是否以提起诉讼方式进行追偿，在启动诉讼程序时，无需另行接受甲方的同意及授权。甲方签署本授权委托书后视为其同意并签署《诉讼授权委托书》，详细内容参见附件一、《诉讼授权委托书》</strong>
      </p>
      <p>3、债权置换：为确保债权价值或有利于对债权的处置，乙方有权以其评估认定的资产、物权、债权或者第三方的资产、物权、债权对等置换甲方债权。</p>
      <p>4、债权转让：乙方有权根据自己或第三方的专业服务，决定对甲方所有的债权进行转让处置，包括要约竞价转让，拍卖转让，协议转让、以物抵债转让等。</p>

      <h3>（三）乙方转授权</h3>
      <p>
        甲方不可撤销的授权且承诺：乙方有权单独以乙方名义实施第二条第（一）、（二）款约定的委托内容；同时，乙方有权将上述委托内容以乙方名义另行委托具有资质的第三方主体并签署相关委托协议。包括但不限于：会计师事务所、律师事务所、催收公司、评估公司、不良资产处置企业以及其它经乙方认可能的、可提供债权催收服务的主体；</p>

      <h2>三、授权委托期限</h2>
      <p>本授权委托期限原则上为【10】年，另有特殊约定除外。自甲以双方签署本授权书之日生效；</p>
      <p>因法律程序上的原因导致委托期限超过10年的，本协议自动延期。本授权书签署完成后，因特殊情况需提终结委托事宜的，需由甲乙双方协商一致，另行签署相关协议；</p>

      <h2>四、授权委托费用</h2>
      <p>1、本协议确认：单个债务人单笔债务金额超过人民币五十万元（包含人民币五十万元）为大额债权；单个债务人单笔债务金额不超过人民币五十万元为小额分散债权。</p>
      <p>2、针对大额债权，拟继续采取“集约诉讼”的方式，委托专业的律师事务所采取诉讼/仲裁等措施，成本费率为回款金额的百分之二十。</p>
      <p>3、针对小额分散债权，拟采取电话、网络、上门催收与“集约诉讼”相结合的方式，成本费率为回款金额的百分之四十至百分之五十。</p>
      <p>4、乙方在清收该协议项下的债权资产过程中发生的一切费用由【甲】承担。乙方确定提起诉讼的，正常的诉讼费用（包括案件受理费、保全费、执行费、评估费等）由【 乙
        】方垫付，在该案执行回转的货币资金中，按实际垫付金额先行扣除；乙方作为催收主管和主责单位，除开展催收工作和公司运营各项成本外，不得盈利。</p>
      <p>5、委托费用的付款方式：待在途债权清收终结后，根据乙方制定的清收方案所实际清收的货币资金，按照【网信普惠平台】披露的良退方案进行分配，并由乙方指定专属账户将分配款项支付至甲方账户。</p>

      <h2>五、委托人（甲方）权利义务</h2>
      <p>1、甲方有权监督、了解、协助、配合乙方委托债权的清收工作；</p>
      <p>2、在甲乙双方签订本授权书后，乙方采取相应债权管理、调查、评估、诉讼措施或乙方在工作中存在有利于甲方利益行为的，甲方应当积极配合乙方；</p>
      <p>3、甲方应及时向乙方提供与债权清收有关的证据材料，并保证其所提供的证据材料真实、合法、有效；</p>
      <p>4、甲方有义务为乙方办理清收工作的各种授权委托手续；</p>

      <h2>六、受托人（乙方）权利义务</h2>
      <p>1、乙方接受甲方的委托，并不可撤销的承诺严格恪守管理人职责，坚守债权清收原则，积极推进清收程序；</p>
      <p>2、乙方指派的人员必须依法维护甲方的合法权益，保守甲方的个人隐私以及商业秘密（如有）；</p>
      <p>3、乙方在债权清收过程中不得未经甲方同意主动放弃债权；</p>
      <p>4、乙方应根据其制定的清收方案撰写相关报告，制定债权催收处置预案、建立债权处置工作档案等；</p>
      <p>5、甲方保证其所有的债权具有合法处分权，乙方保证其债权处置程序合法、严谨、有效，且实现债权价值的最大化；</p>
      <p>6、乙方须维护甲方对债务人的诉讼时效，因甲方原因导致诉讼权、执行权丧失的，乙方不承担责任。同时，乙方有权要求甲方提供与案情有关的证据材料，甲方必须给予协助。但乙方不得丧失、毁损甲方提供的证据资料；</p>
      <p>7、乙方承诺其应采取合法的手段进行清收，因采取不当的段所造成任何法律责任或民事纠纷，应当由乙方自行承担；</p>

      <h2>七、其它</h2>
      <p>1、本授权书未尽事宜，由甲乙双方友好协商另行签订相关补充协议；</p>
      <p>2、本协议一式【伍】份，甲乙双方各执【贰】份，其中留存一份作授权公证或备案；</p>

      <footer>
        <p><strong>委托方：</strong></p>
        <p><strong>日期：</strong></p>
        <p><strong>受托方：北京万峻投资咨询有限公司</strong></p>
        <p><strong>日期：</strong></p>
      </footer>
    </main>
    <main>
      <p style="text-indent: 0">附件一、</p>
      <h1 class="tc">授权委托书</h1>
      <div class="header">
        <div class="party-a">
          <p>
            <strong>委托人：出借人</strong>
          </p>
          <p>
            <strong>身份证号码：</strong>
          </p>
        </div>
        <div class="party-b">
          <p>
            <strong>受委托人：</strong>
          </p>
          <p>
            <strong>机构和职位：</strong>
          </p>
          <p>
            <strong>地址：</strong>
          </p>
        </div>
      </div>
      <main>
        <p>出借人<label class="underscore">&nbsp;</label>女士/先生现委托上述受委托人，在<strong
          class="underscore">借贷合同纠纷</strong>一案中，作为<label class="underscore">&nbsp;</label>女士/先生一审、二审诉讼阶段的代理人。</p>
        <p>代理人<label class="underscore">&nbsp;</label>的代理权限为特别授权，包括但不限于：</p>
        <p style="margin-top: 0">代为提交答辩状及证据材料；代为提起上诉；代为出庭应诉；代为参与调解、和解；代为取证、申请调取证据、申请延期开庭；代为签署、送达、接受法律文书。</p>
        <footer class="tr">
          <p><strong>委托人：出借人</strong></p>
          <p><strong>【 】年【】月【 】日</strong></p>
        </footer>
      </main>
    </main>
  </section>
</template>

<script>
export default {
  name: "TrustAgreement"
}
</script>

<style scoped lang="less">
.agreement {
  padding: 10px;
}

p {
  color: #666;
  margin: 10px auto;
  font-size: 12px;
  line-height: 1.5;
  text-indent: 24px;

  & + p {
    margin-top: 15px;
  }
}

.tr {
  text-align: right;
}

.tc {
  text-align: center;
}

.spacing {
  &::after {
    content: '';
    display: inline-block;
    width: 50px;
  }
}

.underscore {
  display: inline-block;
  border-bottom: 1px #000 solid;
  min-width: 100px;
  padding: 0 10px;
}

.header, footer {
  p {
    text-indent: 0;
    color: #000;
  }
}

.header {
  div + div {
    margin-top: 30px;
  }

  p {
    font-weight: bold;
    color: #000000;
  }
}

main {
  margin-top: 20px;

  & + main {
    margin-top: 40px;
  }
}
</style>
