export const Q_A = [
  {
    q: '原手机号无法使用，需更换手机号',
    a: [
      '1、请先准备好以下资料信息：客户姓名，新旧注册手机号，本人手持身份证（或外籍证件）人像面正面免冠合照；',
      '2、关注有解微信公众号：youjieguanwei；',
      '3、在公众号中发送上述资料信息和联系电话；',
      '4、客服收到您的资料后会与您电话联系进行身份核实；',
      '5、核实成功，新手机号会在3个工作日内更新。更新成功，我们会以短信形式告知，随后您可以使用新的手机号进行登录。',
      '6、更多帮助您可以拨打我们的客服电话。'
    ]
  },
  {
    q: '更换机构绑定的银行卡',
    a: [
      '1.请先准备好以下资料信息：身份证正面照片、反面照片、原银行卡号（非必须）、新的银行卡号（持卡人需您本人）、开户行；',
      '2、若您在身份验证时忘记卡号，请点击【忘记卡号】提交您的资料信息，提交后客服会与您电话联系进行身份核实，审核通过后会更新您的卡号并短信通知您；',
      '3、若您想更换您的银行卡，需您先解绑银行卡，解绑前需输入交易密码进行身份验证，通过后自动解绑，解绑后绑定新的银行卡，绑定前需输入交易密码进行身份验证，通过后填写银行卡信息，提交成功即可绑定成功；',
      '4、更多帮助您可以拨打我们的客服电话。'
    ]
  }
]
