export const DEBT_AGREEMENT_DEMO = `
  <h3>债权转让协议</h3>
  <p align="right">
  协议编码:_________	
  </p>
  <p>
  转让方（以下简称“甲方”）： 	_________	
  </p>
  <p>
  身份证（护照）号码： 	_________	
  </p>
  <p>
  受让方（以下简称“乙方”）： 	_________	
  </p>
  <p>
  身份证（护照）号码： 	_________	
  </p>

  <p>
  甲乙双方按照诚实信用原则，依据《中华人民共和国合同法》、《民法通则》、
  《中华人民共和国民事诉讼法》、《仲裁法》等相关法律法规规定，现经甲乙双方 平等自愿、协商一致，就甲方向乙方转让 <u><b>债权 </b></u> 事宜达成如下协议：
  </p>


  <h4>第一条 定义</h4>
  <p>本协议中以下术语具有如下含义：</p>
  <p>1.1 转让方：债权人与债务人签署基础合同后，现债权人将其债权对外转让。</p>
  <p>1.2 债务方：通过网贷平台申请借款并与转让人签署基础合同，对本协议约 定的债权标的负有偿还债权本金及利息的法人或自然人。</p>
  <p>1.3 债权标的（简称“债权”）：转让方对债务方享有的债权、主张及任何其它请求权和附属权利、转让方依据主债权享有的担保物权、任何其它权利和主张。</p>
  <p>1.4 基础合同：指转让方与债务方在原网贷平台签署的原始债权协议。<u><b>鉴于各网贷平台的业务模式不同，原始债权协议存在多种名称及表现形式，在本债权转让协议中均以“基础合同”进行指代。</b></u> </p>
  <p>1.5 担保合同：为顺利实现基础合同项下的债权而签署的抵押合同、质押合同或担保条款。鉴于各网贷平台的业务模式不同，担保合同存在多种名称或表现形式。<u><b>在本债权转让协议中，新受让的债权人依法继承担保合同的担保约定。担保合同里对债权转让行为有额外约定的，从其约定。</b></u></p>
  <p>1.6 先锋平台：作为新型互联网债权管理信息技术服务平台，其提供基础债权的申报及形式审核、债权对外转让的信息发布、撮合及交易记录备案等内容。<u><b>先锋平台不涉及债权交易资金支付，不对转让债权后续权利实现承担连带担保责任。</b></u> </p>
  <p>1.7 工作日：指中国的商业银行开展对公业务之日，不包括国家法定节假日及星期六、星期日。</p>
  <h4>第二条 转让债权标的</h4>
  <p>2.1 原合同编号：______</p>
  <p>2.2 项目名称：______</p>
  <p>2.3 转让债权本金：人民币______元整</p>
  <p>2.4 债权年化利率（365 天/年）：______每年</p>
  <p>2.5 债权认购时间：______</p>
  <p>2.6 项目到期日：______</p>
  <p>2.7 还款方式：______</p>
  <p>本协议下的转让标的内容由基础合同约定，详情参见原债权协议。基础合同作为本协议附件，由先锋平台提供数据保全服务。</p>
  <h4>第三条 债权转让价格及支付</h4>
  <p>3.1 乙方通过审核甲方提供的债权所有材料后，确认甲方的债权源自于基础合同和相关的补充协议【包括但不限于：担保合同、回购合同等】。因此，甲方合法享有基础合同项下的债权。</p>
  <p>3.2 债权转让的范围：包括但不限于基础合同、担保合同及其它补充协议项下前述转让数额对应的债权本金、利息、违约金等债务人依照合同约定应当向债权人承担的全部支付义务。</p>
  <p>3.3 债权转让的对价：（小写）¥ ______【大写 人民币 ______】。甲乙双方约定，本债权转让价格符合市场价以及债权转让的法律规定，不存在恶意报价、强迫交易、欺诈转让等情形。</p>
  <p>3.4 债权转让对价的支付方式：</p>
  <p>3.4.1 <u><b>根据法律法规及金融监管机构的要求，先锋平台仅作为债权转让交易撮合中介平台，无权参与甲乙双方资金交易行为，不代收、代付、存管、吸纳任何资金。</b></u></p>
  <p>3.4.2 当甲乙双方在先锋平台上达成债权转让合意后，乙方在线上完成下单行为，并按照协议约定的支付方式于线下向甲方完成债权转让对价的支付。<u><b>甲乙双方对交易资金的支付承担独立责任，先锋平台对此免责。因支付款项产生的纠纷，由甲乙双方自行协商或诉讼解决。先锋平台可提供中间调解服务。</b></u></p>
  <p>3.4.3 交易主体账户信息</p>
  <p>甲方收款账户信息：</p>
  <p>开户行【______】</p>
  <p>开户姓名【______】</p>
  <p>银行卡号【________________】</p>
  <p>乙方付款账户信息：</p>
  <p>开户行【______】</p>
  <p>开户姓名【______】</p>
  <p>银行卡号【________________】</p>
  <p>3.4.4 原则上乙方应当严格按照本协议约定的付款账户（即自己名下的账户）以向甲方支付款项。如若乙方委托他人代为支付款项的，乙方应当按照先锋平台规则向先锋平台上传支付账户的信息以及合法有效的转让凭证。<u><b>如若乙方未按照先锋平台的要求进行操作，由此带来的法律后果和纠纷由乙方承担全部责任。</b></u></p>
  <p>3.4.5 甲方在收到乙方线下支付的款项后，应按照先锋平台规则及时、审慎履行确认收款义务。如若甲方对乙方线下支付行为存在异议或未收到款项，应在【24】小时内向先锋平台提出异议，由先锋平台介入核实处理此纠纷。<u><b>一旦甲方点击确认收款，视为甲乙双方线下交易行为合法完成。由此产生的一切法律纠纷和后果由甲方独立承担。</b></u></p>
  <p>3.4.6 当甲乙双方在线下完成款项支付且甲方于线上点击确认收款后，先锋平台将协助甲乙双方于线上完成《债权转让协议》、《债权转让通知书》的签订（甲乙双方应保证签章的授权和签章真实性）。先锋平台应合法合理的保全甲乙双方线上签订的《债权转让协议》以保持协议作为证据的合法、真实、有效性。</p>
  <p>3.4.7 甲于线下收到债权转让款项后应在合理时间内当协助乙方完成债权转让的所有义务及其它附随义务。因甲方原因导致债权转让行为存在瑕疵或纠纷的，甲方应承担全部损害赔偿责任。</p>
  <h4>第四条 债权转让生效要件</h4>
  <p>4.1 本协议所约定的债权自本协议签字生效后转移，甲方债权所含的所有权利义务将一并转移至乙方，甲方债权消灭；乙方可依据《债权转让协议》向利害相关主体（债务人及担保人）主张权利。<u><b>先锋平台系独立第三方信息技术服务平台，乙方无权基于债权行为向其主张法律权利。此债权转让行为为单方行为，除法律规定的绝对无效是由外，此行为一经做出不可撤销。</b></u></p>
  <p>4.2 当甲乙双方均在先锋平台线上完成协议签章后，甲方权利义务消灭，甲方丧失对债务人以及担保人的追偿权利。<u><b>甲乙双方均不得因其与先锋平台的服务费支付行为而抗辩债权转让行为的效力。</b></u></p>
  <p>4.3 本债权转让行为的生效要件依托于基础债权的合法性。甲方应当保证本协议约定的转让债权真实、合法、可处分并提供相关证明资料；若乙方有证据证明（包含但不限于：法院判据、仲裁机构裁决等）基础债权违法或存在瑕疵，本债权转让行为不生效，乙方于线下支付的价款视为甲方的不当得利。<u><b>甲方应予以返还。因款项返还问题产生的法律纠纷由甲乙双方自行解决。</b></u></p>
  <h4>第五条 债权转让通知</h4>
  <p>5.1 甲方债权转让通知义务</p>
  <p>根据《合同法》第八十条对债权转让行为的规定，甲方作为债权转让人，应当自本协议签字生效后【5】日内通知债务人。甲方通知债务人的方式为以下三种： ①《债权转让书面通知书》纸质版邮寄； ②邮件通知；③短信通知。禁止甲方口头通知原债务人。因甲方原因延迟或未通知债务人，导致乙方权利受到损害的，甲方应当承担相关赔偿责任。</p>
  <p>5.2 债权转让通知留痕</p>
  <p>甲方应当做到债权转让通知留痕，并采取合理的方式保存通知痕迹。 甲方承诺当其与乙方、债务人因债权转让事宜产生纠纷时，甲方应就债权 转让通知行为进行举证。</p>
  <p>5.3 通知义务委托条款</p>
  <p><u><b>现甲方委托先锋平台代为向债务方履行通知义务，并对《债权转让通知书》进行公示，同时提供线上数据保全留存服务。</b></u></p>
  <p>5.4 债权转让通知效力</p>
  <p>本协议项下的债权转让自甲乙双方签字后生效。自甲方通知原债务人后，该转让行为对债务人发生效力。本协议约定的债权转让行为无须征得债务人的同意。因甲方原因未履行通知债务人的义务导致乙方权利受到损害的，甲方应当承担相关赔偿责任。</p>
  <h4>第六条 双方权利义务</h4>
  <p>6.1 甲乙双方均承诺：将严格按照先锋商城的规则、要求和程序完成其线下款项支付交易及线上协议签订和其他附随义务。甲乙双方将本着公平、公正、诚实、信用的原则主张其权利，履行其义务，严格遵循契约精神和原则。</p>
  <p>6.2 当甲乙双方履行完毕债权转让交易手续后，即乙方合法受让甲方债权后，根据本协议及相关法律规定，乙方有权将债权转让给第三人。</p>
  <p>6.3 甲乙双方于线上达成债权转让交易合意、线下完成债权转让款项支付、线上签署本协议并办理相关附随义务等行为均为各自真实意思表示并获得相关授权，不存在任何欺诈、强迫、趁人之危等情形。甲乙双方作为完全民事行为能力人应对其行为独立承担法律后果。</p>
  <p>6.4 乙方应严格、诚信、合法的按照合同约定的内容和方式于线下履行其支付义务。<u><b>甲方确认收款并于线上签订本协议后视为其受债权转让行为的约束，非法定原由导致协议无效的，甲乙双方任意一方均不得单方解除本协议。</b></u></p>
  <p>6.5 甲方承诺并保证其转让给乙方的标的债权同时符合以下条件：</p>
  <p>6.5.1 甲方对其拥有的债权是由一个合理合法的借贷关系产生的。</p>
  <p>6.5.2 甲方对其拥有的合法债权依法可以转让，该债权未被质押、设定信托、转让给任何第三方，没有任何权利瑕疵。</p>
  <p>6.5.3 甲方保证已将其知道或应当知道的、影响或可能影响乙方签署及履行本协议的事实向乙方进行了披露。</p>
  <p>6.5.4 甲方保证于本合同签署之前已将转让债权相关的协议、资料、凭证等文档上传至先锋平台，并可供乙方后续背调和使用。甲方保证其提供的文档真实有效，不存在任何篡改、隐匿、虚假情形。<u><b>若因甲方提供的资料存在瑕疵的，甲方对此产生的后果和法律纠纷承担全部责任。</b></u></p>
  <p>6.6 甲方将其债权放置在先锋平台上进行转让磋商，视为其对债权自身真实性的保证、对外转让意思的真实表意。甲方应为国家法律规定的完全民事行为能力主体，并对其行为负责。<u><b>先锋平台仅对甲方提供的债权资料进行形式审查，不进行实质性审查。乙方在确定受让甲方债权之前，应当对相关资料做真实性核查，并对确认结果承担法律责任。</b></u></p>
  <p>6.7 鉴于债权价值具有一定波动性，甲方的对外转让行为视为其对成交价格的承认，甲方不得以未来预期债权价值抗辩本债权转让行为的效力。<u><b>债权转让行为一经生效，不可撤销。</b></u></p>
  <p>6.8 本协议为单务债权转让协议，甲方仅对债权的真实性和有效性进行保证。当债权行为完成后，乙方成为新的债权人有权向债务人及担保人主张权利。<u><b>如若债务人或担保人产生违约行为，乙方不可向甲方以及先锋平台主张责任。</b></u></p>
  <p>6.9 甲乙双方作为债权转让的当事人，<u><b>因先锋平台网络安全、网络信息发布安全等问题对甲乙双方产生损害的，</b></u>甲乙任何一方均有权向先锋平台的运营主体主张损害赔偿责任。</p>
  <h4>第七条 违约责任</h4>
  <p>7.1 免责条款</p>
  <p>因受不可抗力影响而不能履行或不能完全履行本协议的，甲乙双方均可以部分或全部免除其履行责任。不可抗力是指在本协议签订后发生的，合同双方在合同签订时无法预见、无法避免并无法克服的客观情况。此等时间包括但不限于水灾、火灾、旱灾、台风、地震及其他自然灾害、罢工、骚动、暴乱及战争（不论宣战与否）以及政府部门的作为或不作为。<u><b>不可抗力发生后，甲乙双方须立即协商继续履行本协议之相关事宜，并签订补充协议。</b></u>补充协议的效力在该等不可抗力及其影响终止或清除时止。如不可抗力及其影响在发生一个月后仍未终止或消除，则甲乙双方可协商终止、变更、暂停履行本协议。</p>
  <p>7.2 违约损失责任</p>
  <p>7.2.1 甲乙双方中的任何一方违反在本协议中所约定的义务、责任、承诺以及其它条款均构成违约。因违约给另一方造成损失，违约方应承担赔偿守约方遭受的实际损失。</p>
  <p>7.2.2 因非本协议甲乙双方过错所造成的损失，双方应本着友好协商的基础，按照公平的原则分担损失，具体的损失承担方式由甲乙双方签订补充协议。</p>
  <p>7.2.3 因甲方原因无故延迟或拒绝在合理时间内履行确认收款义务、办理债权转让附随义务的，视为甲方违约，乙方有权按照本协议总金额【5‰/日】的比例向甲方主张违约滞纳金。经先锋平台通知、催促后【20】日内，甲方仍未履行确认收款义务、办理债权转让附随义务的，乙方有权在按照本协议总金额【20%】的比例向甲方主张违约金。</p>
  <h4>第八条 法律适用和争议解决</h4>
  <p>8.1 法律适用</p>
  <p>8.1.1 本合同及附件的订立、效力、解释、履行、争议的解决等适用本合同签订时有效的中华人民共和国法律、法规的有关规定。</p>
  <p>8.1.2 在本合同履行期间，因中国法律、法规、政策的变化致使本合同的部分条款相冲突、无效或失去可强制执行效力时，双方同意将密切合作，尽快修改本合同中相冲突或无效或失去强制执行效力的有关条款。</p>
  <p>8.1.3 本合同标题仅供查阅方便，并非对本合同的诠释或解释；本合同中以日表述的时间期限均指自然日，与银行业务相关的时间日期均指工作日。</p>
  <p>8.1.4 对本合同的任何解释均应以书面作出。</p>
  <p>8.2 争议解决</p>
  <p>8.2.1 当甲乙双方就线下款项支付问题存在争议时，双方应协商解决；协商不成时，双方应当首先将争议提交至先锋平台，由先锋平台向甲乙双方进行事实确认。甲乙双方授权并同意先锋平台可对解决纠纷过程中涉及的通话进行录音保存，并作为后续证据使用。先锋平台可依据确认的事实向甲乙双方做出调解。</p>
  <p>8.2.2 如若甲乙双方对先锋平台的调解结果不接受或有争议的，先锋平台则将冻结此笔交易，同时，甲乙双方应向<u><b> 合同签订地 </b></u>有管辖权的人民法院起诉。本协议的签订地为：<u><b>北京市海淀区 </b></u>。先锋平台将其在调解过程中掌握的协议、凭证、录音等资料成交法庭已做判决证据。</p>
  <h4>第九条 其它条款</h4>
  <p>9.1 甲乙双方均确认本协议的签订、生效和履行以不违反中国的法律法规为前提。如果本协议中的任何一条或多条违反适用的法律法规，则该条将被视为无效，但该无效条款并不影响本协议其他条款的效力。</p>
  <p>9.2 本合同所列的附件经双方签字后为本合同的组成部分。其它任何口头或未包含在本合同内的或未依据本合同制定的书面文件，双方应另行签订书面协议。</p>
  <p>9.3 本合同经双方签字后生效。本合同一式<u><b> 肆 </b></u>份，双方各持<u> <b> 贰 </b> </u>份，具有同等法律效力。本合同未尽事宜，甲乙双方应当友好协商，签订相关补充协议。补充协议以及本合同附件属于合同不可分割部分，与本协议具有同等法律效力。</p>
  <hr style="border: 2px solid color:#4a4a4a"/>

  <p>（以下无正文）</p>
  <p>甲方（签字）：________</p>
  <p>合同签署日期：___年__月__日</p>
  <p>乙方（签字）：________</p>
  <p>合同签署日期：___年__月__日</p>
`
