<template>
  <div class="agreement-content">
    <div class="mainBody">
      <div class="title">用户享受确权信息服务授权许可书</div>
      <p>
        用户享受确权信息服务授权许可书（以下简称“授权书”）是债权持有方（以下简称“用户”或“您”）接受有解债转信息平台信息服务平台（以下简称“有解债转信息平台”）提供的债权互联网管理信息技术服务（包括但不限于：用户债权确权服务、用户债权管理服务、用户债权交易服务、用户债权转消费服务等）签订的个人授权许可书。
      </p>
      <p>
        在本授权书中用户授权有解债转信息平台获取您在指定机构的个人相关数据信息以及授权有解债转信息平台协助您在本平台后续业务实操中签订其它协议或文书。
      </p>
      <p>
        1、用户在有解债转信息平台平台通过网络页面点击确认的方式接受本授权书，并同意接受本授权书的全部约定内容及有关的各项规则、操作流程、信息获取等内容。
      </p>
      <p>
        2、用户接受本授权书后，表示有解债转信息平台可与指定理财平台就用户的数据信息进行技术对接。有解债转信息平台可获取的信息数据应依托于用户登记提交的个人信息。有解债转信息平台不得私自获取其它未授权用户的信息，否则将承担相应的法律责任。
      </p>
      <p>
        3、用户授权有解债转信息平台获取的信息数据包含但不限于：<br />
        （1）用户个人信息（如：姓名、联系方式、电子邮箱等）；<br />
        （2）用户身份识别信息（如：身份证号码、护照号码、驾驶证号码等）；<br />
        （3）用户债权信息（如：理财平台账号、银行卡号、债权项目名称、债权总额、债权协议编号、债权还本付息方式等）。<br />
        （4）其它与有解债转信息平台业务有关的必要信息数据（数据范围不得超过有解债转信息平台向用户提供的业务范围）。
      </p>

      <p>
        4、有解债转信息平台依据用户授权获取的信息数据的使用范围仅限于提供服务的范围内。禁止有解债转信息平台私自泄露、利用、倒卖用户信息数据或实施与服务范围无关的经营行为。
      </p>
      <p>
        5、用户承诺并保证：上述授权行为是基于用户已充分了解授权书内容及产生的法律后果后，由用户本人所进行的自愿、合法的行为，不存在非本人所为、遭第三人仿冒、盗用之情形。用户将承担因授权行为产生的法律责任及后果。
      </p>
      <p>
        6、有解债转信息平台承诺并保证：在为用户提供债权确权、管理、消费、转让等服务之前，均已通过合法有效方式或手段与各服务业务板块经营主体达成有效合法的合作基础或取得充分授权（该授权范围能够满足有解债转信息平台为用户提供服务的合理使用范围）。
      </p>
      <p>
        7、有解债转信息平台和用户均承诺其提供的信息及相关资料符合中华人民共和国相关法律法规之规定，具备真实性与合法性且不侵犯任何第三方权益。
      </p>
      <p>
        8、有解债转信息平台依据您登记提交的信息在指定理财机构获取您的信息数据后将向您进行债权确权。您应当依据诚实信用的原则对您的个人债权信息数据进行确权。
      </p>
      <p>
        9、用户的确权行为系单方民事行为。用户债权信息一经确权不可撤销、更改。因客观原因（例如：系统原因、不可抗力等情况）导致用户确权结果存在错误的，用户应在24小时内与有解债转信息平台工作人员取得联系，并对此问题提供相关证据进行协商解决。因用户原因延迟解决产生的损害由用户独立承担。
      </p>
      <p>
        10、用户确权成功后，有解债转信息平台将依据确权后的债权信息数据提供服务。因您自身原因导致确认的债权存在错误致使有解债转信息平台提供的服务存在错误的，有解债转信息平台对此不承担任何责任，由用户承担。
      </p>
      <p>
        11、有解债转信息平台为了更好的向用户提供服务，您有义务按照有解债转信息平台的要求操作平台软件以及查收有解债转信息平台发出的指示信息，因您个人原因操作不当致使平台指令错误，由此产生的纠纷及法律责任由用户承担，有解债转信息平台对此免责。
      </p>
      <p>
        12、用户授权并同意：有解债转信息平台有权对本授权书内容进行单方面的变更，并在平台网站页面进行通知。若您在本授权书内容变更生效后继续使用本服务的，表示您已充分阅读、理解并接受变更修改后的授权书内容，也将遵循变更修改后的授权书内容；若您不同意变更修改后的授权书内容，您应立即停止使用本服务。
      </p>
      <p>
        13、用户应认真阅读、充分理解本授权书各条款及对有解债转信息平台具有或可能具有免责或限制责任的内容。如您不同意接受本授权书的任意内容，或者无法准确理解相关条款含义的，请您不要进行后续操作。
      </p>
      <p>14、本文件解释权归有解债转信息平台。若发生争议，应协商解决，解决不成可诉至北京市海淀区人民法院。</p>
      <p class="bottom">授权人：用户<br />被授权人：有解债转信息平台</p>
    </div>
  </div>
</template>

<script>
export default {
  name: 'CheckAgreement'
}
</script>

<style lang="less" scoped>
.agreement-content {
  height: 100%;
  position: relative;

  .mainBody {
    position: absolute;
    top: 0;
    left: 0;
    width: 100%;
    height: 100%;
    box-sizing: border-box;
    padding: 15px 24px 35px;
    overflow-y: auto;
  }
  .title {
    text-align: center;
    font-size: 16px;
    font-weight: 500;
  }
  p {
    font-size: 14px;
    color: #666;
    line-height: 1.5;
    padding-top: 15px;
    text-align: justify;
    &.bottom {
      text-align: right;
    }
  }

  &:after {
    content: '';
    position: absolute;
    z-index: 2;
    left: 0;
    bottom: 0;
    width: 100%;
    height: 35px;
    background: linear-gradient(180deg, hsla(0, 0%, 100%, 0), hsla(0, 0%, 100%, 0.8) 70%, #fff);
  }
}
</style>
