<template>
  <div class="dcfgvhbjn">
    <div class="top">注册协议及隐私保护政策</div>
    <div class="wrap">
      <div class="line">
        【审慎阅读】您在申请注册流程中点击同意前，应当认真阅读以下协议。请您务必审慎阅读、充分理解协议中相关条款内容，其中包括：
        <div class="line pl30">
          <p>1、与您约定免除或限制责任的条款；</p>
          <p>2、与您约定法律适用及争端解决的条款；</p>
          <p>3、其他以粗体下划线标识的重要条款。</p>
        </div>
      </div>
      <div class="c-title">《注册协议》</div>
      <div class="text pl30">
        <p>一、用户资格</p>
        <p>二、用户账户管理</p>
        <p>三、服务和费用</p>
        <p>四、您的资料</p>
        <p>五、进入和干扰</p>
        <p>六、欺诈</p>
        <p>七、违约</p>
        <p>八、用户个人信息保护</p>
        <p>九、不保证</p>
        <p>十、特别声明</p>
        <p>十一、补偿及责任免除</p>
        <p>十二、知识产权的保护</p>
        <p>十三、无代理关系</p>
        <p>十四、通知</p>
        <p>十五、协议的生效、修改、补充和终止</p>
        <p>十六、条款的解释、法律适用及争端解决</p>
      </div>
      <div class="c-title">《隐私权保护政策》</div>
      <div class="line text">
        【审慎阅读】您在申请注册流程中点击同意前，应当认真阅读以下协议。请您务必审慎阅读、充分理解协议中相关条款内容。
      </div>
      <div>
        先锋尊重并保护用户隐私。本政策将会向您阐明我们如何在为您提供服务的过程中收集、存储、使用、分享、转让、公开披露您的信息，以及如何为您提供访问、更新、控制等用户权利响应机制并保护您的个人信息，具体包括以下内容：
      </div>
      <div class="text pt15">
        <p>◆ 我们如何收集、获得您的信息</p>
        <p>◆ 我们如何使用Cookie和同类技术</p>
        <p>◆ 我们如何使用个人信息</p>
        <p>◆ 我们如何存储和保护个人信息</p>
        <p>◆ 我们如何分享个人信息</p>
        <p>◆ 个人信息的转让与公开披露</p>
        <p>◆ 我们如何保障您访问和控制自己的个人信息</p>
        <p>◆ 对第三方责任的声明</p>
        <p>◆ 本政策的适用和修订</p>
        <p>◆ 如何联系我们</p>
      </div>
      <div class="line pt15">
        <span class="text"
          >【特别提示】如果您在阅读协议的过程中，如果您不同意相关协议或其中任何条款约定，您应立即停止注册流程。如果您按照注册页面提示填写信息、阅读并同意协议且完成全部注册流程后，即表示您已充分阅读、理解并接受协议的全部内容。</span
        >
        <span
          >如果您按照注册页面提示填写信息、阅读并同意协议且完成全部注册流程后，即表示您已充分阅读、理解并接受协议的全部内容。</span
        >
      </div>
      <div class="line pt15">如您对协议有任何疑问，可向平台客服咨询。</div>
      <div class="c-title">《注册协议》</div>
      <div class>
        欢迎阅读先锋集团（UCF）注册协议（以下简称“本协议”），先锋旗下目前包括网信和网信普惠、工场微金各平台以下合称“平台”，运营方公司以下合称“本公司”，依据本协议为您提供服务。
      </div>
      <div class="text pt15">
        特别提醒：您成为平台用户前，必须阅读、同意并接受本协议中所含的所有条款和条件，包括以下明示载明的及因被提及而纳入的文件、条款和条件。
      </div>
      <p>
        您申请注册为平台用户，表明您已经充分阅读、理解并无任何附加条件地接受了本协议中含有的所有条款和条件，包括本协议及其所援引的其他文件的条款内容及其法律含义。
      </p>
      <div class="t-title">一、用户资格</div>
      <div>
        <p>1.1 您应当具有完全民事权利能力和民事行为能力，并能够独立承担民事责任。</p>
        <p>1.2 您不属于平台不提供用户服务的以下人群：</p>
        <div>
          <p>(1) 未满18周岁和超过70周岁的自然人；</p>
          <p>(2) 没有非保本类金融产品投资经历或不熟悉互联网的投资人。</p>
        </div>
      </div>
      <div class="t-title">二、用户账户管理</div>
      <div class="text">
        2.1您在平台的注册账户仅限本人使用，不得出借或转让。请妥善保管用户名、密码等账户信息，因其泄露或被盗用所产生的任何损失，都将由您自己承担。
      </div>
      <div class="text">
        2.2凡以您的注册账户登录实施的一切行为均视为您本人的行为，所产生的法律后果由您承担。您如发现存在账户被盗用或其他非法使用的情形，应立即以有效方式通知平台；同时，您理解平台对上述情形采取行动需要合理期限，在此之前，平台对因第三方冒用或盗用您账户名称和密码使用平台提供服务而导致的损失不承担任何责任。
      </div>
      <div class="text">
        2.3发生下列情形之一的，平台有权基于独立判断，不经通知而单方先行暂停、中断或终止向您提供相关服务，并不对因此产生的损失承担责任：
      </div>
      <p>
        （1）平台认为您提供的个人资料不具有真实性、有效性或完整性，包括但不限于盗用他人证件信息注册、认证信息不匹配等；
      </p>
      <p>（2）平台认为存在异常交易或交易可能涉嫌洗钱、套现、传销、恐怖活动等违法行为时；</p>
      <p>
        （3）平台发现您使用非法或不正当的技术手段进行危害交易安全或影响公平交易的行为，包括但不限于篡改交易数据、窃取客户信息、窃取交易数据、通过平台攻击其他用户等；
      </p>
      <p>（4）平台认为您的账户存在被盗用、冒用或其他风险时；</p>
      <p>（5）平台认为您已经违反本协议中规定的各类规则及精神；</p>
      <p>（6）平台为保障交易安全和公平而需要采取措施的其他情形。</p>
      <div class="text">
        2.4您在平台完成注册后，平台将长期保存您的账户和对应资料及信息，平台不会向您收取账户管理服务费。
      </div>
      <div class="text">
        2.5您同意并授权，当平台因战略调整需要系统升级改造、产品功能模块拆分或合并、运营主体变更及其他任何必要的调整时，可以将与您相关的数据（包括但不限于用户注册信息、用户个人信息、交易数据及其他相关资料）同步更新到调整后的门户网站、APP、客户端或其他关联应用上。您在使用此类应用时，可以用原有账户进行登录并操作。
      </div>
      <div class="text">2.6您在此确认并授权：在您通过平台进行交易过程中向平台提交的申请或指令，由先锋平台发出。</div>
      <div class="t-text">三、服务和费用</div>
      <div>3.1服务</div>
      <div>3.1.1先锋集团作为金融科技开放平台，为用户提供一站式综合金融信息中介服务。</div>
      <div class="text">3.1.2请您自行判断、确认平台上相关项目的风险，平台不对您及参与各方的交易承担任何责任。</div>
      <div>
        3.1.3第三方责任在任何情况下，对于您使用平台服务过程中涉及由银行等第三方提供服务的责任由该第三方承担，平台不承担责任。平台不承担责任的情形包括但不限于：
      </div>
      <p>（1）第三方未按照您或平台指令进行操作引起的损失或责任；</p>
      <p>（2）第三方原因导致资金未及时到账及与之相关的损失或责任；</p>
      <p>（3）第三方对交易限额或次数等的限制导致的损失或责任。</p>
      <div>3.2费用</div>
      <div>
        3.2.1
        <span class="text">您在平台的投资收益将采用截位法保留到小数点后两位</span
        >，平台暂不对使用平台服务的投资人收取费用。
      </div>
      <div>
        3.2.2尽管有前款约定，但平台保留在法律规定范围内按照运营战略自行发布通知调整收费标准及收费方式的权利。通知发布后，如您继续使用平台服务，视为您对该等通知内容予以认可并接受。
      </div>
      <div>3.3其他</div>
      <p>3.3.1您使用平台所提供服务过程中的其他支出（包括但不限于网络使用费、通信费、资料快递费等），由您自行承担。</p>
      <p>3.3.2您因使用平台所提供服务完成的交易而取得的收入，应当由您按照所适用法律规定承担相应的税费。</p>
      <div class="t-title">四、您的资料</div>
      <div>
        4.1您的资料包括：您在注册或登录过程中、在任何公共信息区域（包括留言栏或反馈区）或通过任何电邮形式或手机短信向平台或其他用户提供的任何资料。您对您的资料负全责，平台仅作为您在网上分发及公布您的资料的渠道。
      </div>
      <div>
        4.2您应根据平台的要求提供真实、有效及完整的资料。资料不得：具有欺诈性、虚假、不准确或具误导性；侵犯任何第三方著作权、专利权、商标权、商业秘密或其他专有权利或发表权或隐私权；违反任何适用的法律或法规；有侮辱或者诽谤他人，侵害他人合法权益的内容；有淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的内容；包含可能破坏、改变、删除、不利影响、秘密截取、未经授权而接触或征用任何系统、数据或个人资料的任何病毒、特洛依木马、蠕虫、定时炸弹、删除蝇、复活节彩蛋、间谍软件或其他电脑程序；直接或间接链接至您无权链接或列入的任何网址或者内容。
      </div>
      <div>
        4.3为使平台能够使用您向平台提交的资料，使平台不违反您可能在该资料中拥有的任何权利之目的，
        <span class="text"
          >您应同意向平台授予非独占、全球性、永久、不可撤销、免使用费、可分许可（通过多层许可的方式）的权利，以行使您在您的资料中（在任何已知或目前为未知媒体中）享有的与您的资料有关的相关权利。平台将根据隐私保护政策相关内容使用您的资料。</span
        >
      </div>
      <div>
        4.4您有义务维持并更新您的资料，确保其为真实、合法、有效及完整。若您提供任何错误、虚假、过时或不完整的资料，或者平台依其独立判断怀疑资料为错误、虚假、过时或不完整，平台有权拒绝您使用平台服务的部分或全部功能或采取其他处理措施。在此情况下，平台不承担任何责任，并且您同意负担因此所产生的直接或间接的任何支出或损失。
      </div>
      <div>
        4.5如因您未及时更新基本资料，导致平台服务无法提供或提供时发生错误，您不得将此作为取消交易的理由，平台亦不承担任何责任，所有后果应由您承担。
      </div>
      <div class="text">
        4.6除本协议以外，您应同时遵守平台不时发布及更新的全部规则，包括但不限于隐私保护政策、公告、产品流程说明、平台项目说明、风险提示等。
      </div>
      <div>4.7您同意平台应法律法规、行业监管等要求之目的，将您的相关信息在平台或其他渠道进行披露。</div>
      <div class="t-title">五、进入和干扰</div>
      <div>
        5.1未经平台明示或者书面准许，您不能为了任何目的使用任何机器人、爬虫软件、蜘蛛软件、刷屏软件或其他自动方式进入网站。
      </div>
      <div>5.2此外，您同意您将不会：</div>
      <p>（1）进行任何对平台内部结构造成或可能造成（按平台自行酌情确定）不合理或不合比例的重大负荷的行为；</p>
      <p>
        （2）未经平台和适当第三方（如适用）事先明示书面准许，对网站的任何内容（除您的资料以外）制作拷贝、进行复制、修改、制作衍生作品、分发或公开展示；
      </p>
      <p>（3）干扰或试图干扰网站的正常工作或网站上进行的任何活动；</p>
      <p>（4）越过平台可能用于防止或限制进入网站的机器人排除探头或其他形式。</p>
      <div class="t-title">六、欺诈</div>
      <div>
        您在使用平台服务的过程中不得从事欺诈行为。若平台有合理理由怀疑您参与了与平台有关的欺诈活动时，平台可单方酌情决定采取中止或终止您的账户等处理措施，并不对因此给您造成的损失承担任何责任。
      </div>
      <div class="t-title">七、违约</div>
      <div class="text">
        在不限制其它救济的前提下，如发生以下情形，平台可能限制您的活动，发出有关您的行为的警告、暂时中止、无限期地中止或终止您的用户资格及拒绝向您提供服务：
      </div>
      <p class="text">7.1您违反本协议或纳入本协议的文件；</p>
      <p class="text">7.2平台无法核验您向平台提供的资料或信息的真实性、合法性、有效性或完整性；</p>
      <p class="text">7.3您的行为可能对平台其他用户、平台合作方或平台造成损失或法律责任。</p>
      <div class="t-title">八、用户个人信息保护</div>
      <p class="text">
        8.1保护用户个人信息是平台的一项基本原则。平台将按照本协议及《先锋隐私权保护政策》的规定收集、使用、储存、披露和分享您的个人信息。本协议对个人信息保护规定的内容与上述《先锋隐私权保护政策》有相冲突的，及本协议对个人信息保护相关内容未作明确规定的，均应以《先锋隐私权保护政策》的内容为准。
      </p>
      <p class="text">
        8.2您在注册平台账号或使用服务的过程中，可能需要填写一些必要的信息。若您填写的信息不符合平台要求，则无法使用本服务或在使用过程中受到限制。
      </p>
      <p class="text">
        8.3平台尽量运用各种安全技术和程序建立完善的管理制度来尽可能保护您的个人信息，以免遭受未经授权的访问、使用或披露。
      </p>
      <p class="text">8.4平台不会将您的个人信息转移或披露给任何非关联的第三方，除非：</p>
      <p class="text">（1）相关法律法规或法院、政府机关要求；</p>
      <p class="text">（2）为完成合并、分立、收购或资产转让而转移；</p>
      <p class="text">（3）为提供您要求的服务所必需；</p>
      <p class="text">（4）经您或您的授权代表同意或授权；</p>
      <p class="text">（5）《先锋隐私权保护政策》所规定的其他情形。</p>
      <p class="text">8.5本条约定具有独立性，不受本协议及其他条款生效与否或效力变化的影响。</p>
      <div class="t-title">九、不保证</div>
      <p>9.1平台对于向用户提供的服务不提供任何形式的承诺或保证，无论该等保证或承诺是明示、默示或法定的。</p>
      <p>9.2平台上合作单位所提供的服务品质及内容由该合作单位自行负责。</p>
      <p class="text">
        9.3平台不就持续地、不受影响地或安全地接触并接受平台服务作出担保，且平台网站的经营可能受平台无法控制的多种外部因素影响。
      </p>
      <div class="t-text">十、特别声明</div>
      <p>10.1平台并不介入您与其他用户之间的交易，对此，您充分理解并认可。</p>
      <p class="text">
        10.2您同意就您自身行为之合法性单独承担责任。您同意，平台和平台的所有关联公司和相关实体对平台用户的行为的合法性及产生的任何结果不承担责任。
      </p>
      <p class="text">
        10.3您同意并接受为向您提供更有针对性的服务，平台可以发送有关服务状态的各项通知，或发送短信、彩信、微信、微博、信件、电话和电子邮件等形式的营销广告。您亦可联系平台取消、退订前述信息推送服务。
      </p>
      <p>10.4您使用平台的服务及因此所进行的交易，应当遵守所有适用的国内及国际法律、法令、条例和法规。</p>
      <div class="t-title">十一、补偿及责任免除</div>
      <div>
        11.1就任何第三方提出的，由于您违反本协议或纳入本协议的条款和规则或您违反任何法律或侵犯第三方的权利而产生或引起的任一种类和性质的任何索赔、要求、诉讼、损失和损害（包括直接或间接的），无论是已知或未知的（包括合理的律师费），您同意就此对平台和（如适用）平台的母公司、子公司、关联公司、合作伙伴、高级职员、董事、代理人和雇员进行补偿并使其免受损害。
      </div>
      <div class="text">
        11.2您同意，基于互联网的特殊性，系统可能会因相关状况无法正常运作，从而使您无法使用任何平台服务或受到不利影响，平台就此对您或第三方不负任何责任，前述状况包括但不限于：
      </div>
      <p class="text">（1）平台系统停机维护期间；</p>
      <p class="text">（2）电信设备出现故障不能进行数据传输的；</p>
      <p class="text">
        （3）由于黑客攻击、网络供应商技术调整或故障、网站升级、银行方面的问题等原因而造成的本平台服务中断或延迟；
      </p>
      <p class="text">
        （4）因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成平台系统障碍不能执行业务的。
      </p>
      <div class="t-title">十二、知识产权的保护</div>
      <div>
        12.1平台上所有内容，包括但不限于著作、图片、档案、资讯、资料、平台架构、平台画面的安排、网页设计，均由平台或其他权利人依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。
      </div>
      <div>
        12.2非经平台或其他权利人书面同意，任何人不得擅自下载、使用、修改、复制、公开传播、改变、散布、发行或公开发表平台程序或内容；不得对平台或对平台的内容进行系统获取以直接或间接创建或编辑文集、汇编、数据库或人名地址录（无论是否通过Robots、Spiders、自动仪器或手工操作）；不得对平台内容进行转售或商业利用；不得收集和利用产品目录、说明和价格；不得用frame或运用frame技巧把平台或其关联公司的商标、标识或其他专有信息（包括图像、文字、网页设计或形式）据为己有；不得以MetaTags或任何其他"隐藏文本"方式使用平台或其关联公司的名字和商标。
      </div>
      <div class="t-title">十三、无代理关系</div>
      <div>
        用户和平台是独立的合同方，本协议无意建立也没有创立任何代理、合伙、合营、雇员与雇主或特许经营关系。平台也不对任何用户及其网上交易行为做出明示或默许的推荐、承诺或担保。上述性质不因任何事由而改变。
      </div>
      <div class="t-title">十四、通知</div>
      <div>
        平台对于您的通知及任何其他的协议、告示或其他关于您使用平台账户及服务的通知，您同意平台可通过平台公告、站内信、电子邮件、手机短信、微信、无线通讯装置等电子方式或邮寄等物理方式进行，该等通知于发送之日视为已送达收件人（如以邮寄方式向您发出通知的，则在该等通知按照您在平台留存的联系地址交邮后的第三个自然日即视为送达）。因不可归责于平台的原因（包括但不限于电子邮件地址、手机号码、联系地址等不准确或无效、信息传输故障等）导致您未在前述通知视为送达之日收到该等通知的，平台不承担任何责任。
      </div>
      <div class="t-title">十五、协议的生效、修改、补充和终止</div>
      <p class="text">
        15.1在本协议履行过程中，平台可根据情况对本协议进行修改。一旦本协议的内容发生变动，将通过平台公告的方式通知您，该等变动自公告发布之日起生效。
      </p>
      <p class="text">
        15.2若您对于该等修改和补充不予接受的，您应当立即停止使用平台的服务，而平台亦有权终止您的用户资格。如果您继续使用平台服务，则视为您接受平台对本协议所做的修改，并应遵照修改后的协议执行。
      </p>
      <p>15.3本协议在您提交注册为平台用户的申请获得审核通过时生效。</p>
      <p>
        15.4本协议自您注销您的用户账户的申请被平台审核通过之日，或者平台依据本协议及本协议所纳入或被提及的文件、条款和条件终止您的用户资格之日终止。
      </p>
      <div class="t-title">十六、条款的解释、法律适用及争端解决</div>
      <p class="text">16.1本协议及其修订的有效性、履行与本协议及其修订效力有关的所有方面均受中华人民共和国法律管辖。</p>
      <p class="text">
        16.2因本协议所引起的您与平台的任何纠纷或争议，首先应友好协商解决，如协商不能解决，均应提交北京市朝阳区人民法院诉讼解决。
      </p>
      <p>
        16.3本协议的规定是可分割的，如本协议任何规定被裁定为无效或不可执行，在此情况下，本协议的其他条款仍然完全有效并具有约束力。
      </p>
      <p>16.4平台未就您或其他方的违约采取行动并不等于平台放弃就随后或类似的违约采取行动的权利。</p>
      <div class="c-title">《先锋隐私权保护政策》</div>
      <div class="text">欢迎阅读《先锋隐私权保护政策》（下称“本政策”）！</div>
      <div class="text">
        先锋（在本政策中，指北京经讯时代科技有限公司及/或其关联方，以下或称“我们”）尊重并保护用户隐私。本政策将会向您阐明我们如何在为您提供服务的过程中收集、存储、使用、分享、转让、公开披露您的信息，以及如何为您提供访问、更新、控制等用户权利响应机制并保护您的个人信息，具体包括以下内容：
      </div>
      <p>◆ 我们如何收集、获得您的信息</p>
      <p>◆ 我们如何使用Cookie和同类技术</p>
      <p>◆ 我们如何使用个人信息</p>
      <p>◆ 我们如何存储和保护个人信息</p>
      <p>◆ 我们如何分享个人信息</p>
      <p>◆ 个人信息的转让与公开披露</p>
      <p>◆ 我们如何保障您访问和控制自己的个人信息</p>
      <p>◆ 对第三方责任的声明</p>
      <p>◆ 本政策的适用和修订</p>
      <p>◆ 如何联系我们</p>
      <p class="text">特别提示</p>
      <p>
        我们收集、存储、使用、分享您的信息，旨在依法合规地向您提供优质的服务，并通过诸如开发新服务、优化迭代既有服务功能、引入合作伙伴为您提供新的产品与服务等方式，持续提升服务质量及用户体验。
        <span class="text"
          >您有权不向我们提供本政策中列明的信息，但在许多情况下，如果您选择不提供，我们可能无法为您提供账户注册功能或者您有意获取的服务，或者无法达到既定的服务质量。</span
        >若您选择提供您的相关信息，您可享受更优质、更便捷的服务，我们方有条件在必要、合法的范围内利用您的信息更好地保护您的账户及资金安全，避免因无法及时与您取得联系而产生对您不利影响，避免因无法进行必要的合作、评估而给您使用服务带来不便等。
      </p>
      <div class="text">
        本政策与您使用我们服务关系紧密，我们建议您仔细阅读并理解本政策全部内容，做出您认为适当的选择。我们努力用通俗易懂、简明扼要的文字表达，并对本政策中与您的权益有重大关系的条款，采用粗体字进行标注，以提示您注意。
      </div>
      <div class="text">◆ 我们如何收集、获得您的信息</div>
      <div class="text">我们会通过如下渠道获取您的个人信息：</div>
      <p class="text">1.您直接提供的信息</p>
      <p class="text">
        1.1我们可能收集并存储您在使用我们的服务时向我们提供的任何信息，包括您在我们页面中在线填写信息时、参与网络社区讨论时、解决争议或就先锋服务与我们联系时所提供的信息，或授权我们向合法存有您信息的第三方收集您的个人信息，以及您在使用我们服务过程中产生的关于您的交易和活动的信息。上述信息，视适用场景不同,可能包括您的有效身份证件、联系方式、从事职业、通讯地址、姓名、地址、电话号码和电子邮件、生物特征信息中的一项或多项等；此外，如果您使用的我们的服务需与您的银行卡/银行账户或其他支付工具的账户进行相互验证或关联等操作方能实现的，您还需向我们提供完成此类操作所需的必要信息，如银行卡信息等。为便于您查询您的交易状态或历史记录，也为了遵守法律法规及监管规定，我们会保存您使用我们服务时产生或提交的信息，我们会在向您提供服务所必须的期限或法律法规要求的期限内，对您的信息进行妥善保管。如果您不使用我们的某些服务，您可以选择不向我们提供相关信息。
      </p>
      <p class="text">2.我们主动收集的信息</p>
      <p>
        <span class="text"
          >2.1在您使用先锋网站、公众号、移动应用（APP）及相关服务过程中，为了保障您的资金安全、个人信息安全，当您访问我们的网站、我们的移动设备客户端或使用我们提供的服务时，我们可能会收集您的计算机、手机及其他访问设备发送给我们的信息，如记录您使用的服务类别和方式、使用服务时的操作相关信息，诸如您的IP地址、移动设备所使用的版本和设备识别码、设备标识符、您的位置以及其他与我们服务相关的日志信息。除上述信息外，我们还可能为了提供服务及改进服务质量的合理需要而收集您的其他信息，如您与我们的客户服务团队联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息，您参加各种营销回馈活动时提交的信息，以及有关您曾使用的APP和其他软件的信息。与此同时，为提高您使用我们提供的服务的安全性，更准确地预防钓鱼网站、欺诈和木马病毒，我们可能会通过了解一些您的网络使用习惯、您常用的软件信息等手段来判断风险，并可能会记录一些我们认为有风险的URL、APP或软件。</span
        >但如果您不提供这些信息，将不会影响使用我们服务的基本功能，但可能影响您享受这些服务的质量和信息安全。
      </p>
      <p class="text">3.我们从其他来源取得的信息</p>
      <p>
        <span class="text"
          >3.1为了更好地向您提供服务，防范您使用我们相关服务产生的风险或评估违约责任，您授权我们向先锋关联公司及合作伙伴、信用机构、数据服务机构及依法成立并合法留存您的相关信息的第三方机构查询或采集您的相关信息，如信用评分、信用报告、能够联系到您的地址、电子邮件、电话号码等。</span
        >例如，自其他平台等获得您购买的商品或服务的名称、金额、收货地址等信息，以及您出行费用的付款记录等，以便先锋或其合作机构评估您是否满足先锋向您提供服务的标准。
      </p>
      <div>
        3.2为满足您的融资需求，
        <span class="text">我们可能需要对您使用我们服务时产生或提交的个人信息进行加工、分析等处理，</span
        >从而判断或协助合作机构判断是否向您提供服务。
      </div>
      <div class="text">
        3.3我们可能从第三方获取您授权共享的账户信息，并在您同意本政策后通过第三方账户直接登录并使用我们的服务。我们将会依据与第三方的约定、对个人信息来源的合法性进行确认后，在符合相关法律和法规规定的前提下，使用您的这些个人信息。
      </div>
      <div class="text">4.我们依法直接获取的信息</div>
      <div class="text">您充分知晓，以下情形中，我们收集、使用、共享个人信息无需征得您授权同意：</div>
      <div class="text">4.1与国家安全、国防安全有关的；</div>
      <div class="text">4.2与公共安全、公共卫生、重大公共利益有关的；</div>
      <div class="text">4.3与犯罪侦查、起诉、审判和判决执行等有关的；</div>
      <div class="text">4.4出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</div>
      <div class="text">4.5所收集的个人信息是您自行向社会公众公开的；</div>
      <div class="text">4.6从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；</div>
      <div class="text">4.7根据您的要求签订合同所必需的；</div>
      <div class="text">4.8用于维护所提供的服务的安全稳定运行所必需的，例如发现、处置服务的故障；</div>
      <div class="text">
        4.9学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
      </div>
      <div class="text">4.10法律法规规定的其他情形。</div>
      <div class="text">◆ 我们如何使用Cookie和同类技术</div>
      <div class="text">1.Cookie的使用</div>
      <div>
        <span class="text"
          >1.1为使您获得更轻松的访问体验，您访问我们的网站或使用我们提供的服务时，我们可能会通过小型数据文件识别您的身份，这么做可帮您省去重复输入注册信息的步骤，或者帮助判断您的账户安全。这些数据文件可能是Cookie，FlashCookie，或您的浏览器或关联应用程序提供的其他本地存储（统称“Cookie”）。</span
        >请您理解，我们的某些服务只能通过使用Cookie才可得到实现。如果您的浏览器或浏览器附加服务允许，您可以修改对Cookie的接受程度或者拒绝我们的Cookie。多数浏览器上工具条中的帮助部分会告诉您怎样防止您的浏览器接受新的Cookies，怎样让您的浏览器在您收到一条新Cookies时通知您或者怎样彻底关闭Cookies。此外，您可以通过改变浏览器附加程序的设置，或通过访问提供商的网页，来关闭或删除浏览器附加程序使用的类似数据（诸如FlashCookies）。
        <span class="text">但前述操作在某些情况下可能会影响您安全访问我们的网站和使用我们提供的服务。</span>
      </div>
      <div class="text">2.网络Beacon和同类技术的使用</div>
      <div class="text">
        2.1我们网站上还可能包含一些电子图象（称为“单像素GIF文件”或“网络Beacon”），使用网络Beacon可以帮助网站计算浏览网页的用户或访问某些Cookie，我们会通过网络Beacon收集您浏览网页活动的信息，例如您访问的页面地址、您先前访问的援引页面的位置、您的浏览环境以及显示设定。我们可能通过在先锋的网站上使用网络Beacon，计算用户访问数量、停留时间，并通过访问Cookies辨认注册的先锋用户，或为您提供个性化的服务。
      </div>
      <div class="text">
        2.2为使您获得更安全的访问体验，如您通过我们的网站或客户端，使用了由第三方而非我们提供的服务时，我们无法保证这些第三方主体会按照我们的要求采取保护措施，为尽力确保您的账号安全，我们可能会使用专用的网络协议及代理技术（称为“专用网络通道”、“网络代理”）。使用专用网络通道，可以帮助您识别到我们已知的高风险站点，减少由此引起的钓鱼、账号泄露等风险，同时更有利于保障您和第三方的共同权益，阻止不法分子篡改您和第三方期望的服务内容，例如不安全路由器、非法基站等引起的广告注入、非法内容篡改等。在此过程中，我们也可能会获得和保存关于您计算机的相关信息，比如IP地址、硬件ID等。
      </div>
      <div class="text">◆ 我们如何使用个人信息</div>
      <div class="text">1.用途及目的</div>
      <div>
        我们收集您信息的目的主要是为了向您提供安全、高效以及个性化的服务体验。我们会出于以下目的使用您的个人信息：
      </div>
      <div>
        <span class="text"
          >1.1实名制管理。您在使用先锋服务时我们需要首先认证您身份的真实性，为此您需要提供您的身份信息、银行卡信息及手机号。</span
        >我们会将上述信息提交给合法持有您上述信息的第三方身份验证机构，以便对您所提供信息的准确性进行核对。如果您不提供上述信息则无法使用根据中国相关法律法规必须进行实名制管理的相关服务，例如：支付、投资、消费等。
      </div>
      <div>
        <span class="text">1.2资信评估。</span>您在使用先锋服务时，
        <span class="text"
          >我们会使用您的个人基本信息、个人身份信息、个人财产信息、个人交易信息及其他在具体业务开展过程中基于您的同意而采集的信息进行或配合合作机构进行风险管理及控制，检测、预防及/或修复欺诈或其他潜在的非法活动。</span
        >同时，在您享受先锋服务的过程中，我们会持续性的利用上述信息检测、防止或纠正违反相关法律法规或适用的用户协议的行为。
      </div>
      <div>
        <span class="text"
          >1.3向您提供先锋服务。在您使用先锋相关服务时，我们会使用您的个人身份信息、个人财产信息、个人交易信息及其他在业务具体开展过程中基于您的同意而采集的信息对我们服务进行适用性评估、验证交易真实性、处理服务请求以及完成交易指令并向您发送交易通知等。</span
        >同时，为了遵守相关法律法规及监管规定，也为了便于您查询交易记录或历史状态，我们会将您使用先锋时的身份信息、交易信息及行为信息进行存档，并严格按照法律法规的规定对这些信息进行妥善保管。
      </div>
      <div>
        <span class="text">1.4提供客户服务及进行投诉处理。我们的客服系统或客服人员会使用您的账号信息和交易信息。</span
        >为保证您的账号安全，我们的呼叫中心客服和在线客服会使用您的账号信息与您核验您的身份。当您需要我们提供与您交易信息相关的客户服务时，我们将会查询您的交易信息。为了保证您及他人的合法权益，如您被他人投诉或投诉他人，我们会将您的姓名及身份证号码、投诉相关内容提供给消费者权益保护部门及监管机关，以便及时解决投诉纠纷，但法律法规明确禁止提供的除外。
      </div>
      <div>
        <span class="text"
          >1.5改进服务与个性化服务。我们可能会收集您的交易信息、浏览信息、您的关注信息进行数据分析以形成用户画像，用来将您感兴趣的产品或服务信息展示给您。</span
        >我们还可能为了提供服务及改进服务质量的合理需要而获得的您的其他信息，包括您与客服联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息，您参与先锋线上营销、线下沙龙或论坛等活动时提交的信息。对于从您的各种设备上收集到的信息，我们可能会将它们进行关联，以便我们能在这些设备上为您提供一致的服务。我们可能会将来自某项服务的信息与来自其他服务的信息结合起来进行分析、加工，以便为您提供服务、个性化内容和建议。
      </div>
      <div>
        <span class="text">1.6保障交易安全所必须的功能。</span
        >为提高您使用我们的服务时系统的安全性，更准确地预防钓鱼网站欺诈和保护账户安全，
        <span class="text"
          >我们可能会通过了解您的浏览信息、交易信息、您常用的软件信息、设备信息等手段来判断您的账号风险，</span
        >并可能会记录一些我们认为有风险的链接（“URL”）；我们也会收集您的设备信息对于先锋系统问题进行分析、统计流量并排查可能存在的风险、在您选择向我们发送异常信息时予以排查。
      </div>
      <div class="text">
        1.7开展营销活动。您有权获得关于我们或合作方的产品或服务信息，我们会将这些商业类信息通过短信、邮件、电话或其他呈现方式推送给您。如果您不想接收此类信息，可以通过联系先锋客服电话、电子邮箱或使用先锋提供的其他退订功能予以取消。同时，未经您明确同意，我们不会出于满足第三方的营销目的而将您的个人信息出售或出租给任何第三方。
      </div>
      <div class="text">1.8其他依法开展的活动。</div>
      <div class="text">2.信息使用规则</div>
      <p>2.1我们会根据本政策的约定并为实现我们的服务功能对所收集的个人信息进行使用。</p>
      <div>
        2.2在收集您的个人信息后，我们将通过技术手段对数据进行去标识化处理，去标识化处理的信息将无法识别主体。
        <span class="text"
          >请您了解并同意，在此情况下我们有权使用已经去标识化的信息；并在不透露您个人信息的前提下，我们有权对用户数据库进行分析并予以商业化的利用。</span
        >
      </div>
      <div class="text">
        2.3请您注意，您在使用我们的服务时所提供的所有个人信息，除非您删除或通过系统设置拒绝我们收集，否则将在您使用我们的服务期间持续授权我们使用。
      </div>
      <p>
        2.4我们会对我们的服务使用情况进行统计，并可能会与公众或第三方共享这些统计信息，以展示我们的服务的整体使用趋势。但这些统计信息不包含您的任何身份识别信息。
      </p>
      <p>2.5.当我们展示您的个人信息时，我们会采用包括内容替换、匿名处理方式对您的信息进行脱敏，以保护您的信息安全。</p>
      <div class="text">
        2.6当我们要将基于特定用途收集而来的信息，超出与原有用途直接或合理关联的范围用于其他目的时，会事先征求您的同意。
      </div>
      <div class="text">◆ 我们如何存储和保护个人信息</div>
      <p>
        1.我们将在中华人民共和国境内收集的个人信息存储在中华人民共和国境内。如为处理跨境业务，且需要向境外传输您的个人信息完成交易的，我们会按照法律法规和相关监管部门的规定执行，并要求接收方按照我们的说明、本政策以及其他任何相关的保密和安全措施来处理这些个人信息。
      </p>
      <p>
        2.如果我们终止服务或运营，我们会至少提前三十日通知您，并在终止服务或运营后对您的个人信息进行删除或匿名化处理。
      </p>
      <p>3.我们将采取一切合理可行的措施，保护您的个人信息：</p>
      <p>
        3.1数据安全技术措施。我们会采用加密存储、加密传输、脱敏展示等符合业界标准的安全防护措施以及行业内通行的安全技术来防止您的个人信息遭到未经授权的访问、修改,避免您的个人信息泄露、损坏或丢失。
      </p>
      <p>
        3.2数据安全内部控制。我们通过设置数据访问权限和多重身份认证、数据分类分级、数据访问日志分析、数据安全管理规范、安全开发规范等制度和流程来规范个人信息的存储、访问和使用；我们指定特定部门和机构以及专人负责个人信息安全事务，并通过举办安全和隐私保护培训，加强全员对于保护个人信息重要性的认识。
      </p>
      <p>
        3.3为应对个人信息泄露、损毁和丢失等可能出现的风险，我们制定了多项制度，明确安全事件、安全漏洞的分类分级标准及相应的处理流程以及合理的应急预案。一旦发生个人信息安全事件，我们将按照法律法规的要求，及时向您告知安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们同时将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，
        <span class="text">难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。</span
        >同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
      </p>
      <p class="text">◆ 我们如何分享个人信息</p>
      <p>
        我们承诺对您的信息进行保密。
        <span class="text"
          >除本政策另有约定外，仅在下列情形下与第三方分享您必要的信息，同时我们将努力督促第三方在使用您的个人信息时遵守法律法规及我们要求其遵守的其他适当的保密义务和采取必要的安全措施：</span
        >
      </p>
      <p class="text">1.向您提供我们的服务。</p>
      <p class="text">2.实现“我们如何使用个人信息”部分所述目的。</p>
      <p class="text">
        3.如果您参与抽奖、竞赛或类似的推广活动，我们会将您提供的信息用于管理此类活动。若该活动是和第三方联合推广的，我们可能与其分享活动过程中产生的、为完成活动所必要的个人信息，如参加活动的用户数、中奖名单、中奖人联系方式等，以便第三方能及时向您发放奖品或为您提供服务。
      </p>
      <p class="text">
        4.为遵守适用的法律法规及监管规定、维护社会公共利益，或保护我们的客户、我们各公司或雇员的人身和财产安全或合法权益所合理必需的用途。
      </p>
      <p class="text">
        5.根据法律规定及合理商业习惯，在我们计划与其他公司合并或被其收购或进行其他资本市场活动（如IPO，债券发行等）时，以及其他情形下我们需要接受来自其他主体的尽职调查时，我们可能需要把您的信息提供给必要的主体，但我们会通过和这些主体签署保密协议等方式要求其对您的个人信息采取合理的保密措施，并要求其在完成必要工作后在合理的期限内删除您的信息。
      </p>
      <p class="text">
        6.在您发起的跨境交易中，在符合适用的法律法规及监管规定的前提下，向境外相关主体提供完成该交易所需的信息。
      </p>
      <p class="text">◆ 个人信息的转让与公开披露</p>
      <p class="text">1.个人信息的转让</p>
      <p class="text">我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：</p>
      <p class="text">1.1事先获得您明确的同意或授权；</p>
      <p class="text">1.2根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况进行提供；</p>
      <p class="text">
        1.3符合与您签署的相关协议（包括在线签署的电子协议以及相应的平台规则）或其他的法律文件约定所提供；
      </p>
      <p class="text">
        1.4在涉及合并、收购、资产转让或类似的交易时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本政策的约束，否则,我们将要求该公司、组织重新向您征求授权同意。
      </p>
      <p class="text">2.个人信息的公开披露</p>
      <p class="text">我们仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，才会公开披露您的个人信息：</p>
      <p class="text">2.1根据您的需求，在您明确同意的披露方式下披露您所指定的个人信息；</p>
      <p class="text">
        2.2根据法律、法规的要求、强制性的行政执法或司法要求所必须提供您个人信息的情况下，我们可能会依据所要求的个人信息类型和披露方式公开披露您的个人信息。在符合法律法规的前提下，当我们收到上述披露信息的请求时，我们会要求必须出具与之相应的法律文件，如传票或调查函。
      </p>
      <p class="text">◆ 我们如何保障您访问和控制自己的信息</p>
      <p>
        1.我们将采取适当的技术手段，保障您可以查询、更新和更正您的注册信息或使用我们服务时向我们提供的其他个人信息。
      </p>
      <p>2.在以下情形中，您可以向我们提出删除个人信息的请求：</p>
      <p>2.1如果我们处理个人信息的行为违反法律法规；</p>
      <p>2.2如果我们收集、使用您的个人信息，却未征得您的同意；</p>
      <p>2.3如果我们处理个人信息的行为违反了与您的约定；</p>
      <p>2.4如果您注销了先锋账户；</p>
      <p>2.5如果我们终止服务及运营。</p>
      <p>若我们决定响应您的删除请求，我们会根据您的要求及相关法律法规的要求进行后续删除处理并向您进行结果反馈。</p>
      <p>
        3.如您发现我们采集、储存的您的个人信息有错误的，您可以联系我们的客服电话要求更正。
        <span class="text"
          >对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情况收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。</span
        >
      </p>
      <p>
        4.您可以通过删除信息、关闭设备功能、在先锋客户端或网页软件中进行设置等方式改变部分您授权我们继续收集个人信息的范围或撤回您的授权。您也可以通过注销账户的方式，撤回我们继续收集您个人信息的全部授权。
        <span class="text"
          >请您理解，每个业务功能需要一些基本的个人信息才能得以完成，当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的服务，也不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响此前基于您的授权而开展的个人信息处理。</span
        >
      </p>
      <div class="text">
        5.响应您的上述请求：为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份，然后我们再处理您的请求。
      </div>
      <div class="text">
        6.尽管有上述约定，但在以下情形中，按照法律法规或监管政策要求，我们将无法响应您的请求：与国家安全、国防安全有关的；与公共安全、公共卫生、重大公共利益有关的；与犯罪侦查、起诉和审判等有关的；有充分证据表明您存在主观恶意或滥用权利的；响应您的请求将导致其他个人、组织的合法权益受到严重损害的。
      </div>
      <div class="text">◆ 对第三方责任的声明</div>
      <div class="text">
        请您注意，您的交易相对方、您访问的第三方网站经营者、通过我们接入的第三方服务和从我们处接收您的个人信息的第三方可能有自己的隐私权保护政策；当您查看第三方创建的网页或使用第三方开发的应用程序时，这些第三方可能会放置他们自己的Cookie或像素标签，这些Cookie或标签不受我们的控制，且它们的使用不受本政策的约束。我们会尽商业上的合理努力去要求这些主体对您的个人信息采取保护措施，但我们无法保证这些主体一定会按照我们的要求采取保护措施，请您与他们直接联系以获得关于他们的隐私保护政策的详细情况。如果您发现这些第三方创建的网页或第三方开发的应用程序存在风险时，建议您终止相关操作以保护您的合法权益。
      </div>
      <div class="text">◆ 本政策的适用及修订</div>
      <div>
        1.为给您提供更好的服务以及随着先锋业务的发展，本政策也会随之更新。但未经您明确同意，我们不会削减您依据本政策所应享有的权利。
        <span class="text"
          >我们会通过在先锋网站、先锋移动端上发出更新版本并在生效前通过网站公告或以其他适当方式提醒您相关内容的更新，也请您访问先锋以便及时了解最新的隐私政策。</span
        >
      </div>
      <div>
        2.对于重大变更，我们还会提供更为显著的通知（我们会通过包括但不限于邮件、短信或在浏览页面做特别提示等方式，说明隐私政策的具体变更内容）。本政策所指的重大变更包括但不限于：
      </div>
      <div>2.1我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；</div>
      <div>2.2我们在所有权结构、组织架构等方面发生重大变化。如业务调整、并购重组等引起的所有者变更等；</div>
      <div>2.3个人信息共享、转让或公开披露的主要对象发生变化；</div>
      <div>2.4您参与个人信息处理方面的权利及其行使方式发生重大变化；</div>
      <div>2.5我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；</div>
      <div>2.6个人信息安全影响评估报告表明存在高风险时。</div>
      <div class="text">◆ 如何联系我们</div>
      <div>
        如您对本政策或您个人信息的相关事宜有问题、意见或建议，可以通过下列途径联系我们，我们将竭诚为您解答或处理：
      </div>
      <div>（1）访问先锋用户中心首页“意见反馈”留言反馈。</div>
      <div>（2）访问先锋用户中心(各公众号，如网信官微）查询有关说明；</div>
      <div>（3）发送邮件至xxbg@ucfgroup.com。</div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'AgreementDetail',
}
</script>

<style lang="scss" scoped>
.line {
  font-size: 13px;
  font-family: PingFangSC-Medium, PingFang SC;
  font-weight: 500;
  color: rgba(51, 51, 51, 1);
  text-decoration: underline;
}
.pl30 {
  padding-left: 30px;
}
.pt15 {
  padding-top: 15px;
}
.c-title {
  height: 20px;
  font-size: 14px;
  font-family: PingFangSC-Medium, PingFang SC;
  font-weight: 500;
  color: rgba(228, 21, 21, 1);
  line-height: 20px;
  margin: 15px 0;
  text-decoration: underline;
}
.t-title {
  font-size: 14px;
  font-family: PingFangSC-Medium, PingFang SC;
  font-weight: 500;
  color: rgba(51, 51, 51, 1);
  margin: 20px 0;
}
.text {
  font-size: 14px;
  font-family: PingFangSC-Medium, PingFang SC;
  font-weight: 500;
  color: rgba(51, 51, 51, 1);
}
.dcfgvhbjn {
  width: 100%;
  font-size: 15px;
  font-family: PingFangSC-Light, PingFang SC;
  font-weight: 300;
  color: rgba(102, 102, 102, 1);
  line-height: 24px;
  letter-spacing: 1px;
  p {
    padding: 0;
    margin: 0;
  }
  .top {
    text-align: center;
    width: 100%;
    height: 40px;
    line-height: 40px;
    background: rgba(243, 248, 255, 1);
    box-shadow: 0px 3px 4px 0px rgba(60, 96, 172, 0.15);
    font-size: 16px;
    font-family: PingFangSC-Medium, PingFang SC;
    font-weight: 500;
    color: rgba(51, 51, 51, 1);
  }
  .wrap {
    margin: 15px 15px 0 15px;
  }
}
</style>
