<?php

/**
 * ECSHOP 会员账号管理语言文件
 * ============================================================================
 * * 版权所有 2005-2018 上海商派网络科技有限公司，并保留所有权利。
 * 网站地址: ；
 * ----------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和
 * 使用；不允许对程序代码以任何形式任何目的的再发布。
 * ============================================================================
 * $Author: liubo $
 * $Id: users.php 17217 2011-01-19 06:29:08Z liubo $
*/

/* 列表页面 */
$_LANG['debt_order_id'] 	= 'ID';
$_LANG['debt_user_name'] 	= '会员名称';
$_LANG['debt_user_id'] 		= '会员ID';
$_LANG['debt_user_mobile_phone']	= '手机号码';
$_LANG['debt_account'] 		= '订单总金额';
$_LANG['debt_detail'] 		= '债权详情';
$_LANG['debt_order_sn'] 	= '订单编号';
$_LANG['debt_is_rollback'] 	= '债权回退标识';
$_LANG['debt_status'] 		= '订单状态';
$_LANG['debt_createtime'] 	= '生成时间';

?>
