<template>
  <div class="contain">
    <p>尊敬的投资人：</p>
    <p class="t2">
      您好，借款企业仍未还清您投资的本金，网信多次督促其还款，经数次沟通协调，借款企业根据企业现金流短缺的实际情况，特制定出如下兑付方案：
    </p>
    <p class="b">A.现金兑付</p>
    <p class="t2">
      鉴于目前借款企业的现金流情况，企业承诺根据目前待还款本金，每月按不低于投资人投资待还本金余额（截至发布本方案时）的3.3%进行兑付直至清偿完毕您所投本金。待企业现金流改善后将尽可能提高待还款本金比例。
    </p>
    <p class="b">B.实物抵债兑付</p>
    <p class="t2">
      借款企业考虑到投资人债权变现的迫切需求，将拿出部分小户型房产对其债务进行实物抵债（冲抵本金）。在自愿的前提下，投资人可以用所持债权（特指本金）1:1冲抵购房款项。（相关房产情况简介如下）
    </p>
    <p>借款企业提供的可用于实物抵债兑付的资产情况：</p>
    <p>（1）养老社区房产</p>
    <p class="t2">
      西北首家CCRC养老社区，2015年开业至今，先后被评为中国医养结合十大品牌、西安市五星级养老机构、陕西省第一批养老服务标准化示范单位等。
    </p>
    <p>多种户型42㎡--96㎡，单价14,705元—15,205元/㎡，购买无限制。</p>
    <p>（2）养老社区商铺</p>
    <p>养老社区一层商铺</p>
    <p class="mb">多种户型132㎡--157㎡，单价25,000元/㎡，购买无限制。</p>
    <p class="mb t2 fb">根据借款企业制定的如上兑付方案，请您自愿慎重选择，选定后将根据具体方案执行兑付。</p>
    <p>如有疑问，请咨询客服，客服电话：010-89920001</p>
    <p>工作时间：9：30--17：30</p>
  </div>
</template>
<script>
export default {
  name: 'planeInfo'
}
</script>
<style lang="scss" scoped>
.contain {
  padding-top: 10px;
}
p {
  line-height: 24px;
  @include sc(14px, #666);
  &.t2 {
    text-indent: 2em;
  }
  &.mb {
    margin-bottom: 10px;
  }
  &.b {
    color: #000;
  }
  &.fb {
    font-weight: bold;
  }
}
</style>
