<template>
  <div class="container">
    <mt-header class="header" title="协议">
      <header-item slot="left" v-bind:isClose="true" v-on:onclick="goBack"></header-item>
    </mt-header>
    <div class="content">
      <h2>兑付协议</h2>
      <p>甲方（发行人）：</p>
      <p>乙方（投资者）：</p>
      <p>身份证号________________</p>
      <p>联系方式_______________</p>
      <p>丙方（担保方）：西安荣华集团有限公司</p>
      <p>鉴于：</p>
      <p>
        1、甲、乙方及北京经讯时代科技有限公司（下称“经讯公司”）于__
        __年___月___日签订了《产品认购协议》，乙方通过经讯公司运营并提供居间信息服务的网络平台（网址：www.ncfwx.com，手机APP）认购甲方发行的
        ______________产品（下称“认购产品”）。
      </p>
      <p>
        2、乙方在签订产品认购协议时，经讯公司、挂牌机构已向乙方提供了《产品说明书》、《产品认购风险揭示书》，乙方并已向经讯公司、挂牌机构出具了《合格投资者承诺函》。
      </p>
      <p>
        3、丙方为甲方提供产品发行担保。基于以上事实，经各方充分协商，在合法、自愿前提下各方就认购资金兑付事宜达成如下约定，以兹共同遵守：
      </p>
      <h4>一、认购产品基本情况</h4>
      <p>各方一致确认，根据《产品认购协议》约定，认购产品基本信息如下：</p>
      <p>产品名称：_____________________________</p>
      <p>认购金额：【】元</p>
      <p>待还本金余额：【】元</p>
      <p>产品期限：【】个月</p>
      <p>预期年化收益率：【】%</p>
      <p>本金及预期收益支付方式：_____________________________</p>
      <h4>二、兑付情况</h4>
      <p>
        1、各方一致确认，截至本协议签订日，甲方/丙方已累计兑付乙方本息合计【】元，其中兑付本金【】元、兑付利息【】元。
      </p>
      <p>2、各方一致确认，截至本协议签订日，甲方向乙方待兑付本金【】元</p>
      <h4>三、兑付方式</h4>
      <p>各方一致同意，本协议签订生效后甲方将采取如下方式向乙方兑付本协议第二条约定的待付本金：</p>
      <p>
        1、自【 2020 】年【 1 】月【 25 】日开始，甲方在每个自然月的【 25
        】日（如遇节假日，顺延至下一工作日）向乙方按比例兑付待付本金，其中：第一月兑付比例为待付本金的4.3%，以后每月的兑付比例均为待付本金的3.3%，直至本金全部兑付完毕。
      </p>
      <p>
        2、本条第1款约定的本金兑付完毕后，乙方不再向甲方/丙方主张任何权利或款项（包括但不限于依照产品认购协议约定或依照法律规定已产生/待产生的所有预期收益、资金占用费、违约金、赔偿金等），甲乙双方、乙丙双方再无任何债权债务争议，产品认购协议及本协议均因履行完毕而终止。
      </p>
      <h4>四、收款账户</h4>
      <p>乙方指定收款的银行账户信息如下：</p>
      <p>账户名：</p>
      <p>开户行：</p>
      <p>账 号：</p>
      <p>
        上述银行账户是乙方提供给甲方的唯一收取兑付本金的银行账户信息，甲方按约定将待付金额支付至该账户即视为甲方已经履行了当期支付义务。
      </p>
      <h4>五、其他事项</h4>
      <p>
        1、本协议构成各方就产品认购协议下认购资金及预期收益兑付所达成的完整协议，并取代各方此前所达成的任何与本协议相同或类似的协议、谅解、陈述或其他约定（无论书面或口头形式，包括各类沟通形式）。
      </p>
      <p>
        2、通过在线形式签约电子合同的，各方委托【北京有解信息科技有限公司】保管所有与本协议有关的交易文件及电子信息。各方同意并确认由【北京有解信息科技有限公司】提供的与本协议有关的交易文件及电子信息在无明显错误的情况下应作为本协议有关事项的终局证明。
      </p>
      <h4>六、争议解决</h4>
      <p>
        各方因履行本协议而产生或与本协议有关的任何争议，应首先通过友好协商解决。若协商不能达成一致，任何一方均可向甲方住所地人民法院提起诉讼。争议处理期间，当事人仍应恪守各自的职责，继续忠实、勤勉、尽责的履行本协议约定的义务。
      </p>
      <h4>七、协议生效</h4>
      <p>
        本协议采用电子文本形式制成，经各方通过【北京有解信息科技有限公司】平台电子合同签署系统在线点击确认后生效。本协议留存于平台为此设立的专用服务器上备查，各方均确认本协议的真实性，并认可该形式合同的法律效力。
      </p>
      <p>（以下无正文）</p>
      <p>甲方：</p>
      <p>日期：</p>
      <p>乙方：</p>
      <p>日期：</p>
      <p>丙方：</p>
      <p>日期：</p>
    </div>
  </div>
</template>
<script>
import { HeaderItem } from '../../components/common'
export default {
  name: 'agreementPage',
  data() {
    return {
      id: this.$route.query.id ? this.$route.query.id : '',
      type: this.$route.query.type ? this.$route.query.type : ''
    }
  },
  methods: {
    goBack() {
      this.$router.replace({ name: 'newPlanVote', query: { agree: '1', id: this.id, type: this.type } })
    }
  }
}
</script>

<style lang="scss" scoped>
.container {
  height: 100%;
  background: #fff;
  display: flex;
  flex-direction: column;
}
.header {
  width: 100%;
}
.content {
  flex: 1;
  overflow: auto;
  padding: 0 20px;
  line-height: 18px;
  h2 {
    font-size: 19px;
    color: #000;
    line-height: 26px;
    margin-top: 30px;
    margin-bottom: 10px;
    text-align: center;
  }
  h4 {
    font-size: 14px;
    font-weight: 700;
  }
  p {
    font-size: 12px;
    color: #666;
  }
}
</style>
